[
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "Have you seen bidirectional bike lanes in Seattle that are only on one side of street? There is one on Ravenna, another around Green Lake and others in the UW District. Seem to use street space well. Might help on Eldridge to save space for delivery vehicles to park.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "A couple of questions -- who were the consultants hired to perform your parking studies, and at what times of the day were the studies performed?  As a Parking and Transportation professional with over 30 years experience, I have a great deal of interest in Bellingham's curious management of its parking program.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "How can we also get vertical posts for the bike lanes on Meridian and Illinois? They're wider and Bellingham's traffic count map shows higher numbers for those streets than for Eldridge.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "What measures are being taken to ensure continued access for people who need to park close to their destinations for accessibility reasons? To prioritize cyclists and pedestrians without a plan for accessible parking can greatly reduce the mobility and independence of disabled residents. Not everyone uses mobility aids and many need parking readily available.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "From the survey: what is the distinction being made between \"dedicated space for bikes\" and \"physically separated bike lanes\"? Also, where parking will be retained on one side of a street, are there opportunities to place the bike lane between the parked cars & the curb? (through or over bulbouts if they already exist)",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "I watched all three of the videos offered by the city. I didn't hear any talk about personal accountability in watching all three videos. I see, on a daily basis, people on bikes not following the rule of law that they demand cars follow, why is this? It is frustrating and frightening having a careless biker hop off the curb or dart in and out of vehicles while not adhering to stop signs or traffic lights. My pity or willingness to share the road diminishes more and more every time I see these actions of the large community of bike riders. \r\nAlso, parking is already limited around all of Bellingham, taking away more without having an option is short-sighted.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "I don't recall that much \"street\" parking in some of the areas you are planning on putting your bike lanes.  How does that work?",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "I see that part of the improvements to W Illinois St. include adding sidewalks to both sides of the street.  I live on the south side of Illinois where there are no sidewalks.  Do we know at this point if the width of the added sidewalk will be accommodated by the elimination of parking on one side of Illinois, or will there be an additional easement needed onto properties on the south side of Illinois?",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "In some places having parking along the roadway helps to keep speeds lower. Would there be appropriate treatments to the roadway to help keep traffic speeds from creeping up?",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Parking Removal for Bike and Pedestrian Upgrades",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "Could there be a different street used for west-bound bike traffic? The north side of W Illinois has no cross streets for parking or deliveries.",
    "source_url": "https://engagebellingham.org/2023-parking-removal?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Contact the Bellingham Plan Team",
    "author": "",
    "timestamp": "3 months ago",
    "content": "Could you provide a link to the actual Draft Land Use Chapter? I see links to a power point, to a one-page summary, and to a list of goals, but cannot find the actual chapter. Thank you.",
    "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Contact the Bellingham Plan Team",
    "author": "",
    "timestamp": "3 months ago",
    "content": "Will the housing component include childcare facilities in all new apts?",
    "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Contact the Bellingham Plan Team",
    "author": "",
    "timestamp": "10 months ago",
    "content": "I have tried to get on to the survey, but it will only get 2 of the questions! I have tried several times and when you punch in \"next\" it goes back to the original question.",
    "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Contact the Bellingham Plan Team",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Where is the survey online that asks me to rate services and amenities/discourage or encourage certain types of business? I cannot find it although the hard copy I have says that it can be completed online…",
    "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Civic Athletic Complex Master Plan",
    "author": "",
    "timestamp": "5 months ago",
    "content": "Why or why are we continuing to turf over our natural fields? I'm dismayed that our school district and city aren't able to figure out drainage of natural turf. Please reconsider any use of artificial turf for school playfields. It's a shame that we're trending towards our children growing up running around on plastic...",
    "source_url": "https://engagebellingham.org/civic-athletic-complex?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Civic Athletic Complex Master Plan",
    "author": "",
    "timestamp": "6 months ago",
    "content": "Hello,  Where will the bellingham co-ed softball teams play when Geri fields are removed?",
    "source_url": "https://engagebellingham.org/civic-athletic-complex?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Civic Athletic Complex Master Plan",
    "author": "",
    "timestamp": "6 months ago",
    "content": "Dear City of Bellingham,\r\n\r\nI am writing to provide feedback on the Civic Athletic Complex Master Plan, specifically regarding the preservation of mature trees on the site. I strongly support the City's efforts to preserve the central mature forest area within the complex, as this forest contains several Landmark Trees that are crucial to the health of our urban environment.\r\n\r\nHowever, I am concerned about Option 2, which could threaten Landmark Trees located directly north of the Sportsplex. It is essential that the final design of this option takes these trees into account and ensures they are fully protected from any development impacts. These trees are not only valuable for their environmental contributions but also for their historical and aesthetic significance to our community.\r\n\r\nI urge the City to commit to protecting all Landmark Trees at the Civic Athletic Complex, in line with the protections required of residents and private developers in public development projects. Preserving these trees is critical for maintaining Bellingham’s green spaces and urban ecosystem.\r\n\r\nThank you for considering my input.",
    "source_url": "https://engagebellingham.org/civic-athletic-complex?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Civic Athletic Complex Master Plan",
    "author": "",
    "timestamp": "6 months ago",
    "content": "Why take down mature trees without a plan to work around some of them?  Save the landmark trees",
    "source_url": "https://engagebellingham.org/civic-athletic-complex?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Civic Athletic Complex Master Plan",
    "author": "",
    "timestamp": "6 months ago",
    "content": "Greetings - I was not able to attend the Civic Complex plan open house, but I'd like to add my feedback. Overall, I like the idea and look forward to receiving more updates and opportunities to provide feedback, but I'd like to also see a Senior Center be included in the plan to be in the complex. I realize there are plans via Whatcom and Bellingham to relocate a Senior Center in the northern part of town in several years, but having a Senior Center in the vicinity of the complex where there are better and more bus stops and next door with the Lakeway centers provides for a better location and services. Please give it some consideration and thanks for the opportunity to provide feedback.",
    "source_url": "https://engagebellingham.org/civic-athletic-complex?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Will this process result in any changes to our transportation infrastructure that is binding? I keep reading about reducing the use of single occupancy vehicles while encouraging walking, biking, and transit, but I haven't read about any specific plans beyond what's already in place. Isn't transportation one of the biggest contributors of climate change? It will take decades for everyone to have an electric car, and those still have negative impacts on climate through infrastructure requirements. We need to move rapidly towards an environment where walking, riding a bike, or taking a bus is far more convenient than driving. It should be the easy choice.  So, again, will there be anything that is binding coming out of this process?",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Good afternoon friends. I recently saw that Bellingham has received some money to install chargers for electric cars which is fantastic. I own a Tesla and was wondering if the city has also contacted Tesla about them installing Tesla super chargers in Bellingham. Last year Teslas were few and far between. This year I see 2 or 3 each time I venture out on the roads. I do most of my charging at home but when driving to Seattle and back I need a Tesla super charger to help out. \r\n\r\nThanks and keep up the good work in transitioning us to a sustainable energy future. \r\n\r\nKind regards,\r\nSteve Bottle",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Why do you keep letting developers clear cut entire lots?  I think we should not allow any trees to be cut that are over a certain size.",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "When will policy changes get implemented? I've been following this timeline since late last year and I'm concerned that it's taking too long to go from planning to policy changes. I understand COVID-19 is probably making this dramatically more difficult than expected. To clarify, I'm thinking of policy changes like electrification requirements and building efficiency requirements (not just municipal but community-wide). I'm looking forward to this so we can get serious about the necessary GHG reductions in our city. Thanks!",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "almost 5 years ago",
    "content": "1. Why does PSE administer solar panel refunds from the state?  This is a conflict of interest.  *especially* the once-per-year saved-energy purge -- why do they get to do this?  Why can't that saved energy either stay banked for me, or be something I can donate to community members in need?  Why does it go back to PSE.  Straight-up theft, as it is currently.\r\n2. How can we work toward battery stations that houses / neighborhoods can store excess electricity into -- so houses that cannot put enough solar panels on the roof can buy power from it, rather than PSE.\r\n3. Why doesn't the city make solar panels / south-facing roofs, etc. mandatory on new construction?",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "This isn't about climate change but about this website's format? How am I supposed to ask  question if you turn off the ability to post a question? All I want to do is contact someone who works in the transportation department to talk about an issue my neighbors and I have been seeing in our neighborhood. How am I supposed to even direct this issue to someone when you remove the ability to even post a question? So I'm doing it in this post. Please email me.",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "Why can't you tell citizens of Bellingham about the Tier 2 #3  Electrify Existing Buildings proposal now,  so that they can plan and will not purchase the gas systems and appliances with rebates that the gas companies are pushing?",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham Climate Action",
    "author": "",
    "timestamp": "almost 5 years ago",
    "content": "We have natural gas heat in our home which is economical and affords quality warmth. It is much better then heat from a heat pump system. I have not seen any specific data on the benefit to overall goals changing out a home gas heating system will accomplish. Also why was Cascade Natural Gas included in the original development of goals. You included an entity that had conflicting interest or electric and gas?",
    "source_url": "https://engagebellingham.org/climate?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "about 1 year ago",
    "content": "When Birchwood? I would love to get rid of Comcast/Xfinity",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Hi, the survey asks for Jitter as one of the results on the Speedtest.net test, but (at least on Chrome on a Mac) that metric isn't provided.",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "I was unable to complete the survey because of the speed test -- my results showed four different numbers for \"Ping\" and nothing at all labeled \"Jitter.\"",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "What good is trying to take the survey when I get the message \"no internet\"?  This happens frequently with Comcast.",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Hi - Is the survey only intended for city residents?  I live just outside the city limits at Lake Padden Estates.\r\n\r\nThanks",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "The speed test was to a specific provider in San Jose CA (at least for me).  That is almost pointless test, as it tested more than just my ISP connection.  \r\n\r\nI don't think the City of Bellingham is qualified to run an internet service.  Why not focus on what the city charter includes, and leave the other stuff for private vendors who will provide cheaper and better service?",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Community Broadband Internet Survey (closed)",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "I just took the broadband survey and thought I’d point out one oversight. I was asked to do a Speedtest and then say whether it was less than the advertised speed. Because I have 1Gbps internet and I was on wifi on my phone it was less because of local hardware bottlenecks (wifi from a hub a couple rooms away). The wired speed is ~950 down and 950 up. Anyways, my situation skews the question results because it makes it sound like my provider is not providing the advertised speed, when actually it’s because of a bottleneck in my test environment. I think one of the questions should have been whether the survey was being taken while on wifi or wired Ethernet.",
    "source_url": "https://engagebellingham.org/community-broadband-internet-survey?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "about 2 years ago",
    "content": "\"Data on the housing market should include, to the extent information is available, an estimate of the number of vacant or abandoned buildings and whether units in these buildings are suitable for rehabilitation. 24 CFR 91.210 (a)(2)\"\r\nI didn't see any information or text cover the rehabilitation suitability of the count of buildings that could be brought into the rental market. What steps are you planning on taking to bring existing homes into the rental market supply?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "about 2 years ago",
    "content": "In the \"Draft Consolidated Plan for Public Comment\", there is a table on Page 66 titled \"Households vs. Housing Units Affordable by Income Range\". Is it correct to assume that if the \"number of housing units\" exceeds \"number of households\", the data suggests that category of income has sufficient inventory?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "Can you please define “equitable housing “ and what this means?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "What is the city already doing, and what more could be done to help people looking for work, especially people of color, so that they can afford housing in this town?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "Citizen asked: \"Why not tax landlords?\"\r\nCity response: \"This seems like more of an suggestion than a question.\"\r\n\"Why not tax landlords?\" Is a question. Please supply an answer to the legitimate question. Thank you.",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "Why not tax landlords?  Not the mom and pop kind but companies or individuals with more than X number of dwelling units.  All other businesses in Bellingham pay a B&O  tax.  Why are landlords exempt?  Perhaps me some sort of B&O tax rebate/credit/deduction for keep rents below a certain level.",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Why do so many of Bellingham’s residents actions  enable  homelessness  instead of requiring personal accountability from adults? Adults should rise to the level of expectations not be promoted to be content with none.",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Everyone knows giving the homeless houses doesn't work, just look at los Angeles and san Francisco! You can't keep taxing residents of Bellingham and spending ten's of thousands on a fraction of 1% of the population. My house is up for sale and as soon as it sells I am out of washington! my kids have all ready moved! and I am born and raised here with relatives buried here and I can't  wait to get out of here!  !  !",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "I'd love to see the city invest directly in housing that can be owned by our community and rented without a profit motive, to provide more affordable housing options in our town. Are there any plans to do this?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Bellingham's Consolidated Plan",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Didn’t 22 State Street and Francis Place turn out to be a disaster?",
    "source_url": "https://engagebellingham.org/consolidated-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What happened to the off leash dog park that was supposed to be in Phase 2?  We really need an off leaseh area in this park.",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What's up with the proliferation of \"15 Ton Limit\" signs on every single bridge?",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What kind of rose bushes are you going to plant for the rose hedge?",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What is your tree planting? This park is a wonderful addition but it is pretty barren.",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "The intro says: \"Please check out the full project scope, budget, and schedule in the Cordata Park Phase 2 Presentation underneath the \"Documents\" tab.\" - where is the Documents tab?",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Will there be light over the pickleball and basketball courts So we can have recreation until the park closes at 10 o’clock? If not this is highly desired and would be willing to help fund raise to make it possible",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "How many pickleball courts are planned?",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Cordata Community Park Phase 2",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Will there be more shade planned for this site (landscaping or additional shelters?)",
    "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "As nice as it might be to have a more substantial new entrance sign to replace the \"temporary\" one in place currently, the \"temporary\" sign appears to me to be plenty visible, plenty stylishly good-looking, plenty honorary of the great beauty of the park, identifies the park plenty well, so why not leave it as it is now and use precious funds to feed or house less fortunate citizens of Bellingham, or fill other truly pressing needs (hire one more police officer to be of assistance when the police department claims to be so short-handed that they can't enforce laws)? Thank you for your consideration.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "I like the Idea of trying to replicate what was there. I think having the two columns on either side of the entrance like in option 3 but also having a larger sign in the middle similar to 1 or 2 where the sign is easier to read and more obvious would be good.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "What’s wrong with the current sign?  I would much rather see the money used for renovations and maintenance, such as resurfacing the tennis courts and lining both courts for pickleball.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "I keep the existing sign as it is readable to motorists. Also, repaint the crosswalk and paint the curb white on the island.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Hi Gina,\r\n I see that after all this time no other options are being offered, despite several community comments requesting/suggesting alternatives. It feels like this forum for public comment is just a nod to the community, a way to say later that public comment was allowed. Clearly you have every intent on moving forward with this project and moving it into the permitting stage regardless of public comments submitted here or elsewhere.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "I would much prefer that all the money go to fixing Arroyo Par so that community members can hike, ride, bike there again.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Needs a sign approaching park  \" PARK ENTRANCE\"  with arrow, due to complex traffic situation. \r\n         (Survey at other parks too.  Some are obscure, uncertain, or within residential streets.)",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "I am not excited about any of them. The current sign is adequate and $75k is a ridiculous pricetag for such a thing.. Please use that money to make park repairs - such as fixing Arroyo Park bridge and those washouts or fixing the rotting/derelict Woodstock Farm buildings.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "In General:   You can't set your phone GPS to meet up in parks or share w others.  Every entrance to each park should be distinctly named & identifiable on a search. (the street name?) for joining visitors, groups successfully.  Please discuss / forward rather than dismiss this.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Fairhaven Park Entrance Sign",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Don't let design edge out function.  This is a public park's main entrance, so it's important that the sign be easily readable.  Even more so in this case, since it has to be readable by a driver coming around the curve at 25mph (or more), getting into a narrow turn lane and negotiating a driveway split by an island and with a crosswalk in front of it.  The park's name should be big enough and have enough contrast to be read at a glance.  And not be covered by ivy leaves, which would grow out over the letters the second you turned your back on them :).  Those are good reasons to go with a permanent version of the sign that's there now.  Any lighting should shine on the park's name.  I agree with SusanW about setting the sign back for visibility to exit the park, and also about refreshing the plantings across the island and both sides of the driveway.  Other than the not-legible-enough name, I like the looks of Option #4 the best in general.  A lantern or finial at the top would look more historic (more like the pillar at the corner of the park by Chuckanut Center or like the originals here at the entrance).  I realize these are artist's renderings, but the yellow stucco appearance of #1 and #3 doesn't look anything like Chuckanut sandstone to me, and I like a straight column much better than the craftsman-looking tapered column of #3.  As other commenters have said, #2 looks too much like entrances to malls or condo developments.  If it were built of real Chuckanut sandstone, that might make a difference?  I'm not sure.  The pattern of an entrance sign with a stone facing is very familiar, so the lantern on this one seems oddly and kind of gracelessly plunked there.  When all is said and done, I would favor a short brick column with a hanging flower basket on either side of the driveway, and a standard, very legible park sign on the island.",
    "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Family Definition: Accommodating Today's Families",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Could you post an update about this topic, please? How did last year's state law impact how City Hall will proceed? Thank you!",
    "source_url": "https://engagebellingham.org/family-definition?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Family Definition: Accommodating Today's Families",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "We're definitely in Spring 2021 at this point, is this matter on the schedule / agenda for the planning commission yet?",
    "source_url": "https://engagebellingham.org/family-definition?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Family Definition: Accommodating Today's Families",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "Dick Conoboy mentioned a e-mail he provided to the Planning Commission during last night's work session.  Can we have a copy of that e-mail?  R. Perry Eskridge, Whatcom REALTORS®",
    "source_url": "https://engagebellingham.org/family-definition?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "In answer to  your response about the “streateries ”..why does  there need to be evaluation about the best path forward?? We need our streets and sidewalks back. Those restaurants do not own the streets and the sidewalks and should not be allowed to do business on them!! I certainly would not be allowed to set up a tent and sell wares or food!!!",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "So 12000 cars use Holly a day. And how many bikes? 12? 120? And how many of those bikes pay road taxes and licensing fees? Once again a whiny vocal minority who do not contribute a dime screw those paying the way. Waiting for Atlas to shrug...",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "12 months ago",
    "content": "\"Thank you for that feedback. We will make sure this comment is included in the final report. we will definitely be taking into account how much the new bike lane is actually getting used.\" \r\n\r\nNo...you won't listen and change unecessary road closures!...every single lane closure, road diet that the COB has implemented is still being forced on the citizens. Bike riders now have 50% of road capacity...I am tired of COB saying they are gpoing to change the weather (climate change) by creating MORE traffic congestion in a GROWING city....stop this bike lane nonsene. STOP closing traffing lanes!",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "Has a counter been installed to track how many bikes are using the lane on a daily bases? We count cars all the time, shouldn't we count bikes to see if the impact on vehicle traffic is worth having the bike lane? If the usage is low, then why have a lane? Just welcome bikes on the road with cars. Speed is low in the downtown corridor.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "A ridiculous use of tax dollars with poor planning, lack of common sense and failure to solicit feedback before implementation.  And before you cite that \"[T]his project actually stems from the community-built Bicycle Master Plan,\" read back through the comments to discover that the Bicycle Master Plan must be devoid of common sense and a serious lack of public input.  I'm skeptical that this plan had more than 4 contributors in its development.\r\n\r\nBy increasing the number of cars idling at poorly timed lights (has anyone made it down Holly through more than ONE stoplight?!?), you've contributed to more pollution being belched into our atmosphere than before this stupid revision.  COB talks a great game in making it seem a climate friendly city, then implements plans/revisions/ordinances that negate any potential benefit.\r\n\r\nAnd this project will likely have a detrimental impact on downtown businesses as shoppers avoid the headache of driving down Holly.  Who cares that the project didn't impact the number of parking spaces available to shoppers?  It's going to negatively impact the number of shoppers downtown. Period.\r\n\r\nKill this ridiculous project before the pilot program ends.  We need a strong dose of common sense injected into our city government.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "I would like to know how to find out if the Council was presented with the possible downsides of this project before they unanimously approved it?\r\n\r\nIt seems to have made my driving experience more dangerous and unpleasant than I could have imagined. It seems much more unsafe for bike riders (I've already seen one close call).  Please undo.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "Do you consider the needs and wants of all Bellingham citizens when making decisions on very important transportation works?  Or just the 3% of people like me who like to ride a bike into or thru downtown?   I bike all over town, and I think the changes to Holly Street are incredibly naive.  You've taken THE MAJOR road thru the center of B'ham, that connects the South/East neighborhoods to the North/NW, and reduced it down to 2 lanes, and then 1 lane!!!!!   \r\nLet me say that again, what was once THREE lanes from Ellis to Bay streets is now 1 or 2 lanes.  So you have in effect reduced the vehicle capacity by more than 50%.   I like to bike, but not down streets that are bumper to bumper with cars for many hours of the day.  I much prefer to bike on streets that are NOT a major arterial.  When I have biked down Holly Street in the past, I would prefer to be in the vehicle lanes, riding with traffic and making sure all vehicles can see me.   Now I don't want to bike down Holly Street, The bike lanes are awkward at best, dangerous at worst.   In the past, and now, I much prefer to bike on Magnolia, Ellis, Cornwall, the trail along Whatcom Creek, Railroad, etc., depending on where I'm going.  There are many options for biking.   As a bicyclist, I don't need to be on the same roads that were designed to move motor vehicles efficiently thru an area.   You negatively effected 1,000's of drivers to please a couple hundred bicyclists.  Probably less.\r\nI drive, ride the bus, and pedal thru and near Holly St, you have made all options worse.\r\nI know there are bicyclists that applaud any traffic work that has the work \"bike\" in the definition.  But these bicyclists are only looking at it from their perspective.  A perspective that is only shared by a very small % of the citizens.  More people are not going to bike on Holly St because of the changes.  But you have made driving and riding the bus take longer.  Yes, the bus.  I like to ride the bus too, but now it takes buses longer to get down Holly St.  The money spent on the bike lanes on Holly St would have been much better spent on fixing streets, offering bus service later at night, offering more frequent buses, preemptively replacing the bridge on Electric Ave.   Wow, that whole bridge needs replaced.  The traffic impact of having that street closed is going to drastically impact Woburn, Lakeway, and Alabama.  Negatively effecting 1,000's of drivers per day.  You want to see how 1,000's of people feel about the Holly St bike lanes?  \r\nPut a big banner across the street,  with a very short message asking people to go to a website and give a thumbs up or thumbs down to the changes.   \r\nA rationale and realistic gov't is what the people want.\r\nps, You keep the restaurant dining on the streets so Holly squeezes down to 1 lane??  Does someone in the Public Works Dept have a relative that owns one of those restaurants?",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "I have already taken the survey, but wanted to provide some feedback post-parking removal leading into intersections. As a daily commuter down Holly, I was comfortable biking on Holly prior to the bike lanes, but appreciate the dedicated space. Yesterday I saw an adult with a child around 5 on a co-pilot bike which made me smile - this is exactly the demographic the bike lane is for! I also occasionally lead group rides and pre-bike lanes on Holly we would avoid that street all together. Since having the bike lanes installed, we have done three group rides that went down Holly!\r\n\r\nI drive down Holly about once or twice a week and haven't been too impacted by congestions. Instead of getting stopped by a light lower on Holly, I find that I get stopped at one light higher up on the Street but travel time is still the same. As for on a bike, my travel time is faster!\r\n\r\nThank you for this pilot project and the dedication to adding bike lanes throughout Bellingham. I hope the pilot project turns into a permanent solution.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "Are you considering removing the parking which is the stated of most people feeling unsafe, rather than removing the Bike Lane altogether?\r\n\r\nI love the lane and personally have no feelings of unsafety as a biker. I can see how drivers would think it is unsafe, but I think they are lacking the perspective of having used the lane on a bike. It is very hard for me to imagine a cautious biker getting right hooked by even a minimally cautious driver without at least some time to react. It may be hard for cars to see the bikes (because of the parking), but it is not at all hard for bikes to see the cars. \r\n\r\nThe only time I have been bumped by a car turning out of a driveway was when I was traveling west on Magnolia St, on the sidewalk, because I was avoiding Holly St.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Holly Street Bike Lane Pilot",
    "author": "",
    "timestamp": "11 months ago",
    "content": "After taking the survey, I had some follow-up comments and an additional experience on Holly, but the survey wouldn't let me amend or add, so I posted my comments to Facebook and include them here. I do appreciate the City trying to help bicyclists and realize probably no solution will please everyone; just hope a safe solution can be found.\r\n-->  I appreciate the City of Bellingham trying to make Bellingham more bike friendly and safe, but I'm not very comfortable with the revamping of Holly Street, which involves reducing the car lanes from three down to one, with a new bike lane on the right, between the roadside parking spots and the sidewalk. The problem is the poor visibility for cars turning right from Holly onto side streets. Although there's signage that cars have to yield to bicyclists proceeding straight, it's almost impossible for a driver in the slowed traffic to see a bicyclist coming up behind them on the right, on the other side of parked cars, which can include vans and pick-up trucks that block the driver's view. The provided photo, which has little traffic or parked cars, is not representative of my experience. After an initial run down the bike lane, I submitted my comments to the City, but then thought maybe I overreacted and should try it again. On my second attempt, a large City truck cut me off when it turned right, directly in front of me! I don't blame the driver - as I said, the set-up doesn't provide proper visibility. So be careful if driving or biking, and I hope someone doesn't get seriously injured or killed as the City continues their experiments. For myself, I will avoid driving or biking on Holly.",
    "source_url": "https://engagebellingham.org/holly?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Annual HUD Action Plan",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "May I review the Citizen Participation comments received during the public comment period for the 2021 Annual Action Plan and Consolidated Plan are available to citizens for review?  Thank you!",
    "source_url": "https://engagebellingham.org/hud-action-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Have you looked at the city of Spokane and their bike solution on very very busy, high traffic Division Street in the north end of Spokane. They have posted signs which require bicycles to ONLY use the sidewalk. This is a cheap solution to part of the Lakeway problem. Narrowing or reducing car lanes is just scary. As it is now on Chestnut, with 1 less lane, cars speed up in the left lane and then quickly cut into the middle lane before the traffic light which is dangerous and causing road rage. We don't need that on Lakeway which is even busier!",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "I can't get the pins to work, but want to register my agreement with the people saying that we need to definitely not reduce traffic lanes on Lincoln or Lakeway. I'm all for adding bike lanes but not for reducing the traffic leaves we already have. I do believe that would actually decrease safety. Also, making skinny lanes and opening to bikes is actually agist and ablist and I don't feel that the city is considering this. Do you have persons with disabilities and elderly people who rely on cars on your committees? are you working closely on their needs or only on young people who ride bikes needs?",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Thank you for this opportunity to engage.  I'm working on my thoughts on this and wonder how long this will be page will be open for comments?",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "I am wanting to add a comment to the Lakeway freeway underpass to not make changes that reduce the number of vehicle traffic lanes in the limited space. However, when I go to the map and look for the appropriate icon, there is none. The message is clear; this is a project that is intended to enhance bike traffic, and bus traffic, but nothing to deal with improving traffic flow other than to add vehicle turn lanes. If it were, the comment map would have an icon option for making such suggestions.",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "I am new to this page so I apologize if the answer is on here somewhere and I just have not yet found it. In regards to the Lakeway underpass, does this project widen it at all? I found on the map where I have the option to suggest adding bike lanes, but no option of adding vehicle lanes, or adding bike lanes without sacrificing vehicle lanes. And then a related question, could this project include a new freeway underpass or tunnel for bikes and pedestrians so the already limited Lakeway underpass is not further restricted by new bike lanes?",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "Is it possible for the neighborhood on West and East Racine get a light on our blind corner  to get onto Lakeway safely. If your not aware, its a blind corner we have to pull up to the bike lane to even  see if that of on coming traffic. If your not aware the speed limit is 25 on Lakeway till our street Racine then 30 but people drive 50 at Puget Street all the way to Yew Street. It makes it impossible to get on the street.",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lincoln-Lakeway Multimodal Transportation Study",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "Possible to eliminate the free  turn on red from BM Parkway heading east onto Samish Way.  Would eliminate the lane blockage and reduce the traffic getting stuffed on Samish headed south.  The second mesh is the free right from I5 south exit onto Samish Way and then trying to turn up the hill on BM towards the schools.  Or a possible  \"do not block the box\" marked intersection to eliminate the free turn  folks blocking intersection and lanes.",
    "source_url": "https://engagebellingham.org/lincoln-lakeway?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Lorraine Ellis Park Playground",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Sorry, I know it’s unrelated, but any future plans for Fouts Park… playground and landscaping are pretty sad.",
    "source_url": "https://engagebellingham.org/lorraine-ellis-park-playground?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Will the coin-operated meters be phased out?  They are old-fashioned, but nothing beats the convenience of popping some coins into the slot.   Faster and easier than standing in the rain in front of a machine that requires multiple entries and a credit card.",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "For those of us that live downtown there is virtually no parking close to where we live. We resort to street parking and rely on the low cost and free weekends to make it affordable to live in the downtown core. I run a business downtown and rely on that low price parking for my clients as well. It’s going to make parking a nightmare since the closest parking garage is far enough away that it’s a nuisance to get there in the rain. Why are we even changing this in our small town? It’s discouraging local shopping, eating, and living by making it less equitable. Those that rely on the current structure will be pushed out of living downtown by all these increases. Our small town vibe is obviously being taken away. I understand the city needs the revenue, but taking it out on those that want to support local in other ways is unfair. I’ll need to relocate my business if these fees continue to rise, when I want to have as accessible a business as possible. Is it possible to prevent these changes from happening? Where do we go from here to prevent these inaccessible changes?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "I would love to know about proposed paid parking on south Cornwall. \r\nCurrently there are trashy trailers lining both sides of the street.   There is garbage in the street and rats.   There are tennis shoes strung over power lines that indicate it's a drug zone.   I understand that you are trying to beautify Bellingham.   Perhaps this is a good place to start and place parking meters. \r\nThank",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Some days it is impossible to find a parking space at boulevard park.  Will you be adding meeters to the parks to increase turnover?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "I have recieved feedback from many people who have expressed fear using the Commercial Street parking garage becuase the homless use the place for various activites.  Will this problem be remedied as part of this parking fee change?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "During December you had free parking.  Did you analyze data on parking volume and length.  Did you analyze data on merchants' and residents' satisifaction?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Why isn't there a parking validation option?   Cob needs to support the people visiting the businesses downtown.   Without customers you won't have businesses.    With paid parking I am not a customer.",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "I'm not particularly opposed to the increase in hourly parking, but I have concerns about how progressive rates could affect shopping at downtown businesses. Rather than promoting spending time downtown to shop, progressive rates instead seem to discourage staying downtown for any length of time. Surely this will end up negatively impacting downtown retail and restaurants?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What will it cost the city to purchase 47 parking meters for Fairhaven and what is the projected pay off time for that, along with the constant administration and maintenance of this program?  When will the Fairhaven District see any money put toward creating public parking lots or facilities?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Paid Parking Changes",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "What accommodations will the City be making for residents of low-income housing impacted by newly mandated paid parking?  For some community members, like those in Fairhaven, this will be a cost burden that they did not necessarily anticipate. In these times of unknowns and instability, how will the City mitigate these impacts to low-income households?",
    "source_url": "https://engagebellingham.org/parking?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "On LP ID #94  The map shows a project on Xenia extending all the way to Lakeway Dr. but Xenia doesn’t go through from Old Lakeway to Lakeway. There’s a good-sized gully related to the creek there. Can this part be removed from the project? It adds no value to the connection since the Old Lakeway multi-use path is available in either direction from the intersection of Xenia & Old Lakeway.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Can we lower the speed limit from 35 to 25 on Samish Way between I-5 and Ellis? 3 pedestrians have been hit here in the past two years. Reducing the speed here might make these less fatal.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Under the new proposed plan, what is the optimal route to downtown from the Yew St & Lakeway intersection. With a low priority on Lakeway up to this intersection to add bike lane, and no markings on Woburn to get to left on Fraser St, this still seems it will be unsafe for the next 10 years.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "There was a recent change to the WA State law in Jan 2020 that requires cars to pass with at least three feet of separation from a cyclist. Would this plan add signage to convey this message. WA is one of the last states to add this state law, so it is not as well known, and some cities in other states have adopted appropriate signage and enforcement of this. What is the plan taking this into account?",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "This looks great! I look forward to trying out some of these new bikeways :}. So they'll be installed over the next 10 years?",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Hop on a bike, and ride west-bound on Lakeway at 8am through the Y intersection with Electric. Yikes. A cyclist needs to make eye contact with desperate motorists trying to turn west-bound from Electric onto Lakeway, while simultaneously watching out for even more desperate east-bound motorists making uncontrolled left turns from Lakeway to Electric. Bare minimum there should be a hard lane divider here, as there is at Kenoyer. I cannot over-emphasize how dangerous this intersection is. The only reason why there is not more car vs. bike carnage at this spot and along Lakeway in general is because Lakeway is so bad that the vast majority of Lakeway commuters elect to drive.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "I would love to be able to cycle into town, but there isn’t a safe road on the east side to get to town.  Both James street and Hannegan are so dangerous.  \r\n\r\nAre there any plans to add walking or bike path to either road.  I often see people walking north on Hannegan on a terribly small path on the other side of the guardrail.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Connecting the bike lane from south Yew street to Samish would be very helpful. In the summer there are a lot of mountain bikes coming/going to Galbraith and road bikes using this road but it is very dangerous due to the curves and lack of shoulder. I have seen a lot of near misses here over the years due to lots of traffic and bikes riding slowly in the road. It also makes sense to connect the popular riding destinations with the neighborhoods for kids to use.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "We desperately need a protected bikeway to connect the Meridian/ King Mountain neighborhood to downtown. The north side of town is cut off by I5. In my opinion this should be a very high priority in the bike master plan. The I5 interchange/Telegraph rd on Meridian is the busiest intersection in town, and having a safer bike route across the freeway could go a long way towards reducing traffic in that area.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Pedestrian and Bicycle Master Plan Updates",
    "author": "",
    "timestamp": "over 1 year ago",
    "content": "Looking better. When I moved from Eugene to Bellingham in 2006 I was appalled by how poor the biking infrastructure here was compared to Eugene. Definitely continues to move in the right direction. Highly suggest looking at Eugene as an example of good hiking infrastructure. Keep up the good work.",
    "source_url": "https://engagebellingham.org/pedbikeplans?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Law Enforcement Legislation 2021",
    "author": "",
    "timestamp": "almost 4 years ago",
    "content": "The Use of Force Statistics He does a poor job of interpreting use of force data, provides the information in a PDF, and doesn’t allow a user to have access to the raw data. With the new law requiring reporting, will the city begin providing the required raw data (in a spreadsheet form, not PDF) on its website so residents can see it for themselves?",
    "source_url": "https://engagebellingham.org/policelegislation?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Address and Prevent Homelessness",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "I've heard of some unique concepts for housing homeless people.  What organization should I contact to relay those concepts?",
    "source_url": "https://engagebellingham.org/prevent-homelessness?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Address and Prevent Homelessness",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "First off when is enough, enough. When are we going to put a sweat equity deadline for them. I have traveled across your city and honestly your people have no worries and stay fat dumb and. Happy and prefer to live of the communities money and budget without kicking in  Are you guys ready to finally get a navigation system to get these people back to a part time job and. Pay taxes?",
    "source_url": "https://engagebellingham.org/prevent-homelessness?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Recreation Needs Assessment",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Any plans for a community center?",
    "source_url": "https://engagebellingham.org/recreation-needs-assessment?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Post Point Wastewater Resource Recovery Project",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "Post Point Dog Park - We were told by employees at the treatment plant the the dog park will be permanently closed due to expansion.  Is this correct or is it only being closed while construction is ongoing?  Also people are wondering about the trail to the Heron nesting area - will it be closed off too???",
    "source_url": "https://engagebellingham.org/resource-recovery?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Post Point Wastewater Resource Recovery Project",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "How Many therms and dollars do we spend Incinerating Sewages Annually?  Also how many FTE does it take to maintain and operate said burners??",
    "source_url": "https://engagebellingham.org/resource-recovery?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Post Point Wastewater Resource Recovery Project",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "Have you contacted SGS AXYS Analytical Services in Sidney, B.C. recommended in Re Sources follow-up letter to Mayor et al? Have you looked to other countries using bio solids for other uses than spreading on land?",
    "source_url": "https://engagebellingham.org/resource-recovery?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "When will Bellingham become progressive in providing housing in the format of ADU’s like in Seattle and Tacoma. Bellingham is exceptionally restrictive making it harder to have an ADU for an elderly or disabled family member than to make a bakery with 2 stoves and 4 sinks! The latter one needs to inform the public within 100’. For making a portion of one’s home into an ADU one must inform neighbor’s within 300’ plus the mayor, city council, newspaper, community representative. Bellingham is keeping these regulations hidden from publication to the general public. It appears Bellingham would rather my son be homeless and live on the streets than live in an ADU in my home.\r\nPlease look at the Whatcom watershed regulations which permit motor boats but will not allow an elder to live in their own apartment within their adult child’s home. Bellingham appears to prefer to put the elderly snd disabled away in institutions where they will be forgotten. Equality, equity of respect, fostering health, safety and well being of all individuals is necessary for a healthy community.  Don’t forget the disabled. Don’t forget the federal law, Olmstead Agreement for the developmentally disabled to live in the least restrictive environment. Remember the extended family and making accommodations for the disabled. The planning department is blind to accommodations for those with autism spectrum disorder.",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "In general,  is the city controlling the building of condos on currently undeveloped parcels?  Specifically, is the meadow adjacent to the Connelly Creek trail and the Hospice going to be sold to developers.  If so, I am vehemently opposed.  Enough all ready with the condos!!!",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "almost 4 years ago",
    "content": "Why are there no large developers (Lamar,Toll Brothers,Pulte etc)not building in the Bellingham area?It seems to me that only a few local builders are allowed to develop here.These builders build home at a snails pace and the quality of new homes is sub par.",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Where can I find a map of the areas that are proposed as a \"high density designation\" ?  If there is not yet a map developed, are there certain areas expected to be designated high density or are there areas will a specific current designation (e.g. RM-Multi or something else) that will be proposed to get a high density designation?",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Perhaps you can clarify the answer about height restrictions.  If an area gets a high density designation, does that mean a developer could build higher than existing height restrictions?  Or only that unit sizes would decrease to reach the higher densities?",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Do any of the proposals being considered implicate changes in the height restrictions or methods of measuring heights that already exist in the code and neighborhood plans?",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "Can we start putting in sewer in areas that are not only septic, but are also zoned higher density to allow owners who are willing provide more housing and density? These areas like baker creek put out so much ecoli that they end up polluting Squalicum creek as well.",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Multi-family Zoning: Achieving Intended Densities",
    "author": "",
    "timestamp": "over 4 years ago",
    "content": "I haven't reviewed all the material yet, and I look forward to that. Thanks for gathering all the info and making it accessible. You're helping to raise the bar for what's public knowledge in Bellingham. You can guarantee the Mayor that when more of us understand the concepts and terminology better, we will have better civic discourse. And you can predict we will make progress faster when we're having well-informed participants in our discourse, looking for harmony or at least for what resonates in a pleasant, considerate way. My question involves terminology: Can we please invent or choose words to replace a few terms that cause disharmony? For example, single-family zoning triggers fights on all sides, and single-family is a complete misnomer, regardless of how often it's used in the BMC.  Fact is, most homes (but not all) are occupied by one family, including all the homes in a multi-home apartment building. Instead of single-family homes, maybe try calling them one-family-buildings or something more elegant than one-family structure. Most of us acknowledge that living in a one-family building is a option and a privilege available only to (usually) those of us who can afford it (or who could afford it when detached homes in a nice, walkable Bham neighborhood cost only three or four times your annual income).   There are other terms that could be updated or made more clear, but I thought I'd start at one of the most disharmonious, outdated, planner terms. As a minor improvement, you could start by encouraging us all to say \"detached homes\" when our meaning does not include attached homes?  Third question, is there a dialogue inside City Hall about what using which planning terminology to use, and if so, can I be part of that? I have thoughts but I'm not an expert  - maybe it would help to call in the neologists  :-)",
    "source_url": "https://engagebellingham.org/rmproject?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Secure Housing for Vulnerable Groups",
    "author": "",
    "timestamp": "almost 3 years ago",
    "content": "What work is being done to address critical scarcity of services being made available and accessible to housing locations  that are supposed to offer permanent supportive housing? Have agencies managing them, like the Opportunity Council and Northwest Youth Services - in the case of 22 North, for example - been consulted about the resources needed (other than the funds just offered the Opportunity Council by Whatcom County for the restabilization of 22 North) and how improvements can be made in providing them? How can housing programs better live up to the type of effective services the community and their residents are led to believe are being offered?",
    "source_url": "https://engagebellingham.org/secure-housing-for-vulnerable-groups?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "New Service Request App: SeeClickFix",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "How can I tell if an issue I see is one the city is responsible for fixing?",
    "source_url": "https://engagebellingham.org/seeclickfix?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Outdoor Dining Structures - Streateries and Parklets",
    "author": "",
    "timestamp": "almost 2 years ago",
    "content": "What’s the plan for the streateries that block traffic lanes (ie Holly and Champion)? I do not see any language in this report about how this will be handled. Did the city undertake a traffic engineering study before allowing these lanes to be closed? If not, will it?",
    "source_url": "https://engagebellingham.org/streateries?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Outdoor Dining Structures - Streateries and Parklets",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "Ah... So there already exist requirements for permanent streateries...  Well, then the question becomes what is the present evaluation of the impact of those existing requirements? Are those requirements adequate and effective to promote greater quantity of streateries? What is their purpose and intent?  Is it maximum safety and most rigorous construction and so could not possibly be functional in our present circumstances if our objective is to foster Streateries?  Do the permanent structures regulations function effectively as a restriction on construction? And if so, do we want to consider making the permanent structures requirements less onerous to promote a larger amount of permanent streateries? Also on this front, are any of the current Streateris permanent?  And if not, do you see what the problem is, or do I need to explain it more?",
    "source_url": "https://engagebellingham.org/streateries?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Outdoor Dining Structures - Streateries and Parklets",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "What are the requirements to make the \"streateries\" a permanent feature?  I like their pedestrian focus for downtown.  Less cars, more people, please.",
    "source_url": "https://engagebellingham.org/streateries?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "5 months ago",
    "content": "Many cotton wood trees have been cut down in my neighborhood, but no evergreens were planted to replace them. I’m wondering if there had been a plan or if there is a plan to plant native trees around the Sunset Pond trail, East Orchard where trees have thinned out, Fruitland Drive, or in the green space on Lemon Grove Drive where the city cut down many trees years ago, but did not replace them.",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "12 months ago",
    "content": "I strongly oppose the Urban Forest Plan. \r\nI am concerned that this is going to make development and building housing more difficult and unaffordable.",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "12 months ago",
    "content": "Here are a few random comments that may be addressed in the plan but it's a bit of a complicated read for me. Trees are important for carbon storage but they are also habitat as are large shrubs. Developments also create habitat loss. Is the creation of habitat addressed in another city plan? Is there a plan for 'over mature trees' that could be cut for habitat stumps? Trees and shrubs are also buffers for noise and provide privacy. Are there planting guidelines that suggest planting deciduous trees on the south side of buildings and coniferous trees to the north? Does the idea of using 'best practice forestry' evolve over the 15-25 year life span of this plan. How would this new plan have protected the mature trees that will be lost to the Meridian development?",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "12 months ago",
    "content": "* Education of the public about tree property value can improve voluntary pro-forest behavior. Renters like trees, as do home buyers. Renters will pay higher rent and property buyers pay higher prices. Of course this is somewhat at odds with housing affordability goals...\r\n* Invasive tree threat: horse chestnut trees are on a rapid track to dominate the forest on Chuckanut Creek under the 12th Ave bridge, and spread beyond.\r\n* The public could benefit from education about social trails. In the past I often went off-trail in places like the 100 acre wood, seeking a feeling of wilderness escape. Now I know better, but I see how legions of others have done the same thing, and the area is overrun with social trails. The psychology of that process could be shortcut with some public education.\r\n* Many street trees suck. I see a trend of increasing dwarf character in new street trees. Small, slow growing trees provide little urban forest value.\r\n* People will work for their own self interest. I think that would include forestry work close to home such as planting and tree maintenance. The city could facilitate hyper-local neighborhood involvement (volunteerism) and ownership of common forest resources.\r\n* I really don't see why Native Americans are called out specifically in this plan. There are myriad interest groups and I don't see that Native Americans are really much more special than all those other groups.\r\n* Action item 18. Tree Incentive Program: Expensive $$$$$. Trees are often perceived as only a hassle, due to the required maintenance. I doubt that incentives alone will change much. Owners will plant trees themselves if educated about the economic value of trees. Education is more powerful and less expensive than money incentives.\r\n* Action item 30. Urban Forestry department?? $$$$$  This is creating a king with no kingdom. A beaurocratic nothingness.\r\n* Action item 46. $$$$$ Water newly planted trees for 3 years. With correct tree selection and planting, only one summer of watering is needed.\r\n* Action item 47. $$$$ Mulch trees in parks or large boulevards. If a tree needs mulch to survive, it is not appropriate for that site: don't waste resources on it. Give resources to trees that will grow on their own after a short establishment period.\r\n* Action item 35. $$$$$ Expand the City maintenance list to include all street trees. Why so expensive?",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "12 months ago",
    "content": "We must protect mature trees! They give\r\nBellingham its  beauty and character.",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "12 months ago",
    "content": "I just took the survey. Would like to add that I think the city needs to do a better job of protecting our mature trees. Key example is the BGCC development, which you approved with NO consideration to the many mature trees on the property which will be lost in order to build a few expensive condos. I question whether there will be affordable housing provided in whatever development comes to pass. And planting new trees as mitigation for the 300+ mature trees that will be lost is not an effective solution. We need clear, enforceable city laws to protect our mature trees.",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Urban Forest Plan",
    "author": "",
    "timestamp": "about 1 year ago",
    "content": "I strongly feel West Street (a through street) in the Columbia Neighborhood, would benefit greatly from having more trees planted along this street. Many people drive West Street to pass through to Squalicum Way. Beautiful evergreen and deciduous trees along this road could further amplify the appeal/property values of the Columbia neighborhood as a whole.",
    "source_url": "https://engagebellingham.org/ufmp?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Water Conservation Goal Setting",
    "author": "",
    "timestamp": "2 months ago",
    "content": "I take a bath every day and could use the water to water plants if I could divert the water. \r\nWe could save water in barrels when it rains and use it later. \r\nReplace lawns with vegetable gardens, use drip irrigation\r\nThe Japanese reuse water from washing their hands to flush the toilet",
    "source_url": "https://engagebellingham.org/water-conservation?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Water System Plan Update",
    "author": "",
    "timestamp": "about 1 month ago",
    "content": "From the timeline it appears there are two opportunities for public comment. One by June 6th and then a public hearing in August. What is the purpose and difference between those two comment periods?",
    "source_url": "https://engagebellingham.org/water-system-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Water System Plan Update",
    "author": "",
    "timestamp": "about 2 months ago",
    "content": "Is the discharge outfall from Bellingham WWTP pure enough, and is it being reused in a “purple pipe” distribution system? What is MGD outfall amount",
    "source_url": "https://engagebellingham.org/water-system-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Water System Plan Update",
    "author": "",
    "timestamp": "11 months ago",
    "content": "Hi....does the City system remove PFAs?   \r\n\r\nThank you, \r\nMike McAuley",
    "source_url": "https://engagebellingham.org/water-system-plan?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "over 2 years ago",
    "content": "Loud construction/demolition noise is being generated at all hours, it continued until 2:40am 10/18/2022. Per Bellingham code, quiet hours are 10:00pm-7:00am. What's the deal, and what is the project Manager's home phone number so that we can all call at 2:40 am? Thank you",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Where are the restrooms?",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "about 3 years ago",
    "content": "Hello\r\nWould this park be a good place to plant and maintain educational demonstration gardens?\r\nThe Ferndale Hovander County Park is the current location of the WSU Extension Master Gardeners' demo gardens. But it often floods and  is in Ferndale. \r\nThanks, DeeAnn Perler",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "over 3 years ago",
    "content": "The port's \"interim\" pump track has been a smashing success. How can we promote it from being an interim use of the space to a permanent design element? It would be a real loss of public benefit if the pump track were removed to make way for privately held buildings.",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "almost 4 years ago",
    "content": "Will there be a small boat visitor's float at some point?",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "Is there a budget or a proposal opportunity for public art?",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  },
  {
    "type": "question",
    "project_title": "Waypoint Park Next Phase Development",
    "author": "",
    "timestamp": "about 4 years ago",
    "content": "What is happening in the \"Potential Future Access\" area right now?  How does this new phase planning address this area?",
    "source_url": "https://engagebellingham.org/waypoint?tool=qanda#tool_tab"
  }
]