{
  "0": [
    {
      "suggestion": "Develop and communicate a clear plan to address the homeless crisis in Bellingham."
    },
    {
      "suggestion": "Include specific strategies in The Bellingham Plan to help homeless individuals find housing and support services."
    }
  ],
  "1": [
    {
      "suggestion": "Implement more measures to preserve greenery."
    },
    {
      "suggestion": "Develop more efficient ways to build communities to preserve green spaces."
    }
  ],
  "2": [
    {
      "suggestion": "Support infill development within the City"
    },
    {
      "suggestion": "Support infill development within the City"
    }
  ],
  "3": [
    {
      "suggestion": "Invest in capital improvements for infrastructure"
    },
    {
      "suggestion": "Invest in capital improvements for infrastructure"
    }
  ],
  "4": [
    {
      "suggestion": "Open up Urban Growth Area Reserves for new communities"
    },
    {
      "suggestion": "Open up Urban Growth Area Reserves for new communities"
    }
  ],
  "5": [
    {
      "suggestion": "Increase availability of low barrier and no barrier housing and shelters."
    },
    {
      "suggestion": "Provide more low/no-barrier shelters and daytime shelters for unhoused people."
    }
  ],
  "6": [
    {
      "suggestion": "Implement rent control to keep housing affordable."
    },
    {
      "suggestion": "Implement rent control to address rising rental rates."
    },
    {
      "suggestion": "Implement rent control to prevent rent increases that hinder savings for homebuyers."
    }
  ],
  "7": [
    {
      "suggestion": "Increase frequency of public transit, especially in areas with infrequent service."
    },
    {
      "suggestion": "Extend the length of public transit routes for quicker service."
    },
    {
      "suggestion": "Implement longer running public transit routes for quicker service."
    },
    {
      "suggestion": "Prioritize public transportation in Bellingham to improve accessibility."
    },
    {
      "suggestion": "Implement plan 2 with more frequent bus service."
    },
    {
      "suggestion": "Increase bus frequency, especially in areas outside the Bellingham core, to improve public transportation."
    },
    {
      "suggestion": "Identify and properly implement transit corridors in Bellingham."
    },
    {
      "suggestion": "Increase the frequency of bus services to neighborhoods outside of planned urban villages, such as Sudden Valley."
    },
    {
      "suggestion": "Develop more infrastructure surrounding bus stops to increase ridership in neighborhoods with infrequent bus service."
    },
    {
      "suggestion": "Increase the frequency of bus service."
    }
  ],
  "8": [
    {
      "suggestion": "Enshrine and protect values of diversity, equity, inclusion, and accessibility in city policies."
    },
    {
      "suggestion": "Incorporate diversity considerations into city development."
    },
    {
      "suggestion": "Incorporate inclusion considerations into city development."
    },
    {
      "suggestion": "Incorporate environmental considerations into city development."
    }
  ],
  "9": [
    {
      "suggestion": "Incorporate the North Bellingham UGA Reserve Area into the city UGA."
    },
    {
      "suggestion": "Develop urban villages in the North Bellingham UGA Reserve Area to foster healthy neighborhood communities."
    }
  ],
  "10": [
    {
      "suggestion": "Develop affordable housing including rentals and homeownership for various income levels."
    },
    {
      "suggestion": "Increase housing availability to decrease homelessness and improve affordability for working families."
    },
    {
      "suggestion": "Ensure that the housing added is affordable to local residents."
    },
    {
      "suggestion": "Guarantee that affordable housing units are included in the majority of new developments to ensure affordability is addressed."
    },
    {
      "suggestion": "Provide affordable housing."
    },
    {
      "suggestion": "Provide affordable childcare."
    },
    {
      "suggestion": "Develop more large-scale affordable housing to address housing shortages."
    },
    {
      "suggestion": "The City should reconsider its current focus on permitting more rental properties and instead encourage development of affordable homes for purchase."
    },
    {
      "suggestion": "The City should implement policies that reduce reliance on rental housing and support pathways to home ownership."
    },
    {
      "suggestion": "The City should regulate private developers to ensure they contribute to affordable home ownership options, not just rental properties."
    },
    {
      "suggestion": "Develop affordable housing initiatives linked to employment opportunities."
    },
    {
      "suggestion": "Provide affordable housing options by renting without a profit motive."
    },
    {
      "suggestion": "The city should ensure affordable housing is included in new developments."
    }
  ],
  "11": [
    {
      "suggestion": "Expand and improve public transportation to accommodate increased housing and reduce congestion."
    },
    {
      "suggestion": "Increase and improve public transportation options to accommodate people traveling to mountains, parks, and other areas beyond the city."
    },
    {
      "suggestion": "Increase access to public transportation and make it more convenient and affordable than driving."
    },
    {
      "suggestion": "Activate a more robust transit system to accommodate increased residential housing without parking."
    },
    {
      "suggestion": "Ensure transit options are accessible to everyone, including those who cannot bike or walk."
    },
    {
      "suggestion": "Improve public transit"
    },
    {
      "suggestion": "Prioritize walkability, bikeability, and public transit with safe connections."
    },
    {
      "suggestion": "Promote alternatives to car transportation."
    },
    {
      "suggestion": "Improve accessibility and options for public transit."
    },
    {
      "suggestion": "Improve transit coverage to reduce reliance on cars."
    },
    {
      "suggestion": "Reduce reliance on cars by improving alternative transportation options."
    },
    {
      "suggestion": "Prioritize making walking, biking, and public transit more convenient and accessible than driving."
    }
  ],
  "12": [
    {
      "suggestion": "Provide adequate housing supply for current and future generations in Whatcom County."
    },
    {
      "suggestion": "Reduce barriers to building housing to meet demand and ensure affordability in Bellingham."
    },
    {
      "suggestion": "Address the job market challenges in Bellingham that affect housing affordability and economic development."
    },
    {
      "suggestion": "Increase housing density infill in Bellingham."
    },
    {
      "suggestion": "Increase the number of apartments in downtown Bellingham."
    },
    {
      "suggestion": "Implement bold measures to significantly increase housing supply in Bellingham."
    },
    {
      "suggestion": "Support private builders in constructing affordable missing middle housing types like townhomes and fourplexes in Bellingham and surrounding areas."
    },
    {
      "suggestion": "Adopt plan #2 for housing development in Bellingham."
    },
    {
      "suggestion": "Encourage large developers like Lamar, Toll Brothers, and Pulte to build in the Bellingham area."
    },
    {
      "suggestion": "Allow more builders, including non-local ones, to develop in Bellingham to increase competition."
    },
    {
      "suggestion": "Increase the pace of home construction in Bellingham."
    },
    {
      "suggestion": "Improve the quality standards for new homes built in Bellingham."
    }
  ],
  "13": [
    {
      "suggestion": "Include support for the work of artists in the City of Bellingham's plan."
    },
    {
      "suggestion": "Address the lack of support for local and visiting artists by Bellingham city and county leaders."
    },
    {
      "suggestion": "Correct the omission of arts support in the current Bellingham Plan."
    },
    {
      "suggestion": "Place Arts and Culture more prominently in the Bellingham Comprehensive Plan, consistent with its vital importance."
    }
  ],
  "14": [
    {
      "suggestion": "Recognize and promote the economic and cultural benefits that arts bring to the community."
    },
    {
      "suggestion": "Promote the arts as a means to enhance community wellbeing, tourism, economic benefits, downtown vitality, and community pride."
    }
  ],
  "15": [
    {
      "suggestion": "Focus on utilizing UGA reserves for housing development."
    },
    {
      "suggestion": "Prioritize construction of water facilities to support housing development within city limits and UGA Reserve areas."
    },
    {
      "suggestion": "Develop the UGA Reserve to provide a significant volume and variety of housing options, mainly workforce housing for local residents."
    }
  ],
  "16": [
    {
      "suggestion": "Reinstate and respect Neighborhood Plans to guide development and infrastructure improvements."
    },
    {
      "suggestion": "Continue to develop and update Neighborhood Plans."
    }
  ],
  "17": [
    {
      "suggestion": "Consider the affordability of water, sewer, and utility rate increases for local residents, especially those on fixed incomes."
    },
    {
      "suggestion": "Take into account the cumulative financial burden on residents from rent increases and utility rate hikes."
    }
  ],
  "18": [
    {
      "suggestion": "Implement measures to reduce vehicle speeds to below 40 mph in the neighborhood."
    },
    {
      "suggestion": "Implement traffic calming measures to reduce speeding cars in neighborhoods to improve pedestrian safety."
    },
    {
      "suggestion": "Implement traffic calming measures to slow down traffic on State Street."
    }
  ],
  "19": [
    {
      "suggestion": "Rearrange parked cars to improve line of sight for pedestrians crossing Holly Street."
    },
    {
      "suggestion": "Improve safety and clarity of bike lanes and parking areas on Holly Street."
    },
    {
      "suggestion": "Consider returning Holly Street to 3 lanes of vehicle traffic based on community feedback."
    },
    {
      "suggestion": "Listen to citizens' concerns regarding the Holly St changes."
    },
    {
      "suggestion": "Allow traffic to flow freely on Holly Street to reduce downtown congestion."
    },
    {
      "suggestion": "Address the traffic and safety issues on Holly Street."
    },
    {
      "suggestion": "Consider the impact of non-car street use on traffic flow, particularly on busy streets like Holly, and adjust policies accordingly."
    },
    {
      "suggestion": "Reevaluate the reduction of vehicle lanes on Holly Street to avoid significant decrease in vehicle capacity."
    },
    {
      "suggestion": "Improve bike lane design on Holly Street to ensure safety and comfort for bicyclists."
    },
    {
      "suggestion": "Assess the impact of street dining on traffic flow and consider adjustments to prevent lane reductions on major roads like Holly Street."
    },
    {
      "suggestion": "Make the bike lanes on Holly Street a permanent solution after the pilot project."
    },
    {
      "suggestion": "Reconsider the design of the Holly Street bike lane to improve visibility for drivers turning right onto side streets."
    },
    {
      "suggestion": "Implement measures to enhance safety for both bicyclists and drivers on Holly Street, especially concerning the interaction between bike lanes and parked cars."
    },
    {
      "suggestion": "Increase awareness and caution among drivers and bicyclists using Holly Street due to current visibility issues."
    },
    {
      "suggestion": "Explore alternative solutions to the current Holly Street revamping plan to better accommodate both car traffic and bicyclists safely."
    }
  ],
  "20": [
    {
      "suggestion": "Make Downtown more welcoming and friendly for seniors and families."
    },
    {
      "suggestion": "Enhance walkability in community design."
    },
    {
      "suggestion": "Make downtown car-free as much as possible."
    },
    {
      "suggestion": "Make downtown more convenient to visit."
    },
    {
      "suggestion": "Provide free public transportation options such as buses or trolleys to support a car-free downtown."
    },
    {
      "suggestion": "Increase the number of pedestrianized streets, especially in downtown and Fairhaven, to encourage more foot and bike traffic and create more pleasant public spaces."
    },
    {
      "suggestion": "Continue the streateries program in Bellingham."
    },
    {
      "suggestion": "Prioritize creating people-friendly spaces and increasing pedestrianization over vehicle storage."
    },
    {
      "suggestion": "Continue allowing and supporting streateries in downtown Bellingham to encourage business and community building."
    },
    {
      "suggestion": "Prioritize reducing car traffic and parking in downtown to improve safety and experience for pedestrians and cyclists."
    },
    {
      "suggestion": "Promote alternative transportation options such as biking, bus, and walking to access downtown dining areas."
    },
    {
      "suggestion": "Implement car-free or pedestrian-centered streets downtown."
    },
    {
      "suggestion": "Reinvest revenue from streatery fees into downtown development to create a pedestrian-centered area."
    },
    {
      "suggestion": "Decrease through traffic in downtown."
    },
    {
      "suggestion": "Increase the walkability of downtown."
    },
    {
      "suggestion": "Maintain the current support for streateries to preserve downtown livability and vibrancy."
    },
    {
      "suggestion": "Support and maintain streateries in downtown Bellingham to enhance community atmosphere."
    },
    {
      "suggestion": "Make the outdoor streeteries in downtown Bellingham permanent fixtures."
    },
    {
      "suggestion": "Maintain and support the current streeteries to preserve vibrant downtown living."
    },
    {
      "suggestion": "Maintain or increase pedestrian-focused areas in downtown."
    },
    {
      "suggestion": "Reduce car traffic in downtown to prioritize people."
    }
  ],
  "21": [
    {
      "suggestion": "Consider how the City can support non-city owned and operated facilities that benefit Bellingham residents."
    },
    {
      "suggestion": "Explore ways to enhance facilities and resources without the City of Bellingham owning and operating them."
    }
  ],
  "22": [
    {
      "suggestion": "Allow builders to build more freely to increase housing affordability."
    },
    {
      "suggestion": "Reduce restrictions on builders to enable them to build what they want."
    }
  ],
  "23": [
    {
      "suggestion": "Reduce excessive fees charged before building to make homes more affordable."
    },
    {
      "suggestion": "Eliminate current regulatory impediments to development to improve housing affordability."
    }
  ],
  "24": [
    {
      "suggestion": "Install underground electrical lines for new buildings."
    },
    {
      "suggestion": "Install underground communication lines for new buildings."
    },
    {
      "suggestion": "Install underground electrical and communication lines whenever roads are rebuilt."
    }
  ],
  "25": [
    {
      "suggestion": "Create shorter underground sewer runs by adding the northern treatment plant."
    },
    {
      "suggestion": "Add redundancy to the sewer system by building the northern treatment plant."
    }
  ],
  "26": [
    {
      "suggestion": "Continue to invest in infrastructure to support city expansion."
    },
    {
      "suggestion": "Continue to invest in infrastructure to support city expansion."
    }
  ],
  "27": [
    {
      "suggestion": "Add land to the city to allow for more single family homes to be built."
    },
    {
      "suggestion": "Add land to the city to allow for more single family homes to be built."
    }
  ],
  "28": [
    {
      "suggestion": "Focus on building modest single family homes on small lots to meet demand."
    },
    {
      "suggestion": "Prioritize single family home development to retain residents and their tax contributions within the city."
    },
    {
      "suggestion": "Prioritize building modest single family homes on small lots to meet residents' preferences."
    },
    {
      "suggestion": "Pursue clustered small housing developments on larger lots."
    },
    {
      "suggestion": "Maintain single family housing on larger lots."
    }
  ],
  "29": [
    {
      "suggestion": "Replace the term 'equitable' in city documents with a more specific phrase."
    },
    {
      "suggestion": "Use criteria or characteristics that can be measured instead of the term 'equitable' in city documents."
    }
  ],
  "30": [
    {
      "suggestion": "Provide detailed text chapters instead of only PowerPoint presentations for public review and comment."
    },
    {
      "suggestion": "Provide more detailed and substantive materials for public review beyond conceptual PowerPoint outlines."
    }
  ],
  "31": [
    {
      "suggestion": "Explicitly address water supply as a significant topic in the Climate Chapter due to its importance."
    },
    {
      "suggestion": "Explicitly include streamflow and water supply as topic areas in the Environment chapter due to their importance in growth allocation and planning."
    }
  ],
  "32": [
    {
      "suggestion": "Comprehensively spell out mitigation strategies for sea level rise impacts on shoreline buildings and infrastructure."
    },
    {
      "suggestion": "Include mitigation strategies for sea level rise impacts under coastal resiliency."
    }
  ],
  "33": [
    {
      "suggestion": "Pursue electrification opportunities in municipally-owned buildings."
    },
    {
      "suggestion": "Pursue energy efficiency opportunities in municipally-owned buildings."
    }
  ],
  "34": [
    {
      "suggestion": "Promote urban densification to reduce car dependency, expand public transit, preserve green space, and prevent sprawl."
    },
    {
      "suggestion": "Prevent suburban sprawl."
    },
    {
      "suggestion": "Promote higher density development to reduce sprawl and auto-dependence."
    },
    {
      "suggestion": "Reduce reliance on automobiles by discouraging sprawl."
    },
    {
      "suggestion": "Avoid urban sprawl as described in option 3."
    },
    {
      "suggestion": "Avoid urban sprawl."
    }
  ],
  "35": [
    {
      "suggestion": "Consider the diverse needs of all city residents, including disabled individuals, the elderly, and pet owners, when planning transportation options."
    },
    {
      "suggestion": "Consider the needs of elderly residents who rely on cars and require close parking and services when planning city developments."
    },
    {
      "suggestion": "Ensure city planning considers the needs of people with disabilities and elderly who rely on cars, not just young people who ride bikes."
    }
  ],
  "36": [
    {
      "suggestion": "Preserve and protect green areas in the city to help absorb carbon emissions and improve environmental quality."
    },
    {
      "suggestion": "Require developers to properly green their territories to maintain and increase urban green spaces."
    },
    {
      "suggestion": "Preserve and enhance open spaces and parks, especially in areas with boxy apartment buildings."
    },
    {
      "suggestion": "Preserve green areas in the city during development."
    },
    {
      "suggestion": "Ensure new developments do not compromise the city's aesthetic and green character."
    }
  ],
  "37": [
    {
      "suggestion": "Build safe covered bike parking locations at public transport hubs."
    },
    {
      "suggestion": "Provide covered bike parking."
    },
    {
      "suggestion": "Install secure bike parking in alleyways."
    },
    {
      "suggestion": "Provide safe, weatherproof bike parking in high use areas."
    },
    {
      "suggestion": "Include robust bike parking facilities."
    }
  ],
  "38": [
    {
      "suggestion": "Implement a 'mansion tax' on real estate transactions above a certain threshold to fund affordable housing and homelessness prevention programs."
    },
    {
      "suggestion": "Use funds from the mansion tax to support affordable housing initiatives and programs that prevent homelessness."
    }
  ],
  "39": [
    {
      "suggestion": "Enforce planning and regulations to ensure open space and canopy, especially in low income areas."
    },
    {
      "suggestion": "Increase access to nature and canopy in low income areas to address inequities."
    }
  ],
  "40": [
    {
      "suggestion": "Encourage the construction of naturally more efficient building types such as apartment buildings and townhomes."
    },
    {
      "suggestion": "Prioritize building middle housing types such as duplexes, triplexes, townhomes, live-work units, and courtyard housing."
    },
    {
      "suggestion": "Focus on developing 'starter home' missing middle housing options such as 3-bedroom apartments in fourplexes or townhomes on small lots to provide affordable housing for young couples and families."
    },
    {
      "suggestion": "Prioritize the construction of townhomes (in groups of 4) and fourplexes as the dominant missing middle housing types due to their value, ease of building, and suitability for infill city lots with alleys."
    },
    {
      "suggestion": "Ensure that townhomes and fourplexes receive ample attention in housing development plans and policies."
    },
    {
      "suggestion": "Provide incentives for building new, smaller homes and duplexes, triplexes, and fourplexes."
    }
  ],
  "41": [
    {
      "suggestion": "Remove limits on density such as minimum lot sizes, maximum floor-area ratios, and minimum setbacks."
    },
    {
      "suggestion": "Reduce setbacks, height limits, and floor area ratio (FAR) restrictions to allow more housing construction."
    },
    {
      "suggestion": "Increase the allowable FAR on small lots beyond 0.35 to enable moderate density development."
    }
  ],
  "42": [
    {
      "suggestion": "Diversify housing types to include middle housing and Single Room Occupancies (SROs) to increase affordable housing."
    },
    {
      "suggestion": "Diversify housing types and designs in the community."
    },
    {
      "suggestion": "Develop diverse housing options to accommodate different needs, including rentals, communal housing, small homes, larger homes for families, and facilities for elderly care."
    },
    {
      "suggestion": "Focus efforts on building a variety of housing types to address the housing crisis."
    },
    {
      "suggestion": "Ensure a variety of housing types is available."
    }
  ],
  "43": [
    {
      "suggestion": "Connect neighborhoods with a restored streetcar system."
    },
    {
      "suggestion": "Implement rapid bus service with transit-only lanes."
    },
    {
      "suggestion": "Connect neighborhoods using a streetcar system or rapid bus with transit-only lanes."
    },
    {
      "suggestion": "Develop transit and bike-only lanes that can eventually be converted into streetcar lanes."
    }
  ],
  "44": [
    {
      "suggestion": "Create safe indoor community gathering places."
    },
    {
      "suggestion": "Create safe outdoor community gathering places."
    }
  ],
  "45": [
    {
      "suggestion": "Make community gathering places free to use."
    },
    {
      "suggestion": "Make community gathering places welcoming for all people."
    }
  ],
  "46": [
    {
      "suggestion": "Extend sidewalks in the Columbia neighborhood to prevent abrupt endings and improve pedestrian safety."
    },
    {
      "suggestion": "Ensure sidewalks are accessible to everyone in the Columbia neighborhood."
    }
  ],
  "47": [
    {
      "suggestion": "Prioritize increasing tree canopy coverage."
    },
    {
      "suggestion": "Include tree canopy preservation and expansion in city planning due to its health benefits."
    },
    {
      "suggestion": "Change the goal from 'promote urban tree canopy' to actively increasing urban tree canopy to offset climate impacts such as the heat island effect."
    },
    {
      "suggestion": "Promote urban tree canopy expansion."
    },
    {
      "suggestion": "Maintain the existing tree canopy for physical and psychological health benefits."
    }
  ],
  "48": [
    {
      "suggestion": "Create more community centers, hubs, or neighborhood gathering spaces in Bellingham."
    },
    {
      "suggestion": "Work to rebuild and strengthen the sense of community in Bellingham despite population growth."
    }
  ],
  "49": [
    {
      "suggestion": "Ensure access to nature and open spaces is incorporated into urban development plans."
    },
    {
      "suggestion": "Ensure accessible access to nature spaces."
    },
    {
      "suggestion": "Ensure accessible access to nature spaces."
    }
  ],
  "50": [
    {
      "suggestion": "City purchase the Boundary Bay brewing space."
    },
    {
      "suggestion": "Convert the Boundary Bay brewing space into a community brewery."
    }
  ],
  "51": [
    {
      "suggestion": "Change regulations and processes to give residents advance notice and input on planned developments in their neighborhoods."
    },
    {
      "suggestion": "Ensure neighborhood residents have a say in development decisions affecting their community."
    },
    {
      "suggestion": "Ensure neighborhood groups and residents have a real choice and voice in the decision-making process."
    },
    {
      "suggestion": "Allow existing residents to have influence over growth and neighborhood changes."
    },
    {
      "suggestion": "Empower neighborhood residents to have a voice in the future planning of their neighborhoods."
    }
  ],
  "52": [
    {
      "suggestion": "Implement measures to prevent developers from unilaterally imposing large-scale developments that disrupt established neighborhoods."
    },
    {
      "suggestion": "Preserve traditional single family neighborhoods."
    },
    {
      "suggestion": "Maintain pockets of quiet single-family homes for those who prefer them."
    },
    {
      "suggestion": "Preserve the distinctive character of each neighborhood and respect neighborhood pride."
    },
    {
      "suggestion": "Regulate development in established neighborhoods to preserve their character."
    },
    {
      "suggestion": "Allow modest but highly regulated development in grown neighborhoods of character."
    }
  ],
  "53": [
    {
      "suggestion": "Add decent bike shoulders on main thoroughfares in Bellingham to improve safety for cyclists."
    },
    {
      "suggestion": "Improve pedestrian connectivity between urban villages in Bellingham to prevent neglect of other areas."
    },
    {
      "suggestion": "Engineer safer road bike lanes in Bellingham."
    },
    {
      "suggestion": "Create safe biking access everywhere in Bellingham."
    },
    {
      "suggestion": "Make Bellingham safer for pedestrians and cyclists."
    },
    {
      "suggestion": "Continue improving biking infrastructure in Bellingham."
    }
  ],
  "54": [
    {
      "suggestion": "Implement a safety tax on owners of empty buildings to encourage them to sell or rent out the properties."
    },
    {
      "suggestion": "Increase the safety tax on empty buildings annually."
    }
  ],
  "55": [
    {
      "suggestion": "Increase police presence in the neighborhood to reduce crime."
    },
    {
      "suggestion": "Increase police patrols in the neighborhood to reduce crime."
    },
    {
      "suggestion": "Increase police patrols in the neighborhood to reduce crime."
    },
    {
      "suggestion": "Increase police presence in the neighborhood to reduce crime."
    }
  ],
  "56": [
    {
      "suggestion": "Implement community policing programs to build trust between police and residents."
    },
    {
      "suggestion": "Implement community policing programs to build trust between residents and law enforcement."
    }
  ],
  "57": [
    {
      "suggestion": "Install more street lighting to improve safety at night."
    },
    {
      "suggestion": "Install more street lighting to improve safety at night."
    },
    {
      "suggestion": "Improve lighting in the park for safety during evening hours."
    },
    {
      "suggestion": "Install more street lighting to improve safety at night."
    },
    {
      "suggestion": "Install better street lighting to improve safety at night."
    }
  ],
  "58": [
    {
      "suggestion": "Organize neighborhood watch groups to monitor and report suspicious activities."
    },
    {
      "suggestion": "Organize community watch programs to encourage residents to report suspicious activities."
    },
    {
      "suggestion": "Organize community watch programs to encourage residents to report suspicious activities."
    },
    {
      "suggestion": "Organize neighborhood watch groups to monitor and report suspicious activities."
    }
  ],
  "59": [
    {
      "suggestion": "Provide youth engagement programs to prevent involvement in criminal activities."
    },
    {
      "suggestion": "Provide youth engagement programs to prevent juvenile delinquency."
    },
    {
      "suggestion": "Provide youth engagement programs to prevent involvement in criminal activities."
    },
    {
      "suggestion": "Provide youth engagement programs to prevent involvement in criminal activities."
    }
  ],
  "60": [
    {
      "suggestion": "Maintain or reconsider parking requirements to ensure working-class residents have adequate parking access."
    },
    {
      "suggestion": "Avoid policies that eliminate parking requirements without considering the impact on working-class communities."
    },
    {
      "suggestion": "Ensure housing policies do not disproportionately burden working-class residents by limiting parking availability."
    }
  ],
  "61": [
    {
      "suggestion": "Address noise pollution in low income and rental neighborhoods."
    },
    {
      "suggestion": "Address light pollution in low income and rental neighborhoods."
    }
  ],
  "62": [
    {
      "suggestion": "Fix the survey so it proceeds beyond the first two questions."
    },
    {
      "suggestion": "Fix the survey navigation so that users can proceed beyond the second question."
    }
  ],
  "63": [
    {
      "suggestion": "Reduce parking minimums in new developments."
    },
    {
      "suggestion": "Remove parking minimums."
    },
    {
      "suggestion": "Eliminate parking minimum requirements."
    },
    {
      "suggestion": "Reduce parking minimums but do not eliminate them entirely to balance incentives for alternative transportation and avoid parking shortages."
    },
    {
      "suggestion": "Provide positive incentives for using alternatives to single-occupancy vehicles instead of penalizing drivers by reducing parking availability."
    }
  ],
  "64": [
    {
      "suggestion": "Reduce height restrictions in the downtown core and other designated urban villages to allow for more housing."
    },
    {
      "suggestion": "Raise height limits downtown and in Urban villages to allow for more housing density."
    }
  ],
  "65": [
    {
      "suggestion": "Avoid expanding Urban Growth Areas (UGAs) to prevent urban sprawl."
    },
    {
      "suggestion": "Expand the Urban Growth Areas (UGAs) to enable growth of all housing types."
    },
    {
      "suggestion": "Allow small commercial development in new residential areas within expanded UGAs."
    },
    {
      "suggestion": "Reconfigure the Urban Growth Area (UGA) by removing areas that cannot contribute needed housing and exchanging them for more efficiently buildable land."
    }
  ],
  "66": [
    {
      "suggestion": "Address increasing crime to improve safety downtown."
    },
    {
      "suggestion": "Address litter to improve safety downtown."
    }
  ],
  "67": [
    {
      "suggestion": "Improve parking availability and affordability downtown and in Urban Village areas."
    },
    {
      "suggestion": "Maintain or restore low-cost and free weekend parking options downtown to support residents and local businesses."
    },
    {
      "suggestion": "Increase the availability of parking close to downtown residences and businesses to reduce reliance on distant parking garages."
    },
    {
      "suggestion": "Consider alternatives to paid parking to attract customers to downtown businesses."
    },
    {
      "suggestion": "Reconsider or modify the progressive parking rates to encourage longer stays downtown."
    },
    {
      "suggestion": "Implement parking rates that support and promote shopping at downtown businesses."
    },
    {
      "suggestion": "Evaluate the impact of progressive parking rates on downtown retail and restaurants and adjust accordingly."
    }
  ],
  "68": [
    {
      "suggestion": "Build and maintain a vibrant, resilient downtown by achieving a critical mass of population with diverse people and businesses throughout the entire City."
    },
    {
      "suggestion": "Create a vibrant downtown area with mixed amenities including unique shops, restaurants, art galleries, and stores."
    }
  ],
  "69": [
    {
      "suggestion": "Support the integration of small-scale commercial uses in residential areas."
    },
    {
      "suggestion": "Combine large-scale residential developments with small-scale commercial areas to create mixed-use developments."
    },
    {
      "suggestion": "Consider middle-scale housing alongside commercial growth to strengthen small-scale commercial area plans."
    }
  ],
  "70": [
    {
      "suggestion": "Make reduction of plastic usage a priority in the coming years."
    },
    {
      "suggestion": "Develop a comprehensive waste management strategy focused on reducing plastic usage."
    },
    {
      "suggestion": "Implement stronger waste management regulations to limit plastic use."
    }
  ],
  "71": [
    {
      "suggestion": "Work with county, state, and non-governmental partners to accelerate reductions in plastic usage."
    },
    {
      "suggestion": "Collaborate with local businesses in the city and county to support alternatives to plastic."
    },
    {
      "suggestion": "Advocate for state-level policies that support reduction of plastic usage and promote alternatives."
    }
  ],
  "72": [
    {
      "suggestion": "Protect urban ecosystem functions by measuring and incorporating them throughout urban planning, not trading them off for density elsewhere."
    },
    {
      "suggestion": "Plan urban density in a way that also provides ecosystem services everywhere, not just in designated parks."
    }
  ],
  "73": [
    {
      "suggestion": "Connect with disability communities."
    },
    {
      "suggestion": "Connect with disability communities."
    }
  ],
  "74": [
    {
      "suggestion": "Promote transition toward responsible and sustainable commerce that supports healthy and ample jobs."
    },
    {
      "suggestion": "Incorporate job training programs as part of the transition to sustainable commerce and environmental goals."
    }
  ],
  "75": [
    {
      "suggestion": "Implement a debris and slash removal program in the Samish Crest open spaces to reduce wildfire risk."
    },
    {
      "suggestion": "Develop a wildfire prevention plan specifically for the Samish Crest area to protect nearby communities such as Samish Hill."
    },
    {
      "suggestion": "Increase monitoring and management of natural areas like Samish Crest to prevent accumulation of flammable materials."
    }
  ],
  "76": [
    {
      "suggestion": "Remove density restrictions on housing and enable mixed-use development in all neighborhoods to allow residents to walk or bike/roll safely to work, stores, and coffee shops."
    },
    {
      "suggestion": "Prioritize density and walkability in urban planning."
    }
  ],
  "77": [
    {
      "suggestion": "Increase the number of benches and shaded areas in the park."
    },
    {
      "suggestion": "Add more shaded areas in the park."
    },
    {
      "suggestion": "Increase the amount of shade in the park area."
    },
    {
      "suggestion": "Add more shade on the park paths."
    }
  ],
  "78": [
    {
      "suggestion": "Focus population growth in the City of Bellingham to reduce urban sprawl into rural areas."
    },
    {
      "suggestion": "Allocate the majority of population growth to the City of Bellingham to reduce carbon footprint from commuting."
    }
  ],
  "79": [
    {
      "suggestion": "Protect mobile home parks from unnecessary fees"
    },
    {
      "suggestion": "Prevent absurd annual space rental increases in mobile home parks"
    }
  ],
  "80": [
    {
      "suggestion": "Provide clear and detailed text changes to the BMC proposed rather than just broad strokes."
    },
    {
      "suggestion": "Make it easier to find the specific text changes in the BMC proposal."
    }
  ],
  "81": [
    {
      "suggestion": "Establish a cooperative relationship between the City, developers, builders, and community leaders to develop housing that meets community needs."
    },
    {
      "suggestion": "Organize meetings involving developers, builders, community leaders, and the City to discuss housing development plans."
    }
  ],
  "82": [
    {
      "suggestion": "Create friendlier code compliances for small individual property owners to build DADUs, ADUs, or other independent living spaces."
    },
    {
      "suggestion": "Make code compliances for creating rental or independent living spaces more affordable for small property owners."
    }
  ],
  "83": [
    {
      "suggestion": "Develop appealing group senior housing options for relatively affluent middle class seniors to provide alternatives to staying in single family homes or moving to expensive senior homes."
    },
    {
      "suggestion": "Create senior housing alternatives that attract seniors with disposable income to help free up single family homes in the housing market."
    },
    {
      "suggestion": "Plan for senior housing solutions that are more attractive than expensive geriatric service homes to encourage seniors to move and open up housing stock."
    },
    {
      "suggestion": "Consider offering appealing senior group housing options to reduce demand for in-home senior services and keep the housing market more fluid."
    }
  ],
  "84": [
    {
      "suggestion": "Maintain the local flavor of Bellingham as a green city."
    },
    {
      "suggestion": "Develop greenways that connect throughout Bellingham."
    }
  ],
  "85": [
    {
      "suggestion": "Focus on conversion of underutilized commercial and industrial structures to residential or mixed-use development."
    },
    {
      "suggestion": "Organize a city-wide effort to reuse existing unused or underused commercial and industrial structures for housing conversion."
    }
  ],
  "86": [
    {
      "suggestion": "Adopt bond financing and other financial incentives to support conversion projects."
    },
    {
      "suggestion": "Use bond financing to support the conversion of commercial and industrial structures into housing."
    }
  ],
  "87": [
    {
      "suggestion": "Reduce the speed limit in urban villages below 35 mph."
    },
    {
      "suggestion": "Reduce the speed limit in urban villages below 35 mph to enhance pedestrian safety."
    }
  ],
  "88": [
    {
      "suggestion": "Add curves (meanders) to the roads in urban villages."
    },
    {
      "suggestion": "Add curves (meanders) to the roads in urban villages to slow down traffic."
    }
  ],
  "89": [
    {
      "suggestion": "Plant trees in urban villages."
    },
    {
      "suggestion": "Add seating areas in urban villages."
    },
    {
      "suggestion": "Plant trees in urban villages to improve the environment and pedestrian experience."
    },
    {
      "suggestion": "Install seating areas in urban villages to make the area more pedestrian-friendly."
    }
  ],
  "90": [
    {
      "suggestion": "Implement denser mixed-use zoning."
    },
    {
      "suggestion": "Implement mixed-use zoning."
    }
  ],
  "91": [
    {
      "suggestion": "Monitor and evaluate the impact of the new Tree Ordinance on Middle Housing."
    },
    {
      "suggestion": "Address concerns related to the effects of the Tree Ordinance on Middle Housing."
    }
  ],
  "92": [
    {
      "suggestion": "Preserve and protect the waterfront."
    },
    {
      "suggestion": "Preserve as much waterfront property and other lands as possible for the future."
    }
  ],
  "93": [
    {
      "suggestion": "Convert vehicle parking areas into open spaces."
    },
    {
      "suggestion": "Convert vehicle parking areas into dense development."
    }
  ],
  "94": [
    {
      "suggestion": "Avoid blending city planning into one homogenous plan that ignores unique neighborhood needs and characteristics."
    },
    {
      "suggestion": "Recognize and incorporate the unique histories and characteristics of different neighborhoods in planning."
    },
    {
      "suggestion": "Avoid adopting a one-size-fits-all municipal plan that leads to homogenized urban sprawl."
    }
  ],
  "95": [
    {
      "suggestion": "Provide a direct link to the actual Draft Land Use Chapter on the website or in the communication materials."
    },
    {
      "suggestion": "Provide a direct link to the actual Draft Land Use Chapter on the website or in the communication materials."
    }
  ],
  "96": [
    {
      "suggestion": "Implement land preservation measures immediately to prevent overdevelopment."
    },
    {
      "suggestion": "Prioritize land preservation now rather than delaying for years."
    }
  ],
  "97": [
    {
      "suggestion": "Install more benches in parks and along trails to improve accessibility for people with limited mobility."
    },
    {
      "suggestion": "Incorporate benches into park and trail design to activate open spaces and promote health and wellness."
    },
    {
      "suggestion": "Consider benches as a safety enhancement to encourage use of outdoor spaces by all community members."
    }
  ],
  "98": [
    {
      "suggestion": "Increase the number of lap swim lanes in Bellingham aquatic facilities."
    },
    {
      "suggestion": "Build more aquatic facilities in Bellingham."
    },
    {
      "suggestion": "Prioritize aquatic spaces over additional trails in Bellingham."
    },
    {
      "suggestion": "Increase the number of lap lanes in Bellingham's aquatics facilities significantly."
    },
    {
      "suggestion": "Build a new, larger aquatics center in Bellingham."
    }
  ],
  "99": [
    {
      "suggestion": "Plan for at least 20 lap swim lanes to meet the current population demand."
    },
    {
      "suggestion": "Build a 24 lane (50 meter) pool to meet current and future demand."
    }
  ],
  "100": [
    {
      "suggestion": "Increase staffing for the volunteer program to better facilitate partnerships and community involvement."
    },
    {
      "suggestion": "Provide more volunteer event opportunities by addressing staffing limitations."
    }
  ],
  "101": [
    {
      "suggestion": "Incorporate more native habitat in green spaces to foster native species."
    },
    {
      "suggestion": "Plant more native plants in green spaces."
    }
  ],
  "102": [
    {
      "suggestion": "Eliminate the broken bridge in Cornwall Park and remove the pavement in that area."
    },
    {
      "suggestion": "Fix the bridge in Cornwall Park, potentially with volunteer help."
    }
  ],
  "103": [
    {
      "suggestion": "Develop an aquatics complex comparable to Grandview Heights in B.C."
    },
    {
      "suggestion": "Model the new aquatics center after BC's Grandview Heights Aquatic Center."
    }
  ],
  "104": [
    {
      "suggestion": "Extend Paratransit evening service hours by at least 15 minutes, from 8:30 PM to 8:45 PM, especially in the Cordata area."
    },
    {
      "suggestion": "Consider adjusting Paratransit pickup times to accommodate attendance at evening classes and appointments for mental health treatment."
    }
  ],
  "105": [
    {
      "suggestion": "Reimplement a trolley system or develop a light rail/intercity rail system in Bellingham to reduce congestion on high traffic routes."
    },
    {
      "suggestion": "Recreate the trolley (streetcar) system in the City of Bellingham to reduce traffic congestion."
    }
  ],
  "106": [
    {
      "suggestion": "Designate dedicated lanes for bike lanes separate from transit lanes."
    },
    {
      "suggestion": "Incorporate bike lanes into transit-only lanes to reduce conflicts."
    }
  ],
  "107": [
    {
      "suggestion": "Consider eliminating some on- and off-ramps to I-5 to reduce traffic congestion and accidents caused by frequent merging and exiting."
    },
    {
      "suggestion": "Encourage use of surface streets for short trips instead of I-5 to reduce congestion on the interstate."
    }
  ],
  "108": [
    {
      "suggestion": "Reduce the speed limit on main arterial roads near Cordata park from 35 mph to 25 mph to enhance pedestrian and bike safety."
    },
    {
      "suggestion": "Consider implementing traffic calming measures such as speed bumps on streets near Cordata park to slow down vehicle traffic."
    }
  ],
  "109": [
    {
      "suggestion": "Add more space for skateboarding."
    },
    {
      "suggestion": "Add more obstacles for skateboarding."
    }
  ],
  "110": [
    {
      "suggestion": "Create a basic disc golf course in the open space."
    },
    {
      "suggestion": "Design a 9-hole disc golf course."
    }
  ],
  "111": [
    {
      "suggestion": "Install more Pickleball courts in the community."
    },
    {
      "suggestion": "Build lighted covered Pickleball courts to allow play during long winters."
    },
    {
      "suggestion": "Expand the number of pickleball courts in Bellingham, particularly at Cordata Park."
    },
    {
      "suggestion": "Develop a world-class pickleball facility in Bellingham similar to the Spalding County Pickleball Complex in Griffin, GA, including both covered and uncovered courts."
    },
    {
      "suggestion": "Leverage pickleball to promote an active lifestyle, physical and mental health, and community well-being in Bellingham."
    },
    {
      "suggestion": "Use pickleball as a tool to boost sports tourism and generate economic impact in Bellingham."
    },
    {
      "suggestion": "Collaborate with local and national pickleball organizations to host regional, state, and national pickleball tournaments in Bellingham."
    },
    {
      "suggestion": "Increase community engagement and support for pickleball to enhance social connections and outdoor activity opportunities."
    },
    {
      "suggestion": "Increase the number of pickleball courts beyond four."
    },
    {
      "suggestion": "Prioritize adding pickleball courts in every new park development as initially promised."
    },
    {
      "suggestion": "Allow spray painting on courts to create more pickleball courts and increase capacity."
    },
    {
      "suggestion": "Build more pickleball courts to accommodate demand."
    },
    {
      "suggestion": "Consider constructing dedicated covered pickleball courts to provide shelter and improve playing conditions."
    },
    {
      "suggestion": "Build 8-10 Pickleball courts at Cordata Park."
    },
    {
      "suggestion": "Consider covering the Pickleball courts to allow for use in various weather conditions."
    },
    {
      "suggestion": "Install lights on the Pickleball courts to extend playable hours."
    },
    {
      "suggestion": "Convert some local tennis courts into Pickleball courts to meet growing demand."
    },
    {
      "suggestion": "Add more pickleball courts beyond the current plan if budget allows."
    },
    {
      "suggestion": "Include covers for the pickleball courts to enable year-round play in the Pacific Northwest."
    },
    {
      "suggestion": "Add 8 to 10 pickleball courts at Cordata to accommodate demand."
    },
    {
      "suggestion": "Include pickleball courts in the facilities."
    },
    {
      "suggestion": "Consider adding more pickleball courts in the future."
    },
    {
      "suggestion": "Add lights for night play on the pickleball courts."
    },
    {
      "suggestion": "Add covers for rain play on the pickleball courts."
    },
    {
      "suggestion": "Install lighting over the pickleball and basketball courts to allow for recreation until the park closes at 10 o'clock."
    },
    {
      "suggestion": "Provide information on the number of planned pickleball courts."
    },
    {
      "suggestion": "Line both tennis courts for pickleball."
    }
  ],
  "112": [
    {
      "suggestion": "Install Pickleball courts at the new Squalicum Creek Park where the baseball diamonds are now being completed."
    },
    {
      "suggestion": "Add covered Pickleball courts at Squalicum Creek Park."
    },
    {
      "suggestion": "Add beach volleyball courts at Squalicum Creek Park."
    }
  ],
  "113": [
    {
      "suggestion": "Encourage more use of parks to increase safety."
    },
    {
      "suggestion": "Enhance safety measures in Greenways parks and trails to make them more enjoyable."
    }
  ],
  "114": [
    {
      "suggestion": "Establish a community garden in the Cordata neighborhood."
    },
    {
      "suggestion": "Create space for community gardening in Cordata park"
    }
  ],
  "115": [
    {
      "suggestion": "Increase the availability of down-payment assistance programs for moderate-income residents."
    },
    {
      "suggestion": "Ensure down payment assistance programs are accessible and effective for eligible buyers in the local market."
    }
  ],
  "116": [
    {
      "suggestion": "Develop more affordable housing options specifically for lower-income, mortgage-qualified, disabled buyers."
    },
    {
      "suggestion": "Provide more single-level, affordable homes suitable for disabled buyers."
    }
  ],
  "117": [
    {
      "suggestion": "Law enforcement leaders should not use the department's social media to speak negatively of enacted policy changes."
    },
    {
      "suggestion": "Law enforcement leaders should not use the department's physical presence to speak negatively of enacted policy changes."
    },
    {
      "suggestion": "Law enforcement leaders should express their opinions on policy changes in a non-professional context."
    }
  ],
  "118": [
    {
      "suggestion": "Increase wages for councilor roles to be competitive with similar positions in the Seattle area."
    },
    {
      "suggestion": "Provide sufficient compensation so councilors can focus on their work without needing a second job."
    },
    {
      "suggestion": "Increase Council members' salaries to be half of the Mayor's salary to reflect their workload and provide a stronger check-and-balance."
    },
    {
      "suggestion": "Ensure Council members are paid to make the position accessible to all community members, not just those who can afford to work for free."
    },
    {
      "suggestion": "Increase city council salaries to reflect full-time work and responsibilities, including attendance at additional meetings and community events."
    },
    {
      "suggestion": "Set a threshold for when council compensation should reflect a living wage based on demonstrated workload and community needs."
    },
    {
      "suggestion": "Address the disparity between mayor and council salaries to maintain appropriate pay scales."
    },
    {
      "suggestion": "Increase city councilors' salaries to be at least equivalent to the state minimum wage or higher."
    },
    {
      "suggestion": "Adjust city councilors' compensation to reflect the full-time nature and workload of their responsibilities."
    },
    {
      "suggestion": "Implement a cost of living adjustment (COLA) for city councilors' salaries."
    },
    {
      "suggestion": "Ensure city councilors receive equitable pay comparable to county councilors."
    },
    {
      "suggestion": "Recognize and address the equity issue caused by low city councilor wages leading to loss of diverse representation."
    },
    {
      "suggestion": "Provide city councilors with salaries that allow them to maintain a reasonable work-life balance without needing additional jobs."
    },
    {
      "suggestion": "Reevaluate city councilors' benefits to align with their workload and responsibilities."
    },
    {
      "suggestion": "Set the minimum compensation for councilmembers at least at the determined living wage."
    },
    {
      "suggestion": "Increase compensation for elected officials to match their increased workload."
    }
  ],
  "119": [
    {
      "suggestion": "Use the Washington Citizens' Commission on Salaries for Elected Officials as a benchmark to set salaries for elected positions."
    },
    {
      "suggestion": "Set salaries for elected positions as a certain percentage of the salaries recommended by the Washington Citizens' Commission on Salaries for Elected Officials."
    }
  ],
  "120": [
    {
      "suggestion": "Research the salaries of city council members in comparable cities."
    },
    {
      "suggestion": "Determine the percentage of the city budget allocated to council member salaries in comparable cities."
    }
  ],
  "121": [
    {
      "suggestion": "Ensure the compensation makes the position feasible for poor and working class people to participate."
    },
    {
      "suggestion": "Recognize that adequate compensation is necessary to enable people from diverse economic backgrounds to serve, not just those with middle to upper class incomes."
    }
  ],
  "122": [
    {
      "suggestion": "Create more streateries with aesthetic, permanent structures instead of temporary, flimsy ones."
    },
    {
      "suggestion": "Evaluate the impact of existing requirements for permanent streateries."
    },
    {
      "suggestion": "Clarify the purpose and intent of the permanent streateries requirements."
    },
    {
      "suggestion": "Consider making the permanent structures requirements less onerous to encourage more permanent streateries."
    },
    {
      "suggestion": "Provide information on the requirements to make the 'streateries' a permanent feature."
    }
  ],
  "123": [
    {
      "suggestion": "Designate parking spaces in areas like Railroad and Holly only for people with disabilities and those who cannot walk long distances."
    },
    {
      "suggestion": "Restrict or regulate parking usage to ensure spaces are available for people with disabilities."
    },
    {
      "suggestion": "Ensure continued access to parking close to destinations for people with accessibility needs."
    }
  ],
  "124": [
    {
      "suggestion": "Reduce annual fees associated with streateries to encourage thriving local businesses and outdoor community spaces."
    },
    {
      "suggestion": "Maintain or consider increasing fees for streateries to encourage responsible business practices."
    },
    {
      "suggestion": "Reconsider the plan to increase fees and permits for streateries."
    },
    {
      "suggestion": "Maintain reasonable fees for streateries to ensure affordability for all owners."
    }
  ],
  "125": [
    {
      "suggestion": "Enforce standards for accessibility, safety, and spacing for streateries to address community concerns."
    },
    {
      "suggestion": "Design standards for streateries should be established and enforced to improve their appearance."
    },
    {
      "suggestion": "Require streateries to fulfill architectural guidelines similar to those for permanent structures."
    },
    {
      "suggestion": "Establish a standard of construction for streateries to ensure quality and safety."
    }
  ],
  "126": [
    {
      "suggestion": "Subsidize businesses to take over parking."
    },
    {
      "suggestion": "Businesses should pay market rate to take over parking spaces for streateries, rather than a subsidized rate."
    }
  ],
  "127": [
    {
      "suggestion": "Limit the number of parking spaces that streateries can occupy."
    },
    {
      "suggestion": "Determine and set a city-wide acceptable limit on parking spaces that can be converted to streateries."
    }
  ],
  "128": [
    {
      "suggestion": "Limit the amount of parking a business can use relative to the total available spaces in front of the building."
    },
    {
      "suggestion": "Prevent businesses from using parking spaces that reduce availability for neighboring businesses."
    }
  ],
  "129": [
    {
      "suggestion": "Provide clear signage indicating the locations of public restrooms."
    },
    {
      "suggestion": "Provide clear signage indicating the location of restrooms."
    },
    {
      "suggestion": "Ensure restrooms are easily accessible and well-marked."
    }
  ],
  "130": [
    {
      "suggestion": "Increase the number of public restrooms available in the area."
    },
    {
      "suggestion": "Increase the number of women's restrooms to reduce wait times."
    }
  ],
  "131": [
    {
      "suggestion": "Make the pump track a permanent feature in the park plans."
    },
    {
      "suggestion": "Preserve the pump track as a cultural and recreational space for families and the community."
    },
    {
      "suggestion": "Make the pump track a permanent part of the park in the Lettered Streets neighborhood."
    },
    {
      "suggestion": "Promote the pump track from an interim use to a permanent design element."
    },
    {
      "suggestion": "Prevent the removal of the pump track to make way for privately held buildings to preserve public benefit."
    }
  ],
  "132": [
    {
      "suggestion": "Install vertical posts for the bike lanes on Meridian."
    },
    {
      "suggestion": "Install vertical posts for the bike lanes on Illinois."
    }
  ],
  "133": [
    {
      "suggestion": "Ensure that Option 2 of the Master Plan fully protects Landmark Trees located directly north of the Sportsplex from development impacts."
    },
    {
      "suggestion": "Commit to protecting all Landmark Trees at the Civic Athletic Complex in line with protections required of residents and private developers in public development projects."
    }
  ],
  "134": [
    {
      "suggestion": "Develop a plan to preserve mature trees during development or construction."
    },
    {
      "suggestion": "Ensure the plan includes measures to protect mature trees from being lost to developments like the Meridian development."
    }
  ],
  "135": [
    {
      "suggestion": "Define the term 'equitable housing'."
    },
    {
      "suggestion": "Explain what 'equitable housing' means."
    }
  ],
  "136": [
    {
      "suggestion": "Implement a tax on landlords"
    },
    {
      "suggestion": "Implement a tax on landlords who own more than a certain number of dwelling units."
    }
  ],
  "137": [
    {
      "suggestion": "Review the necessity of '15 Ton Limit' signs on every bridge."
    },
    {
      "suggestion": "Assess whether the number of '15 Ton Limit' signs can be reduced."
    }
  ],
  "138": [
    {
      "suggestion": "Keep the current temporary entrance sign as it is, since it is visible and stylish."
    },
    {
      "suggestion": "Keep the existing sign as it is because it is readable to motorists."
    }
  ],
  "139": [
    {
      "suggestion": "Use the money for renovations and maintenance instead of a new sign."
    },
    {
      "suggestion": "Use the $75k budget for park repairs instead of a new sign."
    }
  ],
  "140": [
    {
      "suggestion": "Assess and consider the actual usage of the new bike lane."
    },
    {
      "suggestion": "Evaluate if the bike lane is justified based on bike usage data."
    }
  ],
  "141": [
    {
      "suggestion": "Avoid narrowing or reducing car lanes on Lakeway to prevent increased speeding and dangerous lane changes."
    },
    {
      "suggestion": "Do not reduce traffic lanes on Lincoln or Lakeway."
    },
    {
      "suggestion": "Do not reduce the number of vehicle traffic lanes in the Lakeway freeway underpass project."
    },
    {
      "suggestion": "Consider widening the Lakeway underpass as part of the project."
    },
    {
      "suggestion": "Consider constructing a new freeway underpass or tunnel specifically for bikes and pedestrians to avoid further restricting the existing Lakeway underpass."
    }
  ],
  "142": [
    {
      "suggestion": "Explore alternative solutions to improve bike safety on Lakeway without reducing car lanes."
    },
    {
      "suggestion": "Improve safety measures at the Lakeway and Electric intersection to better protect cyclists from turning motorists."
    },
    {
      "suggestion": "Implement traffic controls or redesign the intersection to reduce dangerous uncontrolled left turns from Lakeway to Electric."
    }
  ],
  "143": [
    {
      "suggestion": "Add bike lanes without reducing existing traffic lanes."
    },
    {
      "suggestion": "Allow adding bike lanes without sacrificing existing vehicle lanes."
    }
  ],
  "144": [
    {
      "suggestion": "Eliminate the free right turn on red from BM Parkway heading east onto Samish Way to reduce lane blockage and traffic congestion on Samish Way southbound."
    },
    {
      "suggestion": "Eliminate the free right turn from I5 south exit onto Samish Way to reduce traffic issues."
    }
  ],
  "145": [
    {
      "suggestion": "Develop future plans for Fouts Park."
    },
    {
      "suggestion": "Improve the playground at Fouts Park."
    },
    {
      "suggestion": "Enhance the landscaping at Fouts Park."
    }
  ],
  "146": [
    {
      "suggestion": "Implement paid parking on South Cornwall."
    },
    {
      "suggestion": "Install parking meters on South Cornwall."
    }
  ],
  "147": [
    {
      "suggestion": "Analyze data on parking volume during December when parking was free."
    },
    {
      "suggestion": "Analyze data on length of parking during December when parking was free."
    },
    {
      "suggestion": "Analyze data on merchants' satisfaction during December when parking was free."
    },
    {
      "suggestion": "Analyze data on residents' satisfaction during December when parking was free."
    }
  ],
  "148": [
    {
      "suggestion": "The City should provide accommodations for residents of low-income housing impacted by newly mandated paid parking."
    },
    {
      "suggestion": "The City should implement measures to mitigate the cost burden of paid parking on low-income households."
    }
  ],
  "149": [
    {
      "suggestion": "Implement enforcement measures to ensure compliance with the three-foot passing law."
    },
    {
      "suggestion": "Increase public awareness about the three-foot passing law through education and outreach programs."
    }
  ],
  "150": [
    {
      "suggestion": "Add a walking path on James Street to improve pedestrian safety."
    },
    {
      "suggestion": "Add a walking path on Hannegan to improve pedestrian safety."
    },
    {
      "suggestion": "Widen or improve the existing narrow path on Hannegan to make it safer for pedestrians."
    }
  ],
  "151": [
    {
      "suggestion": "Make Bellingham's regulations for creating ADUs less restrictive, similar to Seattle and Tacoma."
    },
    {
      "suggestion": "Increase transparency by publishing Bellingham's ADU regulations for the general public."
    }
  ],
  "152": [
    {
      "suggestion": "Provide a map showing areas proposed as high density designation."
    },
    {
      "suggestion": "If a map is not available, provide information on areas expected to be designated as high density."
    }
  ],
  "153": [
    {
      "suggestion": "Clarify whether a high density designation allows developers to build higher than existing height restrictions."
    },
    {
      "suggestion": "Clarify whether higher density means only smaller unit sizes without increasing building height."
    }
  ],
  "154": [
    {
      "suggestion": "Do not implement the Urban Forest Plan."
    },
    {
      "suggestion": "Ensure that the Urban Forest Plan does not make development and building housing more difficult or unaffordable."
    }
  ],
  "155": [
    {
      "suggestion": "The city should improve protection for mature trees."
    },
    {
      "suggestion": "The city should establish clear, enforceable laws to protect mature trees."
    }
  ]
}