{
  "0": [
    {
      "id": "comment-a7acb1dc",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "PKSchissler",
        "timestamp": "5 months ago",
        "project_title": "Bellingham Plan Chapters",
        "source_url": "https://engagebellingham.org/bellingham-plan-chapters-list?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-08bfb210",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "jp",
        "timestamp": "8 months ago",
        "project_title": "Contact the Bellingham Plan Team",
        "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-e7ea56af",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "jega",
        "timestamp": "10 months ago",
        "project_title": "Contact the Bellingham Plan Team",
        "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-068eaecb",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "John Seagull",
        "timestamp": "5 months ago",
        "project_title": "Environment Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-environment-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-e879fd05",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "angelic_aura",
        "timestamp": "13 days ago",
        "project_title": "Transportation Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-transportation-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-8e28a31b",
      "text": "Removed by moderator.",
      "meta": {
        "type": "comment",
        "author": "Phaedra",
        "timestamp": "about 3 years ago",
        "project_title": "Fairhaven Park Entrance Sign",
        "source_url": "https://engagebellingham.org/fairhaven-park-sign?tool=guest_book#tool_tab"
      }
    }
  ],
  "1": [
    {
      "id": "comment-c57889f1",
      "text": "I support infill within the City, capital improvement investments for infrastructure, and opening up Urban Growth Area Reserves for new communities.",
      "meta": {
        "type": "comment",
        "author": "Saar Swan",
        "timestamp": "5 months ago",
        "project_title": "Bellingham Plan Chapters",
        "source_url": "https://engagebellingham.org/bellingham-plan-chapters-list?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-02b860a2",
      "text": "I support infill within the City, capital improvement investments for infrastructure, and opening up Urban Growth Area Reserves for new communities.",
      "meta": {
        "type": "comment",
        "author": "Brad Swanson",
        "timestamp": "5 months ago",
        "project_title": "Bellingham Plan Chapters",
        "source_url": "https://engagebellingham.org/bellingham-plan-chapters-list?tool=guest_book#tool_tab"
      }
    }
  ],
  "2": [
    {
      "id": "comment-a4e2d7b2",
      "text": "Staff Note: Comments made early than this one were based on an older version of the chapter material released in November 2024.",
      "meta": {
        "type": "comment",
        "author": "thebellinghamplan",
        "timestamp": "14 days ago",
        "project_title": "Capital Facilities and Urban Services Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-capital-facilities-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-06ab40d7",
      "text": "Staff Note: Comments made early than this one were based on an older version of the chapter material released in November 2024.",
      "meta": {
        "type": "comment",
        "author": "Kate Newell",
        "timestamp": "3 months ago",
        "project_title": "Community Design Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-community-design-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-6dc7ed01",
      "text": "Staff Note: Comments made early than this one were based on an older version of the chapter material released in November 2024.",
      "meta": {
        "type": "comment",
        "author": "thebellinghamplan",
        "timestamp": "about 1 month ago",
        "project_title": "Economic Development Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-economic-development-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-45a5786f",
      "text": "Staff Note: Comments made early than this one were based on an older version of the chapter material released in November 2024.",
      "meta": {
        "type": "comment",
        "author": "thebellinghamplan",
        "timestamp": "about 2 months ago",
        "project_title": "Environment Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-environment-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-840ca33e",
      "text": "Staff Note: Comments made early than this one were based on an older version of the chapter material released in November 2024.",
      "meta": {
        "type": "comment",
        "author": "thebellinghamplan",
        "timestamp": "14 days ago",
        "project_title": "Transportation Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-transportation-chapter?tool=guest_book#tool_tab"
      }
    }
  ],
  "3": [
    {
      "id": "comment-1be55b38",
      "text": "Please continue to invest in infrastructure so we can add land to the city SO that more single family homes can be built! My friends and family do not want to live in apartment buildings. They want to buy a modest home on a little lot and pay their taxes and live and help create a beautiful vibrant city.If we do not build more SFHs they will just buy land in the county which has a larger negative environmental impact AND means the city doesnt get their tax dollars.",
      "meta": {
        "type": "comment",
        "author": "bradwidman",
        "timestamp": "6 months ago",
        "project_title": "Capital Facilities and Urban Services Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-capital-facilities-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-43815d3e",
      "text": "Please continue to invest in infrastructure so we can add land to the city SO that more single family homes can be built! My friends and family do not want to live in apartment buildings. They want to buy a modest home on a little lot and pay their taxes and live and help create a beautiful vibrant city.If we do not build more SFHs they will just buy land in the county which has a larger negative environmental impact AND means the city doesnt get their tax dollars.",
      "meta": {
        "type": "comment",
        "author": "bradwidman",
        "timestamp": "6 months ago",
        "project_title": "Capital Facilities and Urban Services Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-capital-facilities-chapter?tool=guest_book#tool_tab"
      }
    }
  ],
  "4": [
    {
      "id": "comment-39a0c00b",
      "text": "City of Bellingham Comp Plan Update ReviewThank you for your work on this important Comp Plan update. The materials offered as review of Comp Plan chapter updates via PowerPoint are ineffective as the content is strictly a conceptual outline. There is no detail to review. These chapters are more closely scoping documents submitted for comment before the actual work is conducted. Although providing the public with opportunity to comment is always welcomed, we question the effectiveness of issuing PowerPoint presentations that only provide a very rough conceptual-level of detail that sumarrizes what the City plans to do. Given that fact, we offer the following comments on both the Climate and Environment chapters.Climate Chapter:Slide 1:The “Climate Chapter” is only a PowerPoint presentation with broad concepts presented but no detailed text. This is not a plan because it is an outline of topics to be fleshed out. A person may agree with the concepts in the PowerPoint presentation, but disagree on how the actual plan text, which has not been developed, is developed. This is a disservice to the public that the City serves. The Comp Plan update and review process should be paused to allow time for the actual chapters to be written so as the public can actually review a plan, not just an rough outline of concepts.Slide 2:It is unlikely that the legislature intended that an outline of topics would comprise a Comp Plan.In order for the Bellingham community to understand the concepts in this chapter and be able to provide effective informed comment, COB needs to provide actual detailed text, not just a power point presentation.We agree that the topic “Climate” is important to the health, safety, and well-being of the community. However, providing a PowerPoint outline as a surrogate for the detail that should be in this chapter is ineffective.Slide 3:If this chapter was fully scoped, it is likely that many additional common opinions would also be listed. “Common opinions” is a very subjective term. This is an example on why a PowerPoint outline will not replace the need for an actual text chapter.Slide 4:It is difficult to comment on a topic or process that is only outlined at the highest level of generality. The referenced “Summary of Proposed Updates” has even less detail in it than the powerpoint presentation.Slide 5: Planning for climate impacts on water supply will be a part of this chapter, but no detail is provided. There are several landmark research projects and reports that evaluate the impacts of climate change on water supply and should be utilized in addressing this topic. One of the most significant impacts of climate change will be water availability and water supply. Climate change will significntly decrease streamflow in the rivers and streams of the county, which impacts COB water availability and should be taken into consideration in growth-related planning processes.It is good to see the new chapter content will utilize an existing program and source of relevant information on low-impact development. Measures identified as low-impact development will assist in climate change mitigation and adaptation/resilience planning.Slide 7:Slide 7 is missing.Slide 8:Although climate impact mitigation is an important approach to addressing climate change impacts overall, this chapter should also address climate change adaptation and resilience planning as mitigation alone will not be enough to offset such impacts.Another topic area should include heat island effects and heat loading caused by development and the loss of forest cover/native vegetation cover and increased atmospheric temperatures that may not be “extreme weather”, but the new normal.Slide 9:It is surprising to notice that water supply is not mentioned as a specific topic area as such will likely be one of the most significant climate change impacts affecting our community.“Extreme weather” is only part of the issue over weather—the issue is the new normal with continued climate change that should be directly considered. Again, given the gravity of reduced water availability and supply with continued climate  change, these should be a specifically identified topic area to be addressed in the updated Comp Plan. The list of topics seems unrealistically limited given the importance of water supply and other natural resource elements in the context of climate change impacts, mitigation, and adaptation/resilience planning.Slide 10:No comment.Slide 11:No comment.Slide 12:No comment.Slide 13:The impacts of continued climate change and extreme weather on water availability and supply should be listed as a topic.Slide 14:The issue with wildfires isn’t just smoke and resiliency, but should explicitly include the change in wildfire frequency, intensity, duration, and areal coverage with continued climate change.Slide 15:Given the gravity of the impact of sea level rise due to climate change on all existing shoreline buildings and infrastructure, mitigation needs to be comprehensively spelled out.Slide 16:Congratulations, finally water supply is explicitly listed in this new chapter per this slide. The impacts of cliamte change on water supply may be one of the most significant topics that this chapter should address.Slide 17:“Ecosystem resiliency” must involve evaluating existing regulations for effectiveness in promoting resiliency. There is a concern that development regulations, legacy tree ordinance, and the urban forest plan may be at odds. For instance, the City has goals to increase forest cover, yet develoment involving the removal of forest cover may  atoccur at a faster rate than increased forest cover or effective ecosystem recovery. This inconsistency should be addressed in this chapter.Slide 18:“Mitigate building emissions” should also address the use of concrete and the high rates of greenhouse gas emissions in the process of producing raw cement and concrete materials.Slide 19:“Mitigate transportation emissions” should also include traffic signal sequencing to conserve momentum energies by providing more continuance of travel through intersections as opposed to traffic backups waiting for green lights with engines running. The City does this with Holly Street signal sequencing. Also, hybrid vehicles should be expliicitly itemized in addition to EVs as hybrid vehicles use less fossil fuels and turn off while at a standstill at a stop sign or red traffic signal.Slide 20:No comment.Slide 21:This slide show is a rough and generalized outline and is not a substitute for a comprehensive text chapter. There is simply not enough detail presented to comment on.",
      "meta": {
        "type": "comment",
        "author": "OJG",
        "timestamp": "about 1 month ago",
        "project_title": "Climate Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-climate-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-082ea44b",
      "text": "City of Bellingham Comp Plan Update ReviewThank you for your work on this important Comp Plan update. The materials offered as review of Comp Plan chapter updates via PowerPoint are ineffective as the content is strictly a conceptual outline. There is no detail to review. These chapters are more closely scoping documents submitted for comment before the actual work is conducted. Although providing the public with opportunity to comment is always welcomed, we question the effectiveness of issuing PowerPoint presentations that only provide a very rough conceptual-level of detail that summarizes what the City plans to do. Given that fact, we offer the following comments on both the Climate and Environment chapters.Environment Chapter:Slide 1:There is very little content to review and comment on in this brief PowerPoint presentation.Slide 2:There must have been many more “most common” opinions presented during the scoping phase. How did the City objectively determine the most common opinions?Slide 3:“Streamlining the chapter” may be a goal of Comp Plan update, but if streamlining is used to update the Comp Plan, then aggressive incorporation by reference and citations must be used so it is clear that best available science was used to update the Comp Plan. Will there be a Best Available Science technical report companion to the Comp Plan?The referenced “Summary of Proposed Updates” provides even less information than this PowerPoint presentation.Slide 4: An explicit topic area should include streamflow and water supply, which are major determinants of growth allocation and planning. This topic area also supports the other already mentioned topic areas.Slide 5:No comment.Slide 6:There really isn’t any concepts presented in this PowerPoint presentation.Slide 7:“Aquatic ecosystems” should include the water availability and supply to sustain these ecosystems and tier to the Climate chapter.“Water quality and quantity” should include the impact of land use on water availability and supply as well as water quality.“Coastal resiliency” should include mitigation of sea level rise impacts.“Urban forest benefits to water”, excellent to include this topic. It seems that the rate of forest cover removal in the City due to development exceeds the rate of forest cover protection and increase, a goal of the urban forest plan.Slide 8:“Terrestrial Ecosystems”. This topic area should include urban wildlife corridors.Slide 9:“Natural Resource Management.” The body of best available science needs to be updated from the current Comp Plan (2016). Lots of relevant science has been accomplished since 2016.“Control invasives” should include requiring job site power equipment to be power washed between job sites to reduce the translocation of invasives.“WRIA 1 coordination” should explicitly include water supply, water availability, and water rights, not just “water.”Slide 10:“Human Health and Environment.” “Promote urban tree canopy”, this goal needs to include not just “promote”, but increase urban tree canopy to offset climate impacts, including the heat island effect.Slides 11-14:No comment.",
      "meta": {
        "type": "comment",
        "author": "OJG",
        "timestamp": "about 1 month ago",
        "project_title": "Environment Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-environment-chapter?tool=guest_book#tool_tab"
      }
    }
  ],
  "5": [
    {
      "id": "comment-9a7c4b24",
      "text": "Please consider connecting our neighborhoods with recalled street car system or rapid bus with transit only lanes. Also longer running routes. We need them for quicker public transit.",
      "meta": {
        "type": "comment",
        "author": "Matthew Colston",
        "timestamp": "2 months ago",
        "project_title": "Community Design Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-community-design-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-ad420e9e",
      "text": "Please consider connecting our neighborhoods with recalled street car system or rapid bus with transit only lanes. Also longer running routes. We need them for quicker public transit.",
      "meta": {
        "type": "comment",
        "author": "Matthew Colston",
        "timestamp": "2 months ago",
        "project_title": "Community Design Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-community-design-chapter?tool=guest_book#tool_tab"
      }
    }
  ],
  "6": [
    {
      "id": "comment-7df779fe",
      "text": "I love the addition of human health and welfare. Please consider connecting with disability communities and ensure accessible access to nature spaces.",
      "meta": {
        "type": "comment",
        "author": "jonesa37",
        "timestamp": "about 1 month ago",
        "project_title": "Environment Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-environment-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-287d83fc",
      "text": "I love the addition of human health and welfare. Please consider connecting with disability communities and ensure accessible access to nature spaces.",
      "meta": {
        "type": "comment",
        "author": "jonesa37",
        "timestamp": "about 1 month ago",
        "project_title": "Environment Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-environment-chapter?tool=guest_book#tool_tab"
      }
    }
  ],
  "7": [
    {
      "id": "comment-353103a5",
      "text": "I do not believe that a 35-mph speed limit is appropriate in urban villages. If you want urban village pedestrians to feel safe and included, then drop the speed. Add some curves (meanders), trees, and seating. (I am talking to you, Samish Way Urban Village).",
      "meta": {
        "type": "comment",
        "author": "cbmac",
        "timestamp": "8 months ago",
        "project_title": "Land Use",
        "source_url": "https://engagebellingham.org/bellinghamplan-land-use-and-community-design?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-e92bc216",
      "text": "I do not believe that a 35 mph speed limit is appropriate in urban villages.  If you want urban village pedestrians to feel safe and included then drop the speed.  Add some curves (meanders), trees, and seating. (I am talking to you, Samish Way Urban Village).",
      "meta": {
        "type": "comment",
        "author": "cbmac",
        "timestamp": "8 months ago",
        "project_title": "Land Use",
        "source_url": "https://engagebellingham.org/bellinghamplan-land-use-and-community-design?tool=guest_book#tool_tab"
      }
    }
  ],
  "8": [
    {
      "id": "comment-2668c374",
      "text": "Could you provide a link to the actual Draft Land Use Chapter? I see links to a power point, to a one-page summary, and to a list of goals, but cannot find the actual chapter. Thank you.",
      "meta": {
        "type": "comment",
        "author": "Jean Melious",
        "timestamp": "3 months ago",
        "project_title": "Land Use Chapter",
        "source_url": "https://engagebellingham.org/bellinghamplan-land-use-chapter?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "question-a9c0e144",
      "text": "Could you provide a link to the actual Draft Land Use Chapter? I see links to a power point, to a one-page summary, and to a list of goals, but cannot find the actual chapter. Thank you.",
      "meta": {
        "type": "question",
        "author": "",
        "timestamp": "3 months ago",
        "project_title": "Contact the Bellingham Plan Team",
        "source_url": "https://engagebellingham.org/bellinghamplan-contact-us?tool=qanda#tool_tab"
      }
    }
  ],
  "9": [
    {
      "id": "comment-774e9e56",
      "text": "My wife and I discovered Pickleball this summer and it's been a real game changer for us; we are back to being active, meeting active fun new people, and we simply love this game.  We play at least 3 times a week through the Bellingham Pickleball Club.  The game is off the charts in popularity for good reason, it's fun, challenging, accessible, and enjoyed by every age group.  The need for more courts, and more importantly lighted covered courts, so play may continue through our long Winters is imperative.  Cordata Park courts are timely and welcome, thank you so much for these!  Other than encouragement for more Pickleball facilities in general my wife and I ask specifically that Pickleball courts be installed at the new Squalicum Creek Park where the baseball diamonds are now being completed.  As this particular park has been developed with a third baseball diamond, further closing it off from general use so that it is less usable as a neighborhood park and now another fenced off baseball field, we feel that it is time to balance out the park with the addition of uses more people in the community want.  In addition to covered Pickleball courts, beach volleyball courts are sorely needed and would get a lot of use.  I'd like to add that it is our opinion that the more a park is used the safer it will be (much as what's happened in Cornwall Park with Frisbee Golfers and Pickleball players being there).  And, last but not least, the Cordata park is beautiful, thank you all for your good work there!",
      "meta": {
        "type": "comment",
        "author": "Wolf and Sheep",
        "timestamp": "over 3 years ago",
        "project_title": "Cordata Community Park Phase 2",
        "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=guest_book#tool_tab"
      }
    },
    {
      "id": "comment-b011a970",
      "text": "I'm delighted to hear there will be Pickleball Courts at Cordata Park. You did a beautiful job creating the courts at Cornwall Park and my group played there all through the winter last year and will do so again this year. We need more Pickleball courts in Bellingham though! 8-10 courts at Cordata would be awesome. If it's possible to cover them and have lights that would certainly add to the hours they could be used. I think it's time to turn some of our local tennis courts into Pickleball courts too. People of all ages and abilities are coming to this game and Bellingham could be a real leader if we had more courts to meet the ever growing need for places to play. Many thanks for reaching out to the community and for building more Pickleball courts!",
      "meta": {
        "type": "comment",
        "author": "KaseyP",
        "timestamp": "over 3 years ago",
        "project_title": "Cordata Community Park Phase 2",
        "source_url": "https://engagebellingham.org/cordata-community-park-phase-2?tool=guest_book#tool_tab"
      }
    }
  ]
}