{
  "suggestions": [
    "Maintain strong zoning laws to protect homeowners' quality of life and investments.",
    "Reject proposed 'open zoning' policies in Bellingham to prevent negative lifestyle changes.",
    "Avoid implementing climate mitigation measures such as carbon fuel bans or limits on personal automobiles due to their economic impact and questionable effectiveness.",
    "Provide more information about the proposed changes to the bus routes.",
    "Ensure that the new bus routes maintain or improve current service levels.",
    "Consider the impact of route changes on elderly and disabled passengers.",
    "Hold a public meeting to discuss the proposed bus route changes and gather feedback.",
    "Publish a clear map and schedule of the new bus routes for public review.",
    "Include questions about homelessness and city response in future surveys.",
    "Develop and communicate a clear plan to address the homeless crisis in Bellingham.",
    "Address the issue of homeless camps and plans for relocating those individuals.",
    "Ensure urban planning considers the safety of citizens, store workers, and shoppers in relation to homelessness.",
    "Be transparent with the public about plans concerning homelessness and related urban planning.",
    "Study the area identified for removal from the UGA and consider designating it as an open space corridor to protect wildlife habitat and critical area connections.",
    "Include a vision in the Bellingham Plan for growth beyond the current planning period, similar to Boulder's 'Blue Line' and 'Green Line' strategies.",
    "Establish a 'Green Line' in Bellingham to permanently protect open space and resource lands around the Urban Growth Area.",
    "Avoid expanding urban growth areas into designated open space corridors, agricultural lands, rural study areas, and Limited Areas of More Intense Rural Development (LAMIRDs).",
    "If expanding UGAs, include specific language in the Plan to designate and protect a 'Green Line' of open space or resource lands.",
    "Consider the impacts of proposed developments, such as Caitac's proposal, on designated open space corridors and adjacent land uses before approval.",
    "Implement more measures to preserve greenery.",
    "Protect trees from being cut down for new buildings.",
    "Support infill development within the City",
    "Invest in capital improvements for infrastructure",
    "Open up Urban Growth Area Reserves for new communities",
    "Support infill development within the City",
    "Invest in capital improvements for infrastructure",
    "Open up Urban Growth Area Reserves for new communities",
    "Maintain housing regulations to ensure safety for people and the environment.",
    "Increase availability of low barrier and no barrier housing and shelters.",
    "Implement rent control to keep housing affordable.",
    "Provide more low/no-barrier shelters and daytime shelters for unhoused people.",
    "Install lockers for unhoused people to store belongings safely.",
    "Create more free community and recreation centers for all age groups.",
    "Provide detailed accessibility information about city parks on the website.",
    "Increase frequency of public transit, especially in areas with infrequent service.",
    "Ensure bike lanes are continuous and do not disappear mid-street.",
    "Enshrine and protect values of diversity, equity, inclusion, and accessibility in city policies.",
    "Protect rights of queer, trans, BIPOC, and migrant community members, including bodily autonomy.",
    "Do not reduce environmental and essential regulations when developing housing.",
    "Implement rent control to address rising rental rates.",
    "Regulate or limit excessive administrative and application fees charged by landlords.",
    "Provide accessible housing for all, prioritizing a Housing First approach.",
    "Increase the number of free public spaces such as libraries, parks, and community centers.",
    "Encourage or require grocery chains to open stores in neighborhoods lacking fresh food options.",
    "Work towards becoming a true sanctuary city that is safe and welcoming for all residents.",
    "Enhance collaboration between the city and the Port to prevent environmentally and community harmful decisions.",
    "Incorporate the North Bellingham UGA Reserve Area into the city UGA.",
    "Develop affordable housing including rentals and homeownership for various income levels.",
    "Create green, efficient, and affordable housing developments similar to Larrabee Springs.",
    "Develop urban villages in the North Bellingham UGA Reserve Area to foster healthy neighborhood communities.",
    "Expand and improve public transportation to accommodate increased housing and reduce congestion.",
    "Increase transportation services between Lynden and Ferndale via the North Bellingham UGA Reserve Area.",
    "Address noise pollution explicitly in the Bellingham Plan.",
    "Provide formal training to the police department on noise code enforcement.",
    "Implement objective measurement tools for noise control enforcement.",
    "Revise the noise control system to prevent inadequate enforcement and post-construction issues.",
    "Consider expert input when updating noise protection measures in the Bellingham Plan.",
    "Expand the growth boundaries in Whatcom County.",
    "Ensure timely supply of city services to the expanded areas.",
    "Provide adequate housing supply for current and future generations in Whatcom County.",
    "Include support for the work of artists in the City of Bellingham's plan.",
    "Address the lack of support for local and visiting artists by Bellingham city and county leaders.",
    "Recognize and promote the economic and cultural benefits that arts bring to the community.",
    "Correct the omission of arts support in the current Bellingham Plan.",
    "Include specific strategies in The Bellingham Plan to help homeless individuals find housing and support services.",
    "Study and consider adopting elements from San Francisco's Homelessness and Supportive Housing program.",
    "Develop and build small apartments in high-rise buildings with elevators as affordable transitional housing for the homeless.",
    "Allow for smaller, higher-rise housing units that can serve as starter homes and later be upgraded, similar to housing in larger cities.",
    "Locate new housing developments near transportation and community activities to enhance accessibility and appeal.",
    "Ensure that plans and budgets explicitly address the needs of homeless individuals, including housing and supportive services, rather than just clearing encampments.",
    "Reduce barriers to building housing to meet demand and ensure affordability in Bellingham.",
    "Invest in common recreational amenities such as swimming pools, turf fields, basketball courts, and tennis courts to complement existing greenspace.",
    "Improve safety on I-5 through Bellingham, especially between Sunset and Samish, by implementing measures to slow down drivers during heavy traffic and reduce traffic accidents.",
    "Allow urban growth areas to be zoned for more indoor athletic facilities.",
    "Remove the requirement that indoor athletic facilities be tied to a government entity.",
    "Include mention of Bellingham's vibrant theater, music, and fine arts programs and institutions in relevant materials or discussions.",
    "Add more specific details to the chapters to provide a stronger roadmap.",
    "Increase the priority of economic development in the plan.",
    "Include specific areas of economic growth such as service, industrial/manufacturing, and professional services.",
    "Focus more on housing options for families that can be purchased rather than rental units or apartments for students.",
    "Create incentives for homebuyers and new businesses if they are co-located, such as small business loans at reduced rates.",
    "Address the job market challenges in Bellingham that affect housing affordability and economic development.",
    "Include elevators or lifts in multiple level housing to accommodate people with disabilities and seniors.",
    "Increase housing density infill in Bellingham.",
    "Build infrastructure to support increased housing density.",
    "Focus on utilizing UGA reserves for housing development.",
    "Increase the number of apartments in downtown Bellingham.",
    "Prioritize keeping rural county areas rural.",
    "Increase housing availability to decrease homelessness and improve affordability for working families.",
    "Increase home ownership opportunities in Happy Valley to foster resident engagement in long-term planning.",
    "Improve the level of service for public parks in Happy Valley.",
    "Develop and implement multi-modal infrastructure in Happy Valley to reduce automobile dependency.",
    "Stop selling or vacating unimproved Right-of-Ways that serve as public transportation corridors.",
    "Engage with the community and Parks Department to address trail upgrades and connectivity issues.",
    "Ensure new developments, such as the 2706 Mill Avenue project, consider multi-modal impacts and maintain trail connections.",
    "Install sidewalks on Mill Avenue and Douglas Avenue to improve pedestrian safety and access to schools.",
    "Reinstate and respect Neighborhood Plans to guide development and infrastructure improvements.",
    "Allocate funding (e.g., one million dollars) to build trail connections as outlined in the Happy Valley Neighborhood Plan's Green Infrastructure chapter.",
    "Address economic and social equity factors in urban planning decisions for Happy Valley.",
    "Avoid gutting zoning, parking, and density regulations without considering community impact.",
    "Learn from other cities like Bend, Oregon, and Boulder, Colorado, by developing and sticking to a clear urban vision.",
    "Consider the affordability of water, sewer, and utility rate increases for local residents, especially those on fixed incomes.",
    "Explore ways to more equitably distribute the costs of COB's water and sewer upgrades and the water treatment plant.",
    "Evaluate the potential impact of utility cost increases on homelessness and household economics.",
    "Take into account the cumulative financial burden on residents from rent increases and utility rate hikes.",
    "Build more sidewalks in the Alabama Hill neighborhood near St Clair Park.",
    "Improve pedestrian and bicycle safety near the playground in Alabama Hill.",
    "Address blind corners and areas with zero shoulder to enhance safety.",
    "Implement measures to reduce vehicle speeds to below 40 mph in the neighborhood.",
    "Change Holly Street back to its original configuration.",
    "Prioritize pedestrian safety, especially for seniors and families.",
    "Restore curbside parking to improve safety when exiting cars.",
    "Rearrange parked cars to improve line of sight for pedestrians crossing Holly Street.",
    "Make Downtown more welcoming and friendly for seniors and families.",
    "Continue focusing on maintenance of facilities throughout infrastructure planning.",
    "Develop more gathering places to accommodate growth.",
    "Build neighborhood centers similar to those in larger cities.",
    "Create 'third places' for community gathering as private spaces become more expensive.",
    "Include more tactical details in the plan to assess feasibility.",
    "Incorporate diversity considerations into city development.",
    "Incorporate inclusion considerations into city development.",
    "Incorporate environmental considerations into city development.",
    "Coordinate with Bellingham's senior center and related services regarding growth and service needs.",
    "Coordinate with schools regarding growth and service needs.",
    "Consider how the City can support non-city owned and operated facilities that benefit Bellingham residents.",
    "Explore ways to enhance facilities and resources without the City of Bellingham owning and operating them.",
    "Consider providing funding support to the senior center.",
    "Eliminate all initiatives related to inclusivity and equity to reduce wasted money and unequal treatment.",
    "Avoid limiting the utilities provided to citizens while aiming to provide reliable utilities.",
    "Consider the opinions of long-term Bellingham residents in decision-making processes.",
    "Allow builders to build more freely to increase housing affordability.",
    "Reduce excessive fees charged before building to make homes more affordable.",
    "Prevent staff from solely determining community needs to avoid wasted tax dollars and impractical projects.",
    "Prioritize the needs of the majority of citizens while minimizing spending.",
    "Prioritize citizens' needs over environmental concerns.",
    "Avoid spending excessively on fancy building designs; focus on functionality and durability.",
    "Be realistic about recycling and conservation efforts, focusing only on what is effective.",
    "Only approve additional school facilities if student performance exceeds state-required testing levels.",
    "Avoid setting equity and other unrealistic goals that may hinder the success of the CAP FAC plan.",
    "Reduce government spending to lower property taxes.",
    "Control or decrease property tax rates in the city.",
    "Work hard to avoid raising taxes to keep the city affordable.",
    "Avoid spending all increased revenue on new projects and instead grow the city's rainy day fund.",
    "Control city costs to reduce the financial burden on residents, especially those on fixed incomes.",
    "Public facilities should emphasize resource and energy efficiency.",
    "Future urban growth and annexation plans should consider fiscal sustainability.",
    "Design public buildings as gathering and emergency response centers that reflect community values.",
    "Maximize native tree canopy in all parks, public spaces, right of ways, and open spaces.",
    "Fully integrate green infrastructure into public spaces and city planning.",
    "Stop building grey infrastructure that pipes runoff directly into waterbodies to prevent pollution.",
    "Prioritize replacement of aging underground utilities such as sewers.",
    "Use infrastructure replacement projects as opportunities to bury utility lines and expand green infrastructure.",
    "Install underground electrical lines for new buildings.",
    "Install underground communication lines for new buildings.",
    "Install underground electrical and communication lines whenever roads are rebuilt.",
    "Add a sewer treatment plant to the north for Cordata and other expansion.",
    "Create shorter underground sewer runs by adding the northern treatment plant.",
    "Add redundancy to the sewer system by building the northern treatment plant.",
    "City should coordinate construction and financing of water reservoir projects to support both new and existing homes.",
    "City should plan for extension of sewer transmission lines in the south of Bellingham to eliminate septic systems.",
    "City should not rely solely on developer funding for regional scale water facilities, as no single developer can fund such projects for medium developments.",
    "City should include water reservoir projects in comprehensive plans to enable residential development in Samish and Cordata neighborhoods.",
    "Build the planned water tanks at King Mountain and Samish Hill as soon as possible.",
    "Prioritize construction of water facilities to support housing development within city limits and UGA Reserve areas.",
    "Continue to invest in infrastructure to support city expansion.",
    "Add land to the city to allow for more single family homes to be built.",
    "Focus on building modest single family homes on small lots to meet demand.",
    "Prioritize single family home development to retain residents and their tax contributions within the city.",
    "Avoid limiting housing options to apartment buildings to prevent residents from moving to the county.",
    "Continue to invest in infrastructure to support city expansion.",
    "Add land to the city to allow for more single family homes to be built.",
    "Prioritize building modest single family homes on small lots to meet residents' preferences.",
    "Focus on retaining residents by providing housing options within the city to prevent them from moving to the county.",
    "Encourage development that helps create a beautiful and vibrant city while increasing tax revenue.",
    "Address aging sewer infrastructure proactively.",
    "Do not wait for sewer infrastructure failure before taking action.",
    "Reassess and move forward with a sewer infrastructure upgrade plan despite previous plan falling through.",
    "Evaluate the strengths and weaknesses of the three applicants for the upgrade plan to make an informed decision.",
    "Increase notifications of new development proposals to reach a wider audience.",
    "Extend timelines for public input to allow more thorough citizen engagement.",
    "Offer alternative meeting formats beyond Zoom to accommodate different preferences.",
    "Ensure that local knowledge is valued and incorporated into development decisions.",
    "Implement strategies to encourage equitable participation from all community members, including those who are busy or stressed.",
    "Promote transparency and genuine engagement rather than discouraging citizen input.",
    "Ensure everyone has access to information and ways to communicate.",
    "Use social media as a platform for people to access and contribute feedback.",
    "Present the Comprehensive Plan Update thoroughly and invite public feedback.",
    "Provide assistance through library staff to help those with limited computer skills or access.",
    "Provide clear and specific information about what is needed, wanted, or desired in Equitable and Inclusive Civic Practices.",
    "Avoid vague statements and include concrete examples or actions to clarify goals.",
    "Replace the term 'equitable' in city documents with a more specific phrase.",
    "Use criteria or characteristics that can be measured instead of the term 'equitable' in city documents.",
    "Ensure the city maintains an open and transparent process for public participation.",
    "Recognize that while everyone has the opportunity to voice opinions, some may be hesitant to speak up.",
    "Balance the needs of the many with the needs of the few in city planning and policy decisions.",
    "Continue to provide and maintain public housing and shelters with appropriate accommodations.",
    "Evaluate the outcomes of policies related to low barrier shelters and drug use accommodations to inform future decisions.",
    "Pause the Comp Plan update and review process to allow time for actual chapters to be written for public review.",
    "Provide detailed text chapters instead of only PowerPoint presentations for public review and comment.",
    "Include detailed planning for climate impacts on water supply using landmark research and reports.",
    "Address climate change adaptation and resilience planning in addition to mitigation in the Climate Chapter.",
    "Include topics on heat island effects and heat loading caused by development and loss of vegetation.",
    "Explicitly address water supply as a significant topic in the Climate Chapter due to its importance.",
    "Include the impacts of continued climate change and extreme weather on water availability and supply as a topic.",
    "Address changes in wildfire frequency, intensity, duration, and areal coverage due to climate change.",
    "Comprehensively spell out mitigation strategies for sea level rise impacts on shoreline buildings and infrastructure.",
    "Evaluate existing regulations for effectiveness in promoting ecosystem resiliency and address inconsistencies among development regulations, legacy tree ordinance, and urban forest plan.",
    "Address greenhouse gas emissions from concrete and cement production in building emissions mitigation.",
    "Include traffic signal sequencing to conserve momentum and reduce emissions in transportation emissions mitigation.",
    "Explicitly include hybrid vehicles in transportation emissions mitigation strategies along with electric vehicles.",
    "Integrate transportation, housing, and land use planning comprehensively rather than in isolation.",
    "Advance and finalize the Urban Forestry Management Plan to inform housing and climate strategies effectively.",
    "Avoid imposing additional housing construction restrictions that increase housing costs and commuting emissions.",
    "Incorporate the WRIA 1 (Nooksack) water adjudication into the city's 20-year water plan.",
    "Plan for potential increased water service demands from surrounding jurisdictions due to water rights limitations.",
    "Assess and address conflicts between new park acquisitions and water infrastructure projects for water resiliency.",
    "Coordinate the city's tree and carbon sequestration plans with county wildfire resiliency strategies.",
    "Develop resiliency plans for the Post Point Water Treatment facility considering sea level rise.",
    "Prioritize construction of affordable, energy-efficient housing near services to reduce housing insecurity and climate vulnerability.",
    "Balance wildfire resiliency policies with urban forestry goals, especially regarding aging landmark trees and increased canopy cover.",
    "Consider the impact of water rights adjudication on population growth and infrastructure planning.",
    "Ensure building preservation efforts include provisions for affordable housing and the costs of retrofitting for new heating and cooling technologies.",
    "Pursue electrification opportunities in municipally-owned buildings.",
    "Pursue energy efficiency opportunities in municipally-owned buildings.",
    "Electrify municipal fleet vehicles.",
    "Include these initiatives as a policy in the comprehensive plan.",
    "Revise Policy C-31 to better balance historic preservation with climate action goals.",
    "Allow energy-efficiency upgrades such as double-paned windows and solar PV installations in historic buildings when they do not significantly compromise historic character.",
    "Facilitate retrofitting of older buildings for energy efficiency, floodproofing, and seismic safety even if it alters some historic features.",
    "Review and modify historic preservation ordinances that unnecessarily block new development or urban densification.",
    "Promote urban densification to reduce car dependency, expand public transit, preserve green space, and prevent sprawl.",
    "Consider the trade-offs between embodied carbon benefits of preservation and the long-term energy inefficiency of older buildings in policy decisions.",
    "Ensure that preservation policies do not hinder housing production and affordability by locking in existing land uses.",
    "Stop providing support for migrants.",
    "Stop encouraging population growth in Bellingham.",
    "Update infrastructure, such as transportation engineering, before promoting further growth.",
    "Prevent further mass-residency development to maintain sustainability and climate resiliency.",
    "Develop a plan to reduce the need for cars to get around town.",
    "Make the city more friendly to people without access to cars or who want to leave their cars at home.",
    "Get ahead of global and national climate changes by implementing local policies now.",
    "Invest in electrification as a key part of future development.",
    "Develop more efficient ways to build communities to preserve green spaces.",
    "Protect yourself and your family members from inappropriate touching in public transport.",
    "Consider using cars for transportation to ensure privacy and safety.",
    "Raise awareness about the issue of harassment in public transport.",
    "Consider the diverse needs of all city residents, including disabled individuals, the elderly, and pet owners, when planning transportation options.",
    "Increase and improve public transportation options to accommodate people traveling to mountains, parks, and other areas beyond the city.",
    "Provide affordable alternatives to car ownership for occasional trips, considering the high costs of insurance and maintenance.",
    "Delay the wholesale introduction of electric cars until safety and durability standards improve.",
    "Install sufficient electric charging stations across the state before promoting mass adoption of electric vehicles.",
    "Preserve and protect green areas in the city to help absorb carbon emissions and improve environmental quality.",
    "Require developers to properly green their territories to maintain and increase urban green spaces.",
    "Prevent suburban sprawl.",
    "Increase access to public transportation and make it more convenient and affordable than driving.",
    "Build fully divided bike lanes across the city.",
    "Build safe covered bike parking locations at public transport hubs.",
    "Develop urban village concepts in each area of town to reduce the need for daily commutes and errands across the city.",
    "Protect and plant trees to increase biodiversity and preserve natural areas.",
    "Implement a 'mansion tax' on real estate transactions above a certain threshold to fund affordable housing and homelessness prevention programs.",
    "Consider setting the mansion tax threshold lower than $5 million to reflect local housing market conditions.",
    "Use funds from the mansion tax to support affordable housing initiatives and programs that prevent homelessness.",
    "Consider imposing a tax on new residents purchasing homes to offset their impact on housing prices.",
    "Increase emphasis on sustainable landscape practices to reduce energy use.",
    "Design buildings to be taller rather than bulkier to preserve open space.",
    "Incorporate open space, infiltration areas, trees, and habitat on every parcel.",
    "Address heat island effect by prioritizing shade and limiting open pavement expanses.",
    "Convert parking lots to housing where possible, and use remaining parking lots to reduce heat.",
    "Revise current street and parking standards to prevent increases in heat and pollution.",
    "Make urban forests and green infrastructure fundamental requirements for buildings, not optional add-ons.",
    "Enforce planning and regulations to ensure open space and canopy, especially in low income areas.",
    "Increase access to nature and canopy in low income areas to address inequities.",
    "Reach out to the disability community to incorporate their lived experiences in climate equity conversations.",
    "Support greenhouse gas emissions reduction work and climate resilience measures.",
    "City should gather resources and help residents access them for climate-related initiatives.",
    "Consider housing affordability and job availability when planning climate actions.",
    "Ensure tenants are not disproportionately burdened by building or energy measures.",
    "Develop safe bicycle infrastructure including separated bike lanes or paths.",
    "Provide covered bike parking.",
    "Increase support for Whatcom Transportation Authority (WTA).",
    "Invest more in accessible sidewalks.",
    "Implement zoning changes to reduce heating and cooling emissions per capita.",
    "Create pre-approved sustainable building designs using local materials to reduce permitting costs.",
    "Up-zone single-family housing areas to allow duplexes or more units.",
    "Consider using eminent domain for abandoned or neglected properties to renovate and sell at cost.",
    "Explore and develop local wind power projects.",
    "Invest in local long-term energy storage solutions to increase grid independence and self-sufficiency.",
    "Include clear and direct language in the plan regarding the city's accountability to uphold commitments to CO2 sequestering, low impact development techniques, and transportation-related emissions reductions.",
    "Specify the techniques and methods that will be employed to meet environmental standards in the development plan.",
    "Incorporate accountability measures and consequences in the plan to prevent loopholes and ensure responsible development.",
    "Stop spending money, time, and effort on climate-related issues.",
    "Focus on improving the quality of life for the people living in the community.",
    "Stop virtue signaling and take concrete actions to help the local residents.",
    "Encourage structures and lifestyles that improve quality-of-life while reducing climate and environmental impacts.",
    "Support alternatives to driving in the roads and buildings we build.",
    "Support local regenerative agriculture and rewilding efforts within and outside the annexation lines.",
    "Incentivize the construction of highly sustainable and ideally regenerative building designs.",
    "Encourage the construction of naturally more efficient building types such as apartment buildings and townhomes.",
    "Design transportation infrastructure to reduce vehicle miles traveled (VMT).",
    "Promote the use of electric bikes as a tool to replace car trips and reduce emissions.",
    "Design bike infrastructure that is safe and accessible for all users, including children.",
    "Remove limits on density such as minimum lot sizes, maximum floor-area ratios, and minimum setbacks.",
    "Promote higher density development to reduce sprawl and auto-dependence.",
    "Encourage dense city planning to lower housing costs and rents.",
    "Reduce reliance on automobiles by discouraging sprawl.",
    "Support sustainable city finances by reducing the costs of providing public services through denser development.",
    "Move the portable micropark to a low impact location.",
    "Change loading zones that are not needed at times (e.g., on weekends) to allow parking during those times, while keeping them as loading zones on weekdays.",
    "Diversify housing types to include middle housing and Single Room Occupancies (SROs) to increase affordable housing.",
    "Implement a citywide plan and simplify design review to only objective standards for clarity to home builders.",
    "Encourage more businesses in neighborhoods to improve local access.",
    "Limit restrictions on new housing and businesses to promote growth.",
    "Diversify housing types and designs in the community.",
    "Include and maintain natural spaces and well-nurtured trees in neighborhoods.",
    "Ensure housing designs include considerable eaves to protect against cold, rain, and heat.",
    "Design housing to be energy efficient to reduce costs for residents and owners.",
    "Connect neighborhoods with a restored streetcar system.",
    "Implement rapid bus service with transit-only lanes.",
    "Extend the length of public transit routes for quicker service.",
    "Connect neighborhoods using a streetcar system or rapid bus with transit-only lanes.",
    "Implement longer running public transit routes for quicker service.",
    "Create safe indoor community gathering places.",
    "Create safe outdoor community gathering places.",
    "Ensure community gathering places are beautiful with lots of natural landscaping.",
    "Make community gathering places free to use.",
    "Make community gathering places welcoming for all people.",
    "Provide some community gathering places large enough for big groups to congregate.",
    "Design community gathering places primarily for gathering, not for buying and selling merchandise.",
    "Extend sidewalks in the Columbia neighborhood to prevent abrupt endings and improve pedestrian safety.",
    "Ensure sidewalks are accessible to everyone in the Columbia neighborhood.",
    "Construct a pedestrian/bike friendly bridge or walkway over the tracks from the Columbia neighborhood to the waterfront to improve access.",
    "Maintain separate neighborhood plans instead of adopting a single holistic Bellingham Plan.",
    "Consider the unique characteristics and reasons people choose different neighborhoods when planning zoning and development.",
    "Avoid simplifying zoning categories to just R1-R4 without considering neighborhood differences.",
    "Ensure that planning decisions prioritize making Bellingham a better place to live, not just making the planning department's job easier.",
    "Avoid making Bellingham resemble other cities like Lynnwood in terms of population density and urban planning.",
    "Require ground floor retail or public spaces in all large multifamily developments to encourage local shopping and socializing.",
    "Promote the inclusion of 'third places' and small businesses in new developments to build community and a sense of place.",
    "Prioritize ground floor activation in urban villages, downtown core, and other areas when permitting new developments.",
    "Design sidewalks and pedestrian corridors to be dignifying and inviting for pedestrians.",
    "Create streetscapes that make walking feel pleasant and safe, encouraging people to choose walking over driving.",
    "Increase mixed-use development in Cordata to include retail options such as grocery stores and bakeries.",
    "Enhance the variety of amenities along Cordata Parkway to encourage walking.",
    "Leverage existing walking and cycling infrastructure and transit access to support more diverse neighborhood uses.",
    "Prioritize increasing tree canopy coverage.",
    "Reduce the number of strip malls with large car parks.",
    "Implement light pollution control measures by aiming and shading lighting to limit it to individual properties and prevent flooding nearby areas.",
    "Reconsider CPTED standards that increase light pollution to limit petty crimes.",
    "Develop and apply an aggressive tree planting program for aesthetics, carbon sequestration, recreation, shade, oxygen production, and habitat to all construction review and development proposals in the City.",
    "Integrate natural features and open spaces into new housing developments.",
    "Design developments to link natural features and accommodate site-specific issues with flexible rules.",
    "In dense areas, move utilities to alleys to allow planting of large native trees along street frontages.",
    "Design new developments with grid street patterns adapted to the landscape.",
    "Recognize trees as culturally significant and protect them as important resources.",
    "Enhance walkability in community design.",
    "Focus on preservation of existing structures and natural areas.",
    "Incorporate sustainability principles in community planning.",
    "Promote diversity in community development.",
    "Encourage renovation of existing buildings.",
    "Include a mix of various concepts in community design.",
    "Allow flexibility in street standards, particularly for private street access.",
    "Utilize alleys for site access when constrained by topography.",
    "Use alleys where full street standards are excessive for access to a few units.",
    "Consider environmental constraints when using alleys.",
    "Account for the cost of providing access to both sides of a parcel when planning alleys.",
    "Engage more mindfully with existing stakeholders and active neighborhood associations to address concerns about infill.",
    "Explore and implement solutions and strategies for neighborhood preservation on a case-by-case basis.",
    "Consider ideas such as co-housing, form-based zoning, re-use of existing buildings, and townhomes to maintain neighborhood character.",
    "Design neighborhood streetscapes to accommodate increased car parking needs as densities increase.",
    "Reduce permit review time to less than the current 8-12 weeks for the first review.",
    "Make design requirements standardized and remove subjective opinions from non-licensed city reviewers.",
    "Require staff to clearly communicate to applicants why their proposal does not meet a standard or what changes will meet the standard.",
    "Consider proposals as meeting requirements if staff cannot specify why they do not meet standards or how to meet them.",
    "Integrate the design review process into the building permit review process to reduce permitting backlog.",
    "Increase sidewalk cohesion across neighborhoods to create continuous pedestrian pathways.",
    "Improve pedestrian infrastructure to provide better connections to the waterfront.",
    "Develop new pedestrian access routes over the bluff and railroad tracks between neighborhoods and the waterfront.",
    "Provide ample, well-advertised opportunities for the public to comment on the design criteria.",
    "Encourage more visually appealing designs for new apartment buildings instead of plain, boxy structures.",
    "Consider using more varied and vibrant colors in building designs to improve aesthetics.",
    "Design future residential alleyways with more open space.",
    "Dedicate a lot or two in alleyways for a mini community garden.",
    "Create a basketball court in alleyways.",
    "Establish a fenced-in dog run in alleyways.",
    "Provide food truck parking in alleyways.",
    "Install secure bike parking in alleyways.",
    "Build an outdoor kitchen space in alleyways.",
    "Design well-lit community gathering open spaces in alleyways.",
    "Require new property owners or developers to obtain approval from neighbors before making changes that substantially affect the neighborhood's quality of life.",
    "The City of Boulder (COB) should prioritize protecting the rights of existing residents over the rights of developers or newcomers.",
    "Focus development on vacant land and derelict properties rather than established neighborhoods to preserve neighborhood quality and property values.",
    "Create more community centers, hubs, or neighborhood gathering spaces in Bellingham.",
    "Establish places similar to libraries that are open every day to everyone.",
    "Offer free programming and activities at these community spaces.",
    "Provide spaces within these centers for community members to use for their own events.",
    "Include tree canopy preservation and expansion in city planning due to its health benefits.",
    "Ensure access to nature and open spaces is incorporated into urban development plans.",
    "Increase open space and availability of play areas in response to anticipated population and density growth.",
    "Place Arts and Culture more prominently in the Bellingham Comprehensive Plan, consistent with its vital importance.",
    "Create a separate chapter for Arts and Culture in the Plan, similar to Parks, Recreation, and Open Space, rather than including it under Community Wellbeing.",
    "Include the category 'Arts and Culture' in key places on the Engagement Hub, especially on the landing page graphic and in the Scope of Work section.",
    "Recognize and support the diverse and thriving arts community in Bellingham, including live music, theatre, film arts, visual arts, literature, and major arts institutions.",
    "Promote the arts as a means to enhance community wellbeing, tourism, economic benefits, downtown vitality, and community pride.",
    "Consider making Arts and Culture an all-encompassing mission and vision within the Plan to reflect the collective efforts of the arts community.",
    "Preserve and enhance open spaces and parks, especially in areas with boxy apartment buildings.",
    "Address income disparity within the community.",
    "Promote inclusivity in local politics to ensure independent views are accepted and represented.",
    "Work to rebuild and strengthen the sense of community in Bellingham despite population growth.",
    "Remove this chapter as its content is covered elsewhere and not the business of government.",
    "If the chapter remains, include content on Community Wellbeing that addresses the negative impact of taxes on low income citizens.",
    "Prioritize budget spending by deleting low priority items and spending money more economically.",
    "Include considerations of regulations, especially new or burdensome ones, that increase stress by onerously controlling citizens' lives.",
    "City purchase the Boundary Bay brewing space.",
    "Convert the Boundary Bay brewing space into a community brewery.",
    "Use the space as a public venue for music, art, and community gatherings.",
    "Maintain the space as a community hub near the farmer's market.",
    "Name the community center 'Bellingham Subrewed Excitement Community Center'.",
    "Add more housing overall.",
    "Ensure that the housing added is affordable to local residents.",
    "Change regulations and processes to give residents advance notice and input on planned developments in their neighborhoods.",
    "Implement measures to prevent developers from unilaterally imposing large-scale developments that disrupt established neighborhoods.",
    "Establish protections for existing homeowners to safeguard their investments and quality of life against sudden development plans.",
    "Ensure neighborhood residents have a say in development decisions affecting their community.",
    "Stop being soft on open drug use in the City Center.",
    "Provide services to help individuals get off addiction.",
    "Provide services to address the mental health crisis.",
    "Avoid referring to homelessness as a 'houseless' issue and address it appropriately.",
    "Add decent bike shoulders on main thoroughfares in Bellingham to improve safety for cyclists.",
    "Ensure future road designs include dedicated space for biking and pedestrians.",
    "Avoid simply painting bike logos in the middle of vehicle lanes where bike shoulders disappear.",
    "Promote biking as a way to reduce air pollution and foster friendlier community spaces.",
    "Consider the needs of elderly residents who rely on cars and require close parking and services when planning city developments.",
    "Ensure that city planning does not encourage seniors to downsize into cramped, noisy, and unattractive housing.",
    "Provide clear legal requirements or enforcement mechanisms to hold developers accountable beyond just guidelines in the Bellingham Plan.",
    "Adopt an ordinance setting up form-based housing similar to the practice in Maryland.",
    "Simplify the permitting process for housing developments.",
    "Ensure key design elements for developments to assure residents.",
    "Facilitate investments by companies and nonprofit organizations in housing.",
    "Use form-based housing to support the city's commitment to environmental protection and preservation.",
    "Implement a safety tax on owners of empty buildings to encourage them to sell or rent out the properties.",
    "Increase the safety tax on empty buildings annually.",
    "Apply similar taxes on unrented apartments to discourage outside investors from leaving properties vacant.",
    "Enhance the aesthetic appeal of the Fountain District by preventing construction of cheap, uniform buildings.",
    "Pass an ordinance requiring ground floors of buildings to be open and welcoming, not rented to tenants who obscure windows with curtains.",
    "Establish noise ordinances to regulate noise from air conditioners and rooftop machines in buildings near neighborhoods.",
    "Preserve the green space at the end of Salmonberry Lane as a wildlife corridor between the open space near Lakeway and Lake Padden.",
    "Do not develop multiple family housing on the green space due to steep terrain and high traffic concerns.",
    "Develop the green space into a recreational area for hiking and biking instead of housing.",
    "Consider the impact of development on local wildlife, such as deer, and prioritize conservation.",
    "Build a walking bridge over the train tracks from the end of Broadway by Eldgridge to Roeder Ave.",
    "Design the bridge to accommodate both walkers and bicyclists.",
    "Improve pedestrian safety by providing an alternative to the railroad crossing at F St.",
    "Enhance access to the Zuanich waterfront area through the new bridge.",
    "Consider implementing a Community Workforce Agreement (CWA) for new projects that includes priority hire and diversity, equity, and inclusion language.",
    "Require contractors on new projects to pay a standard living wage.",
    "Develop a community wealth plan to ensure tax dollars invested in new projects benefit local residents and create community wealth.",
    "Engage with local residents and experts, such as Lisa Marx, to learn more about successful CWAs in other cities.",
    "Increase police presence in the neighborhood to reduce crime.",
    "Implement community policing programs to build trust between police and residents.",
    "Install more street lighting to improve safety at night.",
    "Organize neighborhood watch groups to monitor and report suspicious activities.",
    "Provide youth engagement programs to prevent involvement in criminal activities.",
    "Maintain or reconsider parking requirements to ensure working-class residents have adequate parking access.",
    "Recognize the importance of parking for low-income individuals who rely on cars for work and childcare.",
    "Avoid policies that eliminate parking requirements without considering the impact on working-class communities.",
    "Ensure housing policies do not disproportionately burden working-class residents by limiting parking availability.",
    "Increase law enforcement personnel proportionally with any population growth.",
    "Address noise pollution in low income and rental neighborhoods.",
    "Address light pollution in low income and rental neighborhoods.",
    "Increase road work and maintenance in low income and rental neighborhoods.",
    "Implement traffic calming measures to reduce speeding cars in neighborhoods to improve pedestrian safety.",
    "Enhance safety measures to allow residents, including those with disabilities, to safely enjoy the neighborhood.",
    "Prioritize public transportation in Bellingham to improve accessibility.",
    "Hold public meetings at locations accessible by public transportation or provide alternative transportation options to ensure inclusivity.",
    "Fix the survey so it proceeds beyond the first two questions.",
    "Provide technical support for users having trouble with the survey.",
    "Ensure the survey is compatible with all browsers and devices.",
    "Increase police patrols in the neighborhood to reduce crime.",
    "Install more street lighting to improve safety at night.",
    "Organize community watch programs to encourage residents to report suspicious activities.",
    "Provide youth engagement programs to prevent juvenile delinquency.",
    "Implement regulations to constrain the removal of trees and large parcels of land in the county to prevent unchecked development.",
    "Create differentiated zoning or housing rules for neighborhoods based on their characteristics to avoid perpetuating socioeconomic disparities.",
    "Develop diverse housing options to accommodate different needs, including rentals, communal housing, small homes, larger homes for families, and facilities for elderly care.",
    "Plan city infrastructure to address parking needs, including garages equipped with Level 2 EV chargers.",
    "Establish policies to assess and mitigate the impact of new developments on neighboring property values, noise, and traffic.",
    "Require compensation or safeguards for neighbors affected by increased noise and traffic due to new developments such as multi-family housing replacements.",
    "Reduce parking minimums in new developments.",
    "Move parking to underground or under-building structures to free up surface lots.",
    "Encourage collaboration between the city, builders, and financiers to ensure needed buildings are constructed.",
    "Focus efforts on building a variety of housing types to address the housing crisis.",
    "Prioritize building middle housing types such as duplexes, triplexes, townhomes, live-work units, and courtyard housing.",
    "Reduce height restrictions in the downtown core and other designated urban villages to allow for more housing.",
    "Guarantee that affordable housing units are included in the majority of new developments to ensure affordability is addressed.",
    "Limit the size of houses and their footprints to allow space for large trees.",
    "Cluster housing and arrange parking areas to prevent neighborhoods from becoming parking lots.",
    "Consider housing forms such as row housing and courtyard condos instead of smaller single-family lots with minimal setbacks.",
    "Promote owner occupancy to avoid speculative ownership that prioritizes profit over livability.",
    "Pursue clustered small housing developments on larger lots.",
    "Raise height limits downtown and in Urban villages to allow for more housing density.",
    "Penalize speculative holding of properties to prevent underutilization of land.",
    "Protect historic buildings and open spaces from destruction due to development.",
    "Consider keeping or increasing parking requirements for private residential and commercial properties.",
    "Eliminate street parking to create more space for bike lanes, bus lanes, and larger sidewalks.",
    "Move cars off the street and onto private property to improve city mobility.",
    "Maintain single family housing on larger lots.",
    "Ensure a variety of housing types is available.",
    "Preserve traditional single family neighborhoods.",
    "Provide housing options that offer more space and less noise.",
    "Provide detailed information about your plans.",
    "Change the title of the topic 'Employment Lands and Supporting Infrastructure' to make it clearer.",
    "Rezone the entire city to permit all types of large buildings.",
    "Encourage construction of very tall skyscrapers, such as 100-story buildings.",
    "Develop the city to become a boom-town with abundant jobs and housing.",
    "Promote local career opportunities through urban growth and development.",
    "Eliminate current regulatory impediments to development to improve housing affordability.",
    "Avoid central planning and micromanagement in economic development.",
    "Focus city activities on policing, infrastructure of roads and utilities, and other core city responsibilities.",
    "Create an environment that supports entrepreneurship and employment without onerous regulation and central planning.",
    "Support industry clusters or innovation hubs in technology, television, tourism, and healthcare to create job opportunities.",
    "Develop 'learn to earn' programs as alternatives to college for youth.",
    "Forge 'roots to fruits' pathways through initiatives like the Bellingham Promise and Bellingham Plan to train and retain local youth.",
    "Create 'cradle to career' pathways involving colleges, non-profits, and foundations to provide job market or service opportunities for high school graduates.",
    "Establish a 'rite of passage' program for high school graduates who want to remain in Bellingham.",
    "Recognize the unceded territory of the Coast Salish Peoples and express respect and gratitude for the Lummi Nation and Nooksack Tribe.",
    "Determine responsibilities that recognition of indigenous lands compels the community to undertake.",
    "Align efforts between the two largest employers in Whatcom County to support community and economic development.",
    "Implement accessibility measures.",
    "Promote inclusivity.",
    "Ensure living wages for workers.",
    "Provide affordable housing.",
    "Provide affordable childcare.",
    "Avoid expanding Urban Growth Areas (UGAs) to prevent urban sprawl.",
    "Focus on building up (increasing density) rather than building out (expanding UGAs).",
    "Support and encourage neighborhood businesses like Nelson’s Store in the York District.",
    "Create spaces for small businesses that allow community gathering and communication, similar to small town diners.",
    "Encourage incubation of small businesses with tax breaks.",
    "Address increasing crime to improve safety downtown.",
    "Address homeless squatting to improve safety downtown.",
    "Address litter to improve safety downtown.",
    "Develop and communicate a clear plan to create a business-friendly culture in the city.",
    "Implement policies that relieve restrictions on small business development similar to those for residential development.",
    "Consider exemptions or adjustments to minimum wage mandates for tipped workers to support small businesses like restaurants and bars.",
    "Improve parking availability and affordability downtown and in Urban Village areas.",
    "Reevaluate the placement of bike lanes on main arterial roads to enhance safety for motorists and accommodate weather conditions.",
    "City leaders should actively seek to accommodate the majority of Whatcom County's population growth and plan well for it.",
    "Build and maintain a vibrant, resilient downtown by achieving a critical mass of population with diverse people and businesses throughout the entire City.",
    "Embrace the future with proactive infrastructure planning.",
    "Implement directed growth strategies for a variety of housing opportunities.",
    "Expand the Urban Growth Areas (UGAs) to enable growth of all housing types.",
    "Allow small commercial development in new residential areas within expanded UGAs.",
    "Add child care facilities, especially for very young children, as the city expands.",
    "Consider amending zoning laws to make childcare a permitted use in more zones.",
    "Do not rezone town centers as 79-unit multifamily residential areas.",
    "Support the integration of small-scale commercial uses in residential areas.",
    "Provide more detailed and substantive materials for public review beyond conceptual PowerPoint outlines.",
    "Clarify the methodology used to determine the 'most common' opinions during the scoping phase to ensure objectivity.",
    "Include a Best Available Science technical report companion to the Comp Plan to support updates and citations.",
    "Explicitly include streamflow and water supply as topic areas in the Environment chapter due to their importance in growth allocation and planning.",
    "Incorporate water availability and supply considerations into aquatic ecosystems and water quality and quantity topics, linking them to land use impacts and the Climate chapter.",
    "Include mitigation strategies for sea level rise impacts under coastal resiliency.",
    "Address the rate of urban forest cover removal and aim to increase forest cover in line with urban forest plan goals.",
    "Add urban wildlife corridors to the terrestrial ecosystems topic area.",
    "Update the Natural Resource Management section with the latest best available science since 2016.",
    "Require power washing of job site power equipment between sites to reduce the spread of invasive species.",
    "Explicitly include water supply, water availability, and water rights in WRIA 1 coordination efforts.",
    "Change the goal from 'promote urban tree canopy' to actively increasing urban tree canopy to offset climate impacts such as the heat island effect.",
    "Make reduction of plastic usage a priority in the coming years.",
    "Work with county, state, and non-governmental partners to accelerate reductions in plastic usage.",
    "Repurpose underused car infrastructure such as shared turning lanes and empty parking spaces into green infrastructure.",
    "Implement native plantings in these repurposed spaces to support pollinators, protect against atmospheric rivers, and improve air quality.",
    "Incorporate missing bumpouts, pinch points, and chicanes as part of the green infrastructure plan.",
    "Look to cities like Paris and Utrecht as examples for implementing urban forestry and biodiversity initiatives.",
    "Incorporate responsibility for water quality declines into urban planning.",
    "Replace 'right tree right place' approach with 'best tree right place' to ensure trees provide desired urban forest services.",
    "Protect urban ecosystem functions by measuring and incorporating them throughout urban planning, not trading them off for density elsewhere.",
    "Plan urban density in a way that also provides ecosystem services everywhere, not just in designated parks.",
    "Recognize that shade and habitat benefits do not travel across distances and cannot be confined to parks alone.",
    "Connect with disability communities.",
    "Ensure accessible access to nature spaces.",
    "Connect with disability communities.",
    "Ensure accessible access to nature spaces.",
    "Do not use more turf and rubber byproducts due to unknown impacts on 66PDQ contributions.",
    "Avoid using turf and rubber byproducts on athletic fields to protect salmon preservation obligations.",
    "Implement streetcars to reduce traffic from tired vehicles by replacing them with steel wheels.",
    "Include specific policy language on job creation related to climate and environment in the chapters.",
    "Address the environmental footprint of industrial operations and their low employment density.",
    "Focus on reducing cleanup costs, health risks, and environmental damage caused by industrial operations.",
    "Promote transition toward responsible and sustainable commerce that supports healthy and ample jobs.",
    "Incorporate job training programs as part of the transition to sustainable commerce and environmental goals.",
    "Encourage and help property owners with large lawns/yards to plant native plants instead of grass lawns to support biodiversity and water conservation.",
    "Partner with the Lummi Nation, Nooksack Tribe, Western, and/or WCC to support native planting efforts.",
    "Develop a comprehensive waste management strategy focused on reducing plastic usage.",
    "Implement stronger waste management regulations to limit plastic use.",
    "Collaborate with local businesses in the city and county to support alternatives to plastic.",
    "Advocate for state-level policies that support reduction of plastic usage and promote alternatives.",
    "Implement a debris and slash removal program in the Samish Crest open spaces to reduce wildfire risk.",
    "Develop a wildfire prevention plan specifically for the Samish Crest area to protect nearby communities such as Samish Hill.",
    "Increase monitoring and management of natural areas like Samish Crest to prevent accumulation of flammable materials.",
    "Create a fully connected network of protected bicycle and rolling infrastructure that includes all destinations.",
    "Remove density restrictions on housing and enable mixed-use development in all neighborhoods to allow residents to walk or bike/roll safely to work, stores, and coffee shops.",
    "Expand tree cover in neighborhoods with the least coverage by removing street parking on the approach to intersections.",
    "Adopt dynamic pricing for parking that reflects its true costs instead of subsidizing automobiles.",
    "Include specific measures to enhance the environment in Bellingham in the Environment Chapter Update.",
    "Provide clear timelines for compliance with the State Environmental Policy Act (SEPA) in the project plan.",
    "Make the growth alternatives and their environmental impacts from the Whatcom County Environmental Impact Statement (EIS) available before proceeding with plan elements.",
    "Ensure that environmental reviews present alternative means of accomplishing goals and their environmental effects for public and decision-maker evaluation.",
    "Provide more information about the proposed changes to the local park.",
    "Organize a community meeting to discuss the park renovation plans.",
    "Ensure that the park renovation includes accessible facilities for all residents.",
    "Increase the number of benches and shaded areas in the park.",
    "Improve lighting in the park for safety during evening hours.",
    "Honor and respect trees while balancing growth and increased density.",
    "Balance natural resources with development to address competing interests.",
    "Promote native plants, including preserving existing healthy old-growth trees.",
    "Encourage stewardship and environmental equity.",
    "Minimize environmental burdens in development and planning.",
    "Consider the environmental value of trees and encourage tree preservation.",
    "Include protection of threatened animal wildlife habitats in environmental planning.",
    "Promote urban tree canopy expansion.",
    "Improve and maintain outdoor air quality.",
    "Plant larger tree species that can provide significant canopy cover and health benefits.",
    "Implement substantial tree planting rules using metrics such as the 3-30-300 rule to ensure meaningful tree canopy coverage.",
    "Avoid planting small tree species that do not meet health and environmental objectives.",
    "Spare the large deciduous trees near the current Carl Cozier school to provide shade and enhance the area.",
    "Keep the digesters and acid ball as part of Bellingham's industrial history and heritage.",
    "Make downtown car-free as much as possible.",
    "Bring back the trolley on Railroad Ave.",
    "Increase the number of trees, native plants, and downtown nature parklets.",
    "Remove the remaining structures of the old GP plant, such as digesters and Acid ball.",
    "Convert the old GP plant area into a public mixed-use space with waterfront views and access.",
    "Consider establishing a Coast Salish museum in the converted area.",
    "Create a Pacific Northwest native plant park in the converted area.",
    "Increase public access to waterfront areas in the city.",
    "Focus population growth in the City of Bellingham to reduce urban sprawl into rural areas.",
    "Allocate the majority of population growth to the City of Bellingham to reduce carbon footprint from commuting.",
    "Prevent housing development in flood-prone areas, agricultural lands, resource lands, and open spaces throughout the county.",
    "Protect mobile home parks from unnecessary fees",
    "Prevent absurd annual space rental increases in mobile home parks",
    "Provide clear and detailed text changes to the BMC proposed rather than just broad strokes.",
    "Make it easier to find the specific text changes in the BMC proposal.",
    "Reduce setbacks, height limits, and floor area ratio (FAR) restrictions to allow more housing construction.",
    "Increase the allowable FAR on small lots beyond 0.35 to enable moderate density development.",
    "Implement bold measures to significantly increase housing supply in Bellingham.",
    "Provide financial compensation to homeowners affected by the construction of high-rise apartment complexes.",
    "Ensure developers and the city implement measures to prevent loss of home value for existing homeowners.",
    "Consider the impact of new housing developments on existing homeowners' investments and retirement plans.",
    "Establish a cooperative relationship between the City, developers, builders, and community leaders to develop housing that meets community needs.",
    "Organize meetings involving developers, builders, community leaders, and the City to discuss housing development plans.",
    "Extend the time and opportunity for community members to discuss housing issues beyond the current 2-minute public hearing limit.",
    "Create forums or platforms for more in-depth discussion of housing policies to ensure they effectively address community concerns.",
    "Develop supported living structures for disabled individuals with built-in office and staff areas.",
    "Create community homes designed with attached but spread out, one-floor layouts similar to homes in East Lynden.",
    "Establish an enclave of connected community homes for families with seniors and disabled members within the town.",
    "Increase intergenerational housing options.",
    "Avoid segregating senior housing from other neighborhoods.",
    "Develop senior housing that includes daycare for children to promote interaction between elders and young children.",
    "Request the city to adjust sewage billing for properties with septic tanks.",
    "Advocate for separate billing for sewage services and septic tank maintenance.",
    "Contact local government representatives to address unfair sewage charges.",
    "Organize a community group to petition for fair sewage billing policies.",
    "Seek legal advice regarding being charged for services not received.",
    "Create friendlier code compliances for small individual property owners to build DADUs, ADUs, or other independent living spaces.",
    "Make code compliances for creating rental or independent living spaces more affordable for small property owners.",
    "Ensure that regulations do not disproportionately favor large property management companies over individual property owners.",
    "Develop appealing group senior housing options for relatively affluent middle class seniors to provide alternatives to staying in single family homes or moving to expensive senior homes.",
    "Create senior housing alternatives that attract seniors with disposable income to help free up single family homes in the housing market.",
    "Plan for senior housing solutions that are more attractive than expensive geriatric service homes to encourage seniors to move and open up housing stock.",
    "Consider offering appealing senior group housing options to reduce demand for in-home senior services and keep the housing market more fluid.",
    "The City of Bellingham should ask the Washington Department of Transportation to erect berms or walls along Interstate 5 to reduce noise for nearby apartments.",
    "All apartments in Bellingham should be designed to be quiet to improve livability and support housing market filtering.",
    "Increase the availability of single-level apartments without stairs to accommodate residents with mobility issues.",
    "The City of Bellingham should set a goal for the proportion of housing that meets universal design standards.",
    "Develop more protections for renters in the city.",
    "Implement regulations to prevent excessive rent increases, especially after property ownership changes.",
    "Increase city inspections and enforcement to ensure landlords provide sufficient maintenance and repairs.",
    "Address the use of algorithms by corporate landlords to keep rents high.",
    "Consider policies to make home ownership more attainable for working class residents.",
    "Focus on developing 'starter home' missing middle housing options such as 3-bedroom apartments in fourplexes or townhomes on small lots to provide affordable housing for young couples and families.",
    "Prioritize the construction of townhomes (in groups of 4) and fourplexes as the dominant missing middle housing types due to their value, ease of building, and suitability for infill city lots with alleys.",
    "Ensure that townhomes and fourplexes receive ample attention in housing development plans and policies.",
    "Incorporate input from builders in the planning and development of missing middle housing to ensure affordability and feasibility.",
    "Promote fourplexes as a steppingstone into family housing for renters, offering a design that integrates well into existing neighborhoods.",
    "Support private builders in constructing affordable missing middle housing types like townhomes and fourplexes in Bellingham and surrounding areas.",
    "Avoid concentrating housing, especially affordable housing, near freeways/highways to reduce health risks.",
    "Mitigate health harms associated with living near large amounts of car traffic in the Comprehensive Plan.",
    "Limit further housing development close to I-5, particularly near Samish, to prevent exacerbating health issues.",
    "Allow exceptions to ADA and similar regulations to reduce costs for affordable housing in existing homes, possibly by transferring these homes to non-profits.",
    "Include education programs on safely sharing roads and trails with increasing numbers of bikes.",
    "Implement penalties on homes that exceed a certain size per bedroom or have more bathrooms than bedrooms to incentivize smaller homes or more duplexes.",
    "Approve a greening plan along with the development plan.",
    "Preserve green areas in the city during development.",
    "Maintain the local flavor of Bellingham as a green city.",
    "Avoid dense, unattractive housing developments like those in Cordata.",
    "Ensure new developments do not compromise the city's aesthetic and green character.",
    "Focus on conversion of underutilized commercial and industrial structures to residential or mixed-use development.",
    "Conduct a comprehensive inventory of underutilized commercial and industrial properties.",
    "Adopt bond financing and other financial incentives to support conversion projects.",
    "Update building codes and permitting processes to facilitate conversion to residential or mixed-use development.",
    "Promote pilot projects to demonstrate feasibility and desirability of conversions.",
    "Consider the Herald Building as a candidate for conversion to residential or mixed-use development.",
    "Organize a city-wide effort to reuse existing unused or underused commercial and industrial structures for housing conversion.",
    "Use bond financing to support the conversion of commercial and industrial structures into housing.",
    "Provide financial incentives to encourage the reuse of commercial and industrial properties for residential purposes.",
    "Implement regulatory measures to facilitate the conversion of commercial and industrial buildings into housing.",
    "Focus on properties in the downtown area and other parts of Bellingham for housing conversion projects.",
    "Promote reuse of these properties to increase housing units, revitalize downtown, stimulate local business, conserve transportation resources, and reduce transportation-related emissions.",
    "Partner with effective affordable housing providers such as Mercy Housing, Habitat for Humanity, and Kulshan CLT to increase availability of affordable rental and owner-occupied units.",
    "Include an affordable quantity of rental units in the planning for the Civic Athletic Complex to help meet Mayor Lund's housing priorities.",
    "Activate a more robust transit system to accommodate increased residential housing without parking.",
    "Ensure transit options are accessible to everyone, including those who cannot bike or walk.",
    "Promote transit options to contribute to a more vibrant community.",
    "Develop more large-scale affordable housing to address housing shortages.",
    "Combine large-scale residential developments with small-scale commercial areas to create mixed-use developments.",
    "Focus on mixed-use developments to improve walkability and connectivity, especially in suburban areas.",
    "Consider middle-scale housing alongside commercial growth to strengthen small-scale commercial area plans.",
    "Expand urban villages to create more walkable areas, but prioritize housing solutions to address the housing crisis.",
    "Adopt plan #2 for housing development in Bellingham.",
    "Focus on diverse housing development in terms of pricing and style.",
    "Develop downtown, main streets, and other important centers of commerce/activity.",
    "Leverage Bellingham's unique transit culture in development plans.",
    "Avoid corporatization of businesses to prevent strip malls, fast food, and office centers.",
    "Support small businesses through development plans.",
    "Choose option #2 for planning public transit and higher density.",
    "Avoid option #3 to prevent sprawl and dilution of Bellingham’s vibe.",
    "Consider public transportation in planning decisions.",
    "Allow small-scale businesses such as grocery stores, restaurants, and drinking establishments in all neighborhoods.",
    "Remove parking minimums.",
    "Institute parking maximums.",
    "Allow and encourage commercial and residential growth along walkable and bussable paths.",
    "Encourage people to travel locally without cars.",
    "Avoid urban sprawl as described in option 3.",
    "Avoid maintaining the status quo as described in option 1.",
    "Remove all zoning and parking restrictions except for industrial zones.",
    "Encourage distributed shops throughout the entire city.",
    "Reduce the speed limit in urban villages below 35 mph.",
    "Add curves (meanders) to the roads in urban villages.",
    "Plant trees in urban villages.",
    "Add seating areas in urban villages.",
    "Reduce the speed limit in urban villages below 35 mph to enhance pedestrian safety.",
    "Add curves (meanders) to the roads in urban villages to slow down traffic.",
    "Plant trees in urban villages to improve the environment and pedestrian experience.",
    "Install seating areas in urban villages to make the area more pedestrian-friendly.",
    "Build community at the neighborhood or smaller area level.",
    "Organize alley parties to bring families together within the neighborhood.",
    "Emphasize the 'Complete Neighborhoods' approach to improve quality of living throughout the city.",
    "Implement plan 2 with more frequent bus service.",
    "Consider the possible return of trams in the downtown area connecting Fairhaven with downtown.",
    "Create a new zoning type that encourages row housing in small urban villages.",
    "Add zoning for small corner shops, cafes, etc. in neighborhoods.",
    "Allow bigger apartments along high frequency transit streets to improve walkability and transit friendliness.",
    "Improve pedestrian connectivity between urban villages in Bellingham to prevent neglect of other areas.",
    "Increase bus frequency, especially in areas outside the Bellingham core, to improve public transportation.",
    "Focus on concentrating development within the existing city rather than expanding outward to avoid urban sprawl.",
    "Combine multiple approaches to achieve higher average density.",
    "Increase lifestyle choices through diverse planning.",
    "Enhance resilience to fuel and fuel price changes by integrating various strategies.",
    "Annex the area north of Bellingham along Marine Drive into the city.",
    "Allow residents in this area to vote in Bellingham mayoral elections.",
    "Develop the area across from Little Squalicum Park off Illinois Street with both apartments and shops.",
    "Increase attention and services to this area from both the county and city governments.",
    "Implement denser mixed-use zoning.",
    "Reduce car-centric infrastructure.",
    "Avoid expanding single-family neighborhoods that require cars.",
    "Change zoning laws to allow compact and walkable spaces.",
    "Complete Neighborhoods initiative should be prioritized.",
    "Monitor and evaluate the impact of the new Tree Ordinance on Middle Housing.",
    "Address concerns related to the effects of the Tree Ordinance on Middle Housing.",
    "Please provide the citizen comment or question to extract suggestions from.",
    "Prioritize density and walkability in urban planning.",
    "Avoid urban sprawl.",
    "Implement mixed-use zoning.",
    "Develop neighborhoods with their own Main Street.",
    "Increase the number of people within walking distance to corner shops, cafes, and breweries.",
    "Eliminate parking minimum requirements.",
    "Reduce lot sizes for single-family homes.",
    "Provide incentives for building new, smaller homes and duplexes, triplexes, and fourplexes.",
    "Include the Burkhart/Roe Trust property (Property ID 100296, Tax Parcel Number 3902364331690000) in the City's Urban Growth Area (UGA).",
    "Combine option 2 and option 3 to create connected urban corridors that enhance walkability.",
    "Allow greater diversity in zoning along urban corridors to include stores, restaurants, and essential services.",
    "Maintain pockets of quiet single-family homes for those who prefer them.",
    "Study and adopt successful urban planning strategies from cities like Portland that balance urban corridors with quaint neighborhoods.",
    "Construct more tall buildings",
    "Adopt regulations and codes that allow and incentivize infill toolkit projects, ADUs, and transit-oriented development.",
    "Implement direct proactive measures to bring new communities to the City in a consistent, efficient, and timely manner.",
    "Reconfigure the Urban Growth Area (UGA) by removing areas that cannot contribute needed housing and exchanging them for more efficiently buildable land.",
    "Invest in infrastructure to unlock existing buildable lands within the current city limits and the UGA/UGA Reserve.",
    "Ensure new Urban Growth Areas demonstrate the ability to provide urban levels of development and have a sustainable annexation plan prior to development.",
    "Create a town center in North Cordata in the UGA Reserve to provide community sense and an anchor for the City to the North.",
    "Develop the UGA Reserve to provide a significant volume and variety of housing options, mainly workforce housing for local residents.",
    "Eliminate neighborhood plans to prevent wealthy areas from opting out of growth.",
    "Increase flexibility in the land use code to allow more interspersion of commercial and residential areas.",
    "Allow redevelopment of existing strip mall areas with housing and other uses.",
    "Enhance transit corridors to support car-lite lifestyles.",
    "Add more urban villages at the intersection of Birchwood/Northwest and at Barkley Village to utilize underutilized city regions.",
    "Install buffered sidewalks on Sunset Ave west of the I5.",
    "Repair and maintain Barkley to prevent ruin.",
    "Create wider multi-use trails.",
    "Prevent developers from dominating the planning agenda.",
    "Preserve and protect the waterfront.",
    "Make land use regulations less prescriptive and more flexible.",
    "Allow all housing types on all lots without requiring special tools like the infill toolkit.",
    "Remove requirements that add additional cost and time to housing development.",
    "Reduce restrictions on builders to enable them to build what they want.",
    "Increase housing supply to help bring housing costs down.",
    "Re-allocate land in the downtown area currently used for vehicle parking to non-vehicle purposes.",
    "Convert vehicle parking areas into open spaces.",
    "Convert vehicle parking areas into dense development.",
    "Allow housing development",
    "Limit parking availability",
    "Limit car corridors",
    "Open up walking paths",
    "Improve public transit",
    "Proceed with changes without waiting for input from current residents",
    "Consider the needs of those unable to live here due to outdated policies",
    "Require new construction to include sufficient green space with trees, bushes, plants, and flowers to support bird and wildlife habitat.",
    "Require adequate transportation infrastructure such as parking, sidewalks, crosswalks, bike lanes, and bus stops with any new construction.",
    "Ensure that parking availability matches the needs of new housing developments to prevent overflow parking on sidewalks and streets.",
    "Honor and adhere to existing neighborhood plans rather than replacing them with generic plans that may not fit local needs.",
    "Increase public awareness about the input timeline for the decision.",
    "Provide more publicity for this issue similar to other Engage Bellingham issues like traffic or tree canopy.",
    "Ensure neighborhood groups and residents have a real choice and voice in the decision-making process.",
    "Share data on how many neighborhood groups and residents have submitted comments.",
    "Avoid making a rushed decision due to its potential devastating impact on the city.",
    "Preserve the distinctive character of each neighborhood and respect neighborhood pride.",
    "Avoid overriding neighborhood groups and input from local residents.",
    "Wait to see the impact of recent state changes like ADUs and parking regulations before making further changes.",
    "Allow existing residents to have influence over growth and neighborhood changes.",
    "Provide a longer public comment period for this significant change.",
    "Avoid rushing the decision and consider the timing of public input opportunities, especially during severe weather.",
    "Communicate transparently and openly with the public about the process and options.",
    "Continue to develop and update Neighborhood Plans.",
    "Resume use of Neighborhood Plans in the city planning process.",
    "Avoid blending city planning into one homogenous plan that ignores unique neighborhood needs and characteristics.",
    "Recognize and incorporate the unique histories and characteristics of different neighborhoods in planning.",
    "Consider unique public safety and environmental issues specific to each neighborhood.",
    "Empower neighborhood residents to have a voice in the future planning of their neighborhoods.",
    "Include considerations for parks, green spaces, trees, and safety infrastructure in neighborhood planning.",
    "Avoid adopting a one-size-fits-all municipal plan that leads to homogenized urban sprawl.",
    "Change the Planning Department's approach from considering development applications individually to assessing cumulative impacts on public safety and environment.",
    "Strengthen Municipal Codes and city staff/structure to address cumulative impacts of development.",
    "Do not further disempower Neighborhood Plans and neighborhood advocacy until the Planning Department is adequately staffed and mandated to protect residents from cumulative impacts.",
    "Address deficiencies in Municipal Codes and Planning Department staffing and processes as a priority before reducing neighborhood influence.",
    "Do not scrap our neighborhood plans",
    "Identify and properly implement transit corridors in Bellingham.",
    "Design the city around fast, frequent, and reliable transit to ensure easy and safe access for everyone.",
    "Use transit-oriented design to shape city corridors and avoid negative outcomes like those seen on Meridian Street.",
    "Coordinate zoning, urban villages, parks, trails, cycling networks, car thoroughfares, and transit infrastructure to support prioritized transit corridors.",
    "Maximize the placement of transit corridors to leverage their potential in building a better city.",
    "Address planning and implementation of bike lanes in the downtown area with careful consideration of placement.",
    "Improve safety and clarity of bike lanes and parking areas on Holly Street.",
    "Incorporate strategies in the plan to manage parking and congestion in older neighborhoods.",
    "Include protections in the plan to ensure residents can have parking space for at least one car per lot in neighborhoods affected by new land use policies allowing 4 and 6-plexes.",
    "Clarify how the plan will handle the removal of parking requirements on developments in Bellingham.",
    "Specify that transit corridors should be bike friendly in addition to WTA and pedestrian accommodations.",
    "Use the term 'encourage' instead of 'allow' when referring to transitional and supportive housing to promote a more active approach.",
    "Include encouragement for planting trees and providing shade in the relevant sections.",
    "Visit the Contact page at https://engagebellingham.org/bellinghamplan-contact-us to ask questions and receive replies from staff.",
    "Balance and integrate tree preservation with development projects.",
    "Adopt flexible approaches that prioritize honoring and preserving existing trees.",
    "Ensure development makes concessions to protect existing tree life.",
    "Maintain the existing tree canopy for physical and psychological health benefits.",
    "Design construction projects to build around and accommodate existing trees rather than removing them.",
    "Provide a direct link to the actual Draft Land Use Chapter on the website or in the communication materials.",
    "Set up slides so they can be enlarged with finger tips on mobile devices.",
    "Reconsider the Hamlet option for sharing county growth outside Bellingham.",
    "Explore utility and infrastructure issues instead of using them as barriers to growth.",
    "Communicate more explicitly about residential zoning changes required by recent state law.",
    "Use all strategies to accommodate population growth in the community.",
    "Develop a pedestrian-only town center similar to Pearl Street Mall in Boulder, Colorado.",
    "Create a vibrant downtown area with mixed amenities including unique shops, restaurants, art galleries, and stores.",
    "Focus on amenities that cater to tourists, families of university students, street performers, art fairs, and community events.",
    "Increase shopping amenities to reduce the need for residents to shop in other cities or online.",
    "Leverage the presence of the university to attract youth, their families, and friends to a unique and vibrant pedestrian downtown.",
    "Clarify the language regarding requirements for new UGA or UGA reserves to avoid open interpretation by officials.",
    "Establish specific rules that allow annexations only when an annexation plan analysis is completed and deemed sustainable.",
    "Assess land based on its raw state and condition before determining its use to ensure maximized and appropriate utilization.",
    "Avoid forcing urban development on land with poor bedrock, water conditions, or high flood risk to promote financial and environmental sustainability.",
    "Develop areas to maximize environmental benefits such as improving water flow and retention, preventing erosion, and supporting keystone species for thriving ecosystems.",
    "Learn from the experiences of other communities, both positive and negative.",
    "Avoid destroying the character of existing single family neighborhoods when pursuing higher density and affordability.",
    "Regulate development in established neighborhoods to preserve their character.",
    "Focus high density developments in already developed areas along transportation corridors.",
    "Allow modest but highly regulated development in grown neighborhoods of character.",
    "Analyze all existing stairs in parks and trail systems to determine if they are necessary or if they can be converted to accessible paths.",
    "Limit the addition of stairs in new trail systems to ensure accessibility for more users, including people in wheelchairs, bikers, and scooter users.",
    "Preserve as much waterfront property and other lands as possible for the future.",
    "Implement land preservation measures immediately to prevent overdevelopment.",
    "Protect natural areas like the hills around Lake Padden from being covered with housing.",
    "Prioritize land preservation now rather than delaying for years.",
    "Implement regular inspections to identify park infrastructure problems early before they become irreparable.",
    "Preserve and maintain historical or significant park signs, such as the Fairhaven Park sign.",
    "Increase maintenance and repair efforts for park structures like the over the track bridge and stairway to prevent loss of valuable views and access.",
    "Assess and repair long-standing issues in park facilities, such as the bathrooms in Village Green Park, to ensure usability.",
    "Evaluate if the Parks department has sufficient budget and resources to effectively maintain all parks and facilities.",
    "Liquidate small one-off SF lots designated as park property.",
    "Use the capital from liquidating these lots to improve the designated neighborhood park.",
    "Install more benches in parks and along trails to improve accessibility for people with limited mobility.",
    "Prioritize bench placement to enhance equity by removing barriers to park and trail access.",
    "Incorporate benches into park and trail design to activate open spaces and promote health and wellness.",
    "Consider benches as a safety enhancement to encourage use of outdoor spaces by all community members.",
    "Tear down and rebuild the existing pool facilities at Arnie Hannah.",
    "Address the million gallon a year leak under the main pools at Arnie Hannah.",
    "Increase enforcement actions against dog owners who do not clean up after their pets in Bellingham parks, walkways, and trails.",
    "Implement stricter penalties or fines for leaving dog poop and deposited bags in public areas.",
    "Enhance public awareness campaigns about the health risks of dog feces to discourage negligent behavior.",
    "Consider additional measures beyond signage to ensure compliance with pet waste regulations, such as patrols or surveillance.",
    "Increase the number of lap swim lanes in Bellingham aquatic facilities.",
    "Ensure aquatic facilities accommodate people of all ages and abilities for lap swimming.",
    "Plan for at least 20 lap swim lanes to meet the current population demand.",
    "Build more aquatic facilities in Bellingham.",
    "Prioritize aquatic spaces over additional trails in Bellingham.",
    "Develop world-class public aquatic facilities that cater to health, exercise, water safety, and social interaction needs.",
    "Increase city support for outside agencies to improve access and facility conditions in green spaces.",
    "Expand community involvement in habitat restoration and maintenance activities.",
    "Increase staffing for the volunteer program to better facilitate partnerships and community involvement.",
    "Provide more volunteer event opportunities by addressing staffing limitations.",
    "Speed up the approval process for park stewardship applications.",
    "Increase resources dedicated to community involvement in parks to build a thriving parks system.",
    "Form partnerships with local organizations and the Parks Volunteer Program to address invasive species.",
    "Increase funding for the Greenways program to support volunteer program staff and outreach efforts.",
    "Encourage greater public involvement in local parks to help eliminate invasive species and foster native habitat.",
    "Incorporate more native habitat in green spaces to foster native species.",
    "Eliminate the broken bridge in Cornwall Park and remove the pavement in that area.",
    "Plant native plants in the area adjacent to the waterway in Cornwall Park to help fish habitat.",
    "Avoid building a second bridge in Cornwall Park since there is already one downstream and funding is limited.",
    "Focus on restoring native habitat now rather than building new infrastructure.",
    "Have the City of Bellingham Parks Volunteer Program partner with NSEA and Public Works to recreate the space in Cornwall Park as a native green space habitat.",
    "Include preserving native habitat by removing invasive species in the preservation section on slide 10.",
    "Plant more native plants in green spaces.",
    "Remove invasive Himalayan Blackberry, Tansy, English Ivy, and other invasive species from trails and green spaces.",
    "Focus more on preserving existing park land rather than only acquiring new park land.",
    "Remove the duplicate quote on Slide 2 to avoid repetition.",
    "Ensure each quote on slides is unique to maintain audience engagement.",
    "Increase the number of lap lanes in Bellingham's aquatics facilities significantly.",
    "Plan for future growth in aquatics space as stated in the Comprehensive Plan.",
    "Build a 24 lane (50 meter) pool to meet current and future demand.",
    "Develop an aquatics complex comparable to Grandview Heights in B.C.",
    "Finish the trail connection between Little Squalicum and Cornwall Park.",
    "Fix the bridge in Cornwall Park, potentially with volunteer help.",
    "Allow trail users to have more input on trail surface decisions, especially regarding paving or graveling trails.",
    "Consider mountain bike options in trail areas where appropriate.",
    "Include mountain bikers and the Whatcom Mountain Bike Coalition (WMBC) in new trail projects and volunteer trail building.",
    "Avoid using lime gravel on trails in forested areas to preserve the natural feeling of being in the woods.",
    "Consider alternative trail surfaces that provide durability without compromising the natural experience.",
    "Find trail surface options that offer a smoother ride for bike commuters to improve comfort.",
    "Explore better ways to pitch and propose alternative trail surface materials.",
    "Preserve Geri Field and keep the grass fields as they are.",
    "Do not replace the grass fields with synthetic turf due to negative impacts on athlete injuries and the environment.",
    "Consider the importance of baseball and softball in the intramural sport program before making any drastic changes to the fields.",
    "Build a new, larger aquatics center in Bellingham.",
    "Update the existing aquatics center to increase its size and capacity.",
    "Design the aquatics center to support swimming lessons, aquatics programs, lap swimming, swim teams, and recreation.",
    "Ensure the aquatics center is reasonably priced and accessible to the entire community.",
    "Model the new aquatics center after BC's Grandview Heights Aquatic Center.",
    "Clarify the meaning of 'ground lighting' in the context of the project.",
    "Avoid extending outdoor access into evening hours to protect wildlife that require darkness.",
    "Use permeable materials for trail surfaces to allow water recharge and prevent pollutants from entering waterways.",
    "Educate dog owners to prevent their dogs from disturbing streams, creeks, and other water bodies important to fish and birds.",
    "Teach dog owners and families to prevent dogs and children from walking on beach rack.",
    "Encourage dog owners to keep their dogs out of woods in off-leash areas to avoid conflicts with wildlife such as coyote pups, deer, and rabbits.",
    "Provide access to comments both supporting and opposing the Holly St Bike lane project.",
    "Consider returning Holly Street to 3 lanes of vehicle traffic based on community feedback.",
    "Listen to citizens' concerns regarding the Holly St changes.",
    "Allow traffic to flow freely on Holly Street to reduce downtown congestion.",
    "Engineer safer road bike lanes in Bellingham.",
    "Develop greenways that connect throughout Bellingham.",
    "Create safe biking access everywhere in Bellingham.",
    "Add more protected bike lanes.",
    "Create continuous sidewalks on State Street.",
    "Implement traffic calming measures to slow down traffic on State Street.",
    "Prioritize walkability, bikeability, and public transit with safe connections.",
    "Extend Paratransit evening service hours by at least 15 minutes, from 8:30 PM to 8:45 PM, especially in the Cordata area.",
    "Consider adjusting Paratransit pickup times to accommodate attendance at evening classes and appointments for mental health treatment.",
    "Increase overall evening bus service hours to better serve individuals who rely on public transportation for late activities.",
    "Promote awareness and availability of extended bus services to encourage more people to use public transportation instead of driving individually.",
    "Require parking on private land for new infill developments to preserve street parking availability.",
    "Involve bicyclists in selecting and testing bike-friendly streets and bike lane implementations over extended periods.",
    "Use cost-efficient methods to evaluate the effectiveness of bike lane markings and awareness measures, including surveys.",
    "Encourage businesses and employers to promote alternative transportation among patrons and employees, possibly through incentives like discounts for biking.",
    "Avoid solely reducing car lanes and parking as a strategy, considering the city's growth and diverse transportation needs.",
    "Reimplement a trolley system or develop a light rail/intercity rail system in Bellingham to reduce congestion on high traffic routes.",
    "Plan and implement the rail system to run through the median of wide streets, similar to the Capitol Hill section in Seattle.",
    "Increase the frequency of bus services to neighborhoods outside of planned urban villages, such as Sudden Valley.",
    "Develop more infrastructure surrounding bus stops to increase ridership in neighborhoods with infrequent bus service.",
    "Prioritize public transit over private vehicles (POVs).",
    "Designate dedicated lanes for bike lanes separate from transit lanes.",
    "Incorporate bike lanes into transit-only lanes to reduce conflicts.",
    "Avoid expanding road use to protect salmonid species in local waters.",
    "Recreate the trolley (streetcar) system in the City of Bellingham to reduce traffic congestion.",
    "Develop transit and bike-only lanes that can eventually be converted into streetcar lanes.",
    "Invest in building a superior public transit system now to prepare for future growth and avoid lagging behind.",
    "Focus on developing and maintaining trails.",
    "Enhance community safety measures.",
    "Promote alternatives to car transportation.",
    "Improve accessibility in community planning.",
    "Increase police patrols in the neighborhood to reduce crime.",
    "Install more street lighting to improve safety at night.",
    "Organize community watch programs to encourage residents to report suspicious activities.",
    "Provide youth engagement programs to prevent involvement in criminal activities.",
    "Make Bellingham safer for pedestrians and cyclists.",
    "Improve accessibility and options for public transit.",
    "Implement more trails and throughways for non-vehicle transportation around the city.",
    "Expand the transportation system to accommodate a wide variety of barriers and needs.",
    "Install and maintain public electric vehicle charging stations throughout the city and surrounding areas.",
    "Incorporate wildlife corridors to prevent collisions between automobiles and animals.",
    "Encourage drivers to respect crosswalks, speed limits, and allow merging to improve safety and traffic flow.",
    "Distinguish between 'streets' (destinations) and 'roads' (thoroughfares) in traffic planning and infrastructure.",
    "Design streets to limit and calm car traffic to create comfortable environments for all users, incorporating concepts like 'shared streets'.",
    "Design roads to allow higher travel speeds while encouraging safe speeds through physical separation of cars, bikes, and pedestrians.",
    "Avoid designing places that attempt to function as both street and road simultaneously, such as Meridian north of I-5.",
    "Integrate WTA with BSD bus system under a single branding and safety emphasis to increase frequency and reduce duplication.",
    "Diversify the bus system to include a range of vehicle sizes to match ridership variations and service needs.",
    "Integrate bikes within traffic lanes instead of isolated bike lanes that are unsafe.",
    "Provide safe, weatherproof bike parking in high use areas.",
    "Support neighborhood groups in creating foot and bike transport corridors along unused street rights-of-way and provide funding for this.",
    "Use street rights-of-way to increase connectivity among trails and neighborhoods.",
    "Incentivize bike use through bonus programs for bike commuters.",
    "Create an electric trolley system in the core urban area with a figure-eight route linking downtown, Fairhaven/WWU, and Barkley or Meridian/Bakerview.",
    "Do not widen I-5 through Bellingham; consider closing certain exchanges to streamline freeway traffic and reduce local commuter use.",
    "Preserve any spare space in the I-5 right-of-way for future rail transit.",
    "Change the bus route from Edgemoor to downtown so it does not go up to Western before going downtown to reduce travel time.",
    "Include Edgemoor in the Fairhaven to downtown bus route to improve service and potentially increase ridership.",
    "Increase the frequency of bus service.",
    "Improve connectivity between different areas of town, not just routes centered around downtown transit center and Cordata bus station.",
    "Encourage public transit use to reduce the number of single-occupancy vehicles on the road.",
    "Assess and address pollution levels in Lake Whatcom potentially caused by vehicle traffic near Sudden Valley.",
    "Provide a clear explanation for the change in the WTA Yew Street Road bus route to a counter clockwise direction.",
    "Do not add a third freeway lane due to the high expense involved.",
    "Consider implementing the previously proposed Highway 9 transportation corridor for rail and truck traffic to reduce congestion on I5.",
    "Reassess the decision to reduce Samish Way from two lanes to one lane, as it has increased congestion.",
    "Address the traffic and safety issues on Holly Street.",
    "Develop transportation options that accommodate rural residents who need to carry groceries and cannot easily use buses, bikes, or walking.",
    "Slow down the speed limit on the freeway through the city proper to improve safety.",
    "Reduce the number of freeway exits and entrances within the city.",
    "Improve transit coverage to reduce reliance on cars.",
    "Plan and implement light rail transit in the near future.",
    "Address urban sprawl issues in north Bellingham, particularly in Meridian and Cordata areas.",
    "Reduce the width of roads in areas with underutilized parking lots to discourage speeding through residential areas.",
    "Update the transportation element in the Neighborhood plans to reflect current conditions rather than ideas from the 1980s and 1990s.",
    "Remove outdated arterial linkages from neighborhood plans and conditions of approval where they are no longer relevant.",
    "Clarify and unify the arterial connector plans for Cordata and Meridian Street neighborhoods to eliminate ambiguity.",
    "Establish clear guidelines on who is responsible for paying for transportation improvements in these neighborhoods.",
    "Develop and implement a single, comprehensive plan for all required transportation improvements to provide certainty for builders regarding project conditions.",
    "Resolve the roadway connection issues linked to zoning regulations in Cordata and Meridian neighborhoods.",
    "Finalize decisions on roadway connections to complete existing neighborhoods in the northern communities.",
    "Bellingham should collaborate closely with WTA to align bus routes with where people need transit service, rather than planning around existing routes.",
    "The city should identify underutilized areas and upzone them first, then coordinate with WTA to provide bus service to those areas.",
    "Reduce parking minimums but do not eliminate them entirely to balance incentives for alternative transportation and avoid parking shortages.",
    "Provide positive incentives for using alternatives to single-occupancy vehicles instead of penalizing drivers by reducing parking availability.",
    "Consider eliminating some on- and off-ramps to I-5 to reduce traffic congestion and accidents caused by frequent merging and exiting.",
    "Encourage use of surface streets for short trips instead of I-5 to reduce congestion on the interstate.",
    "Reduce the speed limit on main arterial roads near Cordata park from 35 mph to 25 mph to enhance pedestrian and bike safety.",
    "Consider implementing traffic calming measures such as speed bumps on streets near Cordata park to slow down vehicle traffic.",
    "Increase the number of pedestrian crosswalks with safety features on routes leading to Cordata park to protect pedestrians from fast-moving vehicles.",
    "Add more space for skateboarding.",
    "Add more obstacles for skateboarding.",
    "Create a basic disc golf course in the open space.",
    "Design a 9-hole disc golf course.",
    "Model the course after Cornwall Park or Vanderyacht Park.",
    "Include the disc golf course in phase 3 of development.",
    "Create a public food forest in Bellingham.",
    "Engage local permaculturists to design the food forest.",
    "Organize volunteers to prepare the area and plant the food forest.",
    "Use the food forest as an educational resource for the community.",
    "Address community requests for shade by incorporating shade-providing plants in the food forest.",
    "Include native fruit and nut bearing trees in the landscape design of Cordata Park Phase 2 to create a community food forest.",
    "Use Greenways funding to promote community gardens as promised in Greenways Levy IV.",
    "Incorporate food forests, public permaculture bioswales, and pollinator gardens in the park design.",
    "Align park development with City of Bellingham goals of food access and security.",
    "Create a forest area in the park for walking and picnicking.",
    "Add more shaded areas in the park.",
    "Re-evaluate the current exercise equipment for seniors to ensure it is user-friendly and adjustable for various sizes.",
    "Add a stool or landing to the foot press equipment to make it easier to use.",
    "Improve the comfort of the back support on the foot press equipment.",
    "Replace or improve arm exercise equipment to make it more sensible and user-friendly.",
    "Provide large print instructions for the exercise equipment for seniors.",
    "Add an exercise bike to the park's exercise equipment.",
    "Consult a Sports Physical Therapist to select user-friendly exercise equipment.",
    "Install more Pickleball courts in the community.",
    "Build lighted covered Pickleball courts to allow play during long winters.",
    "Install Pickleball courts at the new Squalicum Creek Park where the baseball diamonds are now being completed.",
    "Add covered Pickleball courts at Squalicum Creek Park.",
    "Add beach volleyball courts at Squalicum Creek Park.",
    "Balance park development to include facilities that serve more people in the community.",
    "Encourage more use of parks to increase safety.",
    "Create a low shallow area in the park that can be flooded and allowed to freeze over in winter for ice skating, preferably as a loop around a center land mass.",
    "Design the basketball court to be floodable in winter to allow ice skating during long cold spells if a wetland area cannot be used for this purpose.",
    "Plant trees in the park to provide shade, especially for hot summers.",
    "Increase the amount of shade in the park area.",
    "Coordinate with WTA to establish a bus stop on the same side of Cordata as the park.",
    "Implement a bus route that runs north on Cordata to improve accessibility to the park.",
    "Add more shade on the park paths.",
    "Establish a community garden in the Cordata neighborhood.",
    "Organize community events like Make a Difference Day that encourage local participation.",
    "Ensure parks and community events are accessible by walking to reduce the need for driving.",
    "Plant more trees and foliage along the trails and resting areas to provide shade.",
    "Install overhead coverings in shaded areas along the trails and resting spots to make the park usable during daylight hours, especially in Spring and Summer.",
    "Create space for community gardening in Cordata park",
    "Expand the number of pickleball courts in Bellingham, particularly at Cordata Park.",
    "Develop a world-class pickleball facility in Bellingham similar to the Spalding County Pickleball Complex in Griffin, GA, including both covered and uncovered courts.",
    "Leverage pickleball to promote an active lifestyle, physical and mental health, and community well-being in Bellingham.",
    "Use pickleball as a tool to boost sports tourism and generate economic impact in Bellingham.",
    "Collaborate with local and national pickleball organizations to host regional, state, and national pickleball tournaments in Bellingham.",
    "Study and apply successful models from other communities like Griffin, GA and Lincoln, Canada to maximize the benefits of pickleball in Bellingham.",
    "Increase community engagement and support for pickleball to enhance social connections and outdoor activity opportunities.",
    "Increase the number of pickleball courts beyond four.",
    "Prioritize adding pickleball courts in every new park development as initially promised.",
    "Allow spray painting on courts to create more pickleball courts and increase capacity.",
    "Build more pickleball courts to accommodate demand.",
    "Consider constructing dedicated covered pickleball courts to provide shelter and improve playing conditions.",
    "Build 8-10 Pickleball courts at Cordata Park.",
    "Consider covering the Pickleball courts to allow for use in various weather conditions.",
    "Install lights on the Pickleball courts to extend playable hours.",
    "Convert some local tennis courts into Pickleball courts to meet growing demand.",
    "Add more pickleball courts beyond the current plan if budget allows.",
    "Include covers for the pickleball courts to enable year-round play in the Pacific Northwest.",
    "Add 8 to 10 pickleball courts at Cordata to accommodate demand.",
    "Incorporate internal fences between courts to prevent disturbance to neighboring courts.",
    "Include pickleball courts in the facilities.",
    "Consider adding more pickleball courts in the future.",
    "Add lights for night play on the pickleball courts.",
    "Add covers for rain play on the pickleball courts.",
    "Construct a new park entrance as funded by donations.",
    "Consider preserving or reconstructing the original entrance due to its historical value.",
    "Choose option number 4 for the new entrance because it has a stronger sense of place and connection to Fairhaven.",
    "Increase police presence in the neighborhood to reduce crime.",
    "Implement community policing programs to build trust between residents and law enforcement.",
    "Install better street lighting to improve safety at night.",
    "Organize neighborhood watch groups to monitor and report suspicious activities.",
    "Provide youth engagement programs to prevent involvement in criminal activities.",
    "Do not spend $75,000 on a sign.",
    "Use the money to fix The Arroyo for hiking, riding, and biking.",
    "Keep the existing brick column design for signs in Fairhaven.",
    "Avoid introducing a different design motif for signs.",
    "Do not use contemporary sign designs that resemble strip mall entrances.",
    "City, community, and businesses combine funds to purchase St. Joe's on Ellis.",
    "Refurbish St. Joe's on Ellis if needed.",
    "Open St. Joe's on Ellis as a facility for homeless individuals and low-income community members with mental health and drug dependency issues.",
    "Increase the availability of down-payment assistance programs for moderate-income residents.",
    "Find a better balance between funding homeownership assistance and homelessness programs.",
    "Implement rent control to prevent rent increases that hinder savings for homebuyers.",
    "Increase accountability and oversight of HUD property management to ensure appropriate housing allocation.",
    "Develop more affordable housing options specifically for lower-income, mortgage-qualified, disabled buyers.",
    "Create homeownership assistance programs that do not require repayment upon sale to help buyers build wealth.",
    "Address the issue of 'over-housed' tenants occupying larger units to free up housing for those in need.",
    "Encourage private development to focus on diverse, affordable housing rather than uniform, high-rent units.",
    "Ensure down payment assistance programs are accessible and effective for eligible buyers in the local market.",
    "Provide more single-level, affordable homes suitable for disabled buyers.",
    "Limit the impact of cash buyers and investors on the affordable housing market to allow qualified buyers to compete.",
    "Increase transparency on who benefits from down payment assistance programs and how they impact long-term affordability.",
    "Incorporate community activity centers into the housing plan.",
    "Consider partnering with other organizations to fund community activity centers if HUD funding is not available.",
    "Prioritize funding for the homeownership downpayment assistance program for first-time homeowners earning less than 80% of the area median income.",
    "Support new homeownership development projects like the Kulshan Community Land Trust's Telegraph Road project.",
    "Identify and prioritize the most important programs and projects in the draft Action Plan for funding.",
    "Consider partially funding or not funding less critical programs and projects to balance the draft action plan budget.",
    "The City of Bellingham should promote home ownership opportunities to help residents build real wealth.",
    "The City should reconsider its current focus on permitting more rental properties and instead encourage development of affordable homes for purchase.",
    "The City should implement policies that reduce reliance on rental housing and support pathways to home ownership.",
    "The City should regulate private developers to ensure they contribute to affordable home ownership options, not just rental properties.",
    "Law enforcement leaders should not use the department's social media to speak negatively of enacted policy changes.",
    "Law enforcement leaders should not use the department's physical presence to speak negatively of enacted policy changes.",
    "Law enforcement leaders should express their opinions on policy changes in a non-professional context.",
    "Improve the responsiveness and effectiveness of 911 emergency services in Bellingham Whatcom County.",
    "Address and prevent elder abuse in the community.",
    "Ensure law enforcement takes reports of car theft and elder abuse seriously and acts on them.",
    "Provide better support and resources for victims of car theft and elder abuse.",
    "Maintain current compensation levels for the public service workers, emphasizing job satisfaction as the primary reward.",
    "Ensure that compensation for public service workers is at least equal to the Washington state minimum wage.",
    "Increase wages for councilor roles to be competitive with similar positions in the Seattle area.",
    "Set higher wage standards to attract experienced and knowledgeable candidates.",
    "Provide sufficient compensation so councilors can focus on their work without needing a second job.",
    "Recruit individuals capable of making complex decisions and collaborating effectively.",
    "Consider the impact of cost of living and population growth when setting compensation and recruitment strategies.",
    "Tie officials' salaries to the median income of the area.",
    "Increase Council members' salaries to be half of the Mayor's salary to reflect their workload and provide a stronger check-and-balance.",
    "Ensure Council members are paid to make the position accessible to all community members, not just those who can afford to work for free.",
    "Consider making Council member seats full-time positions to allow them to fully commit to their responsibilities and balance power with the Mayor.",
    "Increase the position's pay to at least $25 per hour to attract talented and enthusiastic people.",
    "Use the Washington Citizens' Commission on Salaries for Elected Officials as a benchmark to set salaries for elected positions.",
    "Set salaries for elected positions as a certain percentage of the salaries recommended by the Washington Citizens' Commission on Salaries for Elected Officials.",
    "Provide a list of the top five accomplishments of the city council for average Bellingham residents this year.",
    "Address the issue of crime in the city to improve safety.",
    "Manage homelessness to reduce the number of camps in public areas.",
    "Increase security at trailheads to prevent car break-ins.",
    "Enhance safety measures in Greenways parks and trails to make them more enjoyable.",
    "Recognize Bellingham city council positions as full-time roles due to the extensive time commitment required.",
    "Increase city council salaries to reflect full-time work and responsibilities, including attendance at additional meetings and community events.",
    "Consult current city council members to understand the actual workload and commitment involved in their roles.",
    "Expand salary comparisons to include state legislators and county officials, not just other city councils.",
    "Consider additional compensation for roles with extra responsibilities, such as Council President, Mayor Pro Tempore, and Council President Pro Tempore.",
    "Account for the cost of living in Bellingham when determining council salaries.",
    "Include the workload related to serving on multiple boards, commissions, and committees in compensation considerations.",
    "Acknowledge the sacrifices council members make, including being approached by constituents during personal time.",
    "Evaluate the support staff available to council members when comparing workloads and salaries with other cities.",
    "Avoid treating salary increases as mere cost-of-living adjustments; instead, base them on fair compensation for the work performed.",
    "Encourage council members to engage actively with their constituents by attending neighborhood and community meetings.",
    "Ensure council members introduce their own legislative work and not just respond to staff proposals.",
    "Review how many cities are currently conducting salary commission reviews to inform local decisions.",
    "Set a threshold for when council compensation should reflect a living wage based on demonstrated workload and community needs.",
    "Address the disparity between mayor and council salaries to maintain appropriate pay scales.",
    "Recognize that low compensation may deter qualified candidates from running for city council positions.",
    "Research the salaries of city council members in comparable cities.",
    "Determine the percentage of the city budget allocated to council member salaries in comparable cities.",
    "Consider differences in city budgets when comparing salaries.",
    "Include benefits such as medical, dental, and retirement in the salary comparison.",
    "Increase city councilors' salaries to be at least equivalent to the state minimum wage or higher.",
    "Adjust city councilors' compensation to reflect the full-time nature and workload of their responsibilities.",
    "Implement a cost of living adjustment (COLA) for city councilors' salaries.",
    "Ensure city councilors receive equitable pay comparable to county councilors.",
    "Recognize and address the equity issue caused by low city councilor wages leading to loss of diverse representation.",
    "Provide city councilors with salaries that allow them to maintain a reasonable work-life balance without needing additional jobs.",
    "Reevaluate city councilors' benefits to align with their workload and responsibilities.",
    "Make an honest assessment of the hours required to fulfill the councilmember position.",
    "Determine a true living wage for Bellingham based on current housing and living cost data.",
    "Set the minimum compensation for councilmembers at least at the determined living wage.",
    "Ensure the compensation makes the position feasible for poor and working class people to participate.",
    "Consider data from recent local articles and MIT living wage project when determining living wage.",
    "Reevaluate the current city defined living wage of $16.47/hour as it appears too low.",
    "Increase compensation for elected officials to match their increased workload.",
    "Ensure compensation is fair to attract and retain competent and responsible public servants.",
    "Recognize that adequate compensation is necessary to enable people from diverse economic backgrounds to serve, not just those with middle to upper class incomes.",
    "Recommend the commission to fairly compensate elected officials to support their leadership in guiding the community.",
    "Remove the trash or improve the cleanliness downtown.",
    "Make downtown more convenient to visit.",
    "Reevaluate Covid-related restrictions or measures downtown.",
    "Charge higher fees for non-car street users to better cover city costs.",
    "Reassess the allocation of parking spaces to balance needs between cars and non-car users, especially in areas like Fairhaven.",
    "Consider the impact of non-car street use on traffic flow, particularly on busy streets like Holly, and adjust policies accordingly.",
    "Evaluate the necessity of expanding business spaces downtown given the current number of vacant commercial spots.",
    "Implement a complete car-free zone in Bellingham and Fairhaven downtown areas.",
    "Provide free public transportation options such as buses or trolleys to support a car-free downtown.",
    "Improve the quality and appearance of the road infrastructure to meet drivers' expectations.",
    "Reduce the tax burden on residents, especially regarding property tax increases.",
    "Ensure that public projects provide clear value to taxpayers, particularly drivers.",
    "Address concerns of residents outside downtown areas to ensure equitable treatment.",
    "Find a fee structure and building requirements for the streatery program that satisfy both businesses and the city without requiring city subsidies.",
    "Consider the possibility of slight city subsidies for the streatery program due to its benefits to livability.",
    "Create more streateries with aesthetic, permanent structures instead of temporary, flimsy ones.",
    "Increase the number of pedestrianized streets, especially in downtown and Fairhaven, to encourage more foot and bike traffic and create more pleasant public spaces.",
    "Explain the reason for the renewal fee increase from $50 to approximately $1680.",
    "Assess fees for streateries that do not comply with published guidelines.",
    "Provide transparency on how the increased funds will be used.",
    "Do not use transportation monies raised by vehicle tabs for road upkeep if cars are not using downtown roads.",
    "Implement a licensing and yearly tab fee for bikes ridden by people over 16 to fund bike lanes.",
    "Designate parking spaces in areas like Railroad and Holly only for people with disabilities and those who cannot walk long distances.",
    "Shut down any streateries that are not ADA compliant until they conform to ADA civil rights requirements.",
    "Restrict or regulate parking usage to ensure spaces are available for people with disabilities.",
    "Address unfair advantages given to restaurants with smaller venues compared to those with larger rented spaces.",
    "Ensure all setups are ADA compliant and do not block sidewalk access for mobility devices.",
    "Increase fees for these setups or remove them entirely, similar to the approach taken with mask mandates.",
    "Continue the streateries program in Bellingham.",
    "Increase ADA access to streateries.",
    "Do not increase the fees for streateries; consider reducing or removing the $1600/year fee.",
    "Prioritize creating people-friendly spaces and increasing pedestrianization over vehicle storage.",
    "Support local businesses in creating and maintaining streateries by removing financial barriers.",
    "Reduce annual fees associated with streateries to encourage thriving local businesses and outdoor community spaces.",
    "Continue allowing and supporting streateries in downtown Bellingham to encourage business and community building.",
    "Maintain or consider increasing fees for streateries to encourage responsible business practices.",
    "Enforce standards for accessibility, safety, and spacing for streateries to address community concerns.",
    "Prioritize reducing car traffic and parking in downtown to improve safety and experience for pedestrians and cyclists.",
    "Promote alternative transportation options such as biking, bus, and walking to access downtown dining areas.",
    "Expand the streatery program in city centers.",
    "Reduce street parking in city centers to promote economic development.",
    "Implement car-free or pedestrian-centered streets downtown.",
    "Ensure all downtown streets have bike lanes and no more than two lanes of traffic.",
    "Allow restaurants to expand seating into street spaces for a fee.",
    "Encourage hiring in service and construction sectors through streatery expansion.",
    "Reinvest revenue from streatery fees into downtown development to create a pedestrian-centered area.",
    "Subsidize businesses to take over parking.",
    "Decrease through traffic in downtown.",
    "Increase the walkability of downtown.",
    "Businesses should pay market rate to take over parking spaces for streateries, rather than a subsidized rate.",
    "Design standards for streateries should be established and enforced to improve their appearance.",
    "No streateries should be allowed on narrow streets due to safety concerns.",
    "The city should add a minimum street width requirement for streateries in the new standards.",
    "Outdoor cafes should be limited to sidewalks wide enough to allow safe pedestrian passage.",
    "Reconsider the plan to increase fees and permits for streateries.",
    "Avoid imposing large fees and burdensome permits on small downtown businesses.",
    "Maintain the current support for streateries to preserve downtown livability and vibrancy.",
    "Address other challenges faced by downtown businesses such as increasing property taxes, petty crime, and public drug use instead of adding new burdens.",
    "Support and maintain streateries in downtown Bellingham to enhance community atmosphere.",
    "Encourage the use of sidewalks for outdoor dining to foster a close-knit community feel.",
    "Make the outdoor streeteries in downtown Bellingham permanent fixtures.",
    "Maintain and support the current streeteries to preserve vibrant downtown living.",
    "Reduce the annual fee to a nominal amount between $100 and $500.",
    "Promote streeteries as they help businesses employ more people and increase sales tax revenue.",
    "Encourage tourism for lunch or dinner to boost local spending and sales taxes.",
    "Specify more detailed design criteria for streateries, especially in the historic district of Fairhaven.",
    "Adopt more stringent aesthetic guidelines for outdoor cafes (streateries) to ensure they complement historic structures.",
    "Ensure streateries do not obstruct pedestrian sidewalks and maintain pedestrian accessibility.",
    "Preserve the historic character of commercial districts by regulating the appearance of streateries.",
    "Require streateries to fulfill architectural guidelines similar to those for permanent structures.",
    "Establish a standard of construction for streateries to ensure quality and safety.",
    "Limit the number of parking spaces that streateries can occupy.",
    "Implement a review process to monitor the usage of streateries and prevent them from becoming derelict.",
    "Keep construction requirements reasonable so that small businesses can participate in creating streateries.",
    "Maintain reasonable fees for streateries to ensure affordability for all owners.",
    "Determine and set a city-wide acceptable limit on parking spaces that can be converted to streateries.",
    "Create a waiting list system for new businesses wanting to use streateries when parking space is fully utilized.",
    "Limit the amount of parking a business can use relative to the total available spaces in front of the building.",
    "Prevent businesses from using parking spaces that reduce availability for neighboring businesses.",
    "Require businesses with underutilized streeteries to remove them.",
    "Update concept drawings to continue the trail to the southwestern edge of the work area, as the trail is planned to extend beyond the current limits.",
    "Provide clear signage indicating the locations of public restrooms.",
    "Create a map or guide showing where public restrooms are located.",
    "Increase the number of public restrooms available in the area.",
    "Promote living at Waypoint for seniors to reduce the need for driving.",
    "Enhance infrastructure at Waypoint to support bicycles, pedestrians, and buses.",
    "Reduce reliance on cars by improving alternative transportation options.",
    "Monitor the structural integrity of the Millenium Building in San Francisco for safety concerns.",
    "Evaluate the Bellingham waterfront utilization plans with consideration of potential structural issues.",
    "Assess the Waypoint project for any risks related to building sinking or tilting.",
    "Increase public awareness and media coverage about building safety issues in waterfront developments.",
    "Make the pump track a permanent feature in the park plans.",
    "Preserve the pump track as a cultural and recreational space for families and the community.",
    "Use central real estate for unique and vibrant community spaces like the pump track.",
    "Clarify whether additional parking or streets are planned for the area.",
    "Limit vehicle access in the development area.",
    "Provide plenty of pedestrian space in the development.",
    "Include robust bike parking facilities.",
    "Include information about the legacy of toxic waste left by GP in the waterfront narrative.",
    "Shift the waterfront narrative from a predominantly white settler perspective to a broader, more holistic perspective of the place.",
    "Create a Nature/Cultural Center focused on the natural history of the Salish Sea and the diverse cultural relationships with it.",
    "Increase the number of women's restrooms to reduce wait times.",
    "Ensure the design of public restrooms provides safety and privacy, preventing people from peeking inside.",
    "Install a couple of disc golf baskets near the waterway for practice and enjoyment.",
    "Promote disc golf in the area as a positive recreational activity to deter drug use and abuse.",
    "Implement the games idea as proposed.",
    "Ensure that overlooks provide views of interesting or significant sights.",
    "Make the pump track a permanent part of the park in the Lettered Streets neighborhood.",
    "Develop a public market facility along the waterfront similar to the Pybus Public Market in Wenatchee, featuring a farmers market, cafes, shops, and outdoor spaces to showcase local businesses and agriculture.",
    "Install outdoor concrete ping pong tables in the next phase of Waypoint park expansion.",
    "Consider implementing bidirectional bike lanes on only one side of the street in the Eldridge area.",
    "Use street space efficiently by adopting bike lane designs similar to those on Ravenna, around Green Lake, and in the UW District.",
    "Create space for delivery vehicle parking by adjusting bike lane placement.",
    "Provide the names of the consultants hired to perform the parking studies.",
    "Provide the times of day when the parking studies were performed.",
    "Install vertical posts for the bike lanes on Meridian.",
    "Install vertical posts for the bike lanes on Illinois.",
    "Ensure continued access to parking close to destinations for people with accessibility needs.",
    "Develop a plan for accessible parking that prioritizes the needs of disabled residents.",
    "Balance prioritization of cyclists and pedestrians with the provision of accessible parking.",
    "Recognize that not all disabled individuals use mobility aids and may require readily available parking.",
    "Clarify the distinction between 'dedicated space for bikes' and 'physically separated bike lanes' in the survey.",
    "Explore opportunities to place bike lanes between parked cars and the curb when parking is retained on one side of the street, including through or over existing bulbouts.",
    "Include content about personal accountability in the city's bike safety videos.",
    "Enforce traffic laws for bike riders to ensure they follow stop signs and traffic lights.",
    "Implement measures to improve bike rider behavior to increase safety and trust among drivers.",
    "Reconsider or provide alternatives before reducing parking availability in Bellingham due to already limited parking.",
    "Provide clarification on how bike lanes will be implemented in areas with limited street parking.",
    "Clarify whether the new sidewalks on W Illinois St. will require eliminating parking on one side of the street.",
    "Determine if additional easements will be needed on the south side properties to accommodate the new sidewalks.",
    "Implement appropriate roadway treatments to help keep traffic speeds from increasing.",
    "Use a different street for west-bound bike traffic.",
    "Consider the lack of cross streets on the north side of W Illinois for parking or deliveries when planning bike traffic.",
    "Provide a direct link to the actual Draft Land Use Chapter on the website or in the communication materials.",
    "Include childcare facilities in all new apartment buildings as part of the housing component.",
    "Fix the survey navigation so that users can proceed beyond the second question.",
    "Investigate and resolve the issue causing the survey to return to the original question when 'next' is clicked.",
    "Provide a clear and accessible link to the online survey for rating services and amenities.",
    "Ensure that the online survey is easy to find and navigate on the website.",
    "Include instructions or guidance on how to access and complete the online survey in the hard copy materials.",
    "Stop converting natural fields to artificial turf.",
    "Improve drainage solutions for natural turf fields.",
    "Reconsider the use of artificial turf for school playfields.",
    "Provide information on alternative playing fields for Bellingham co-ed softball teams after the removal of Geri fields.",
    "Preserve the central mature forest area within the Civic Athletic Complex.",
    "Ensure that Option 2 of the Master Plan fully protects Landmark Trees located directly north of the Sportsplex from development impacts.",
    "Commit to protecting all Landmark Trees at the Civic Athletic Complex in line with protections required of residents and private developers in public development projects.",
    "Develop a plan to preserve mature trees during development or construction.",
    "Identify and save landmark trees instead of removing them.",
    "Include a Senior Center in the Civic Complex plan.",
    "Provide more updates and opportunities for public feedback on the Civic Complex plan.",
    "Consider the benefits of locating the Senior Center near the Civic Complex due to better bus stops and proximity to the Lakeway centers.",
    "Implement binding changes to transportation infrastructure to reduce reliance on single occupancy vehicles.",
    "Develop specific plans to encourage walking, biking, and transit beyond current initiatives.",
    "Prioritize making walking, biking, and public transit more convenient and accessible than driving.",
    "Accelerate the transition to transportation modes with lower climate impact rather than relying solely on electric cars.",
    "City should contact Tesla about installing Tesla Superchargers in Bellingham.",
    "Do not allow developers to clear cut entire lots.",
    "Do not allow any trees over a certain size to be cut down.",
    "Implement policy changes related to electrification requirements promptly.",
    "Implement building efficiency requirements at both municipal and community-wide levels.",
    "Accelerate the timeline from planning to policy implementation despite challenges like COVID-19.",
    "Focus on policies that contribute to significant greenhouse gas reductions in the city.",
    "Do not allow PSE to administer solar panel refunds to avoid conflict of interest.",
    "Allow saved energy to be banked for the user or donated to community members in need instead of reverting to PSE.",
    "Develop battery stations for houses or neighborhoods to store excess electricity for purchase by others.",
    "Make solar panels or south-facing roofs mandatory on new construction by city regulations.",
    "Enable the ability for users to post questions on the website.",
    "Provide clear contact information for the transportation department.",
    "Allow users to directly contact relevant department staff through the website.",
    "Improve the website format to facilitate user inquiries and issue reporting.",
    "Inform citizens of Bellingham about the Tier 2 #3 Electrify Existing Buildings proposal promptly.",
    "Provide advance notice to residents to help them plan their purchases accordingly.",
    "Prevent citizens from buying gas systems and appliances with rebates that gas companies are promoting by sharing information about the proposal early.",
    "Provide specific data on the benefits of changing out a home gas heating system to meet overall goals.",
    "Explain why Cascade Natural Gas was included in the original development of goals despite potential conflicting interests between electric and gas utilities.",
    "Provide information on when Birchwood service will be available.",
    "Offer alternatives to Comcast/Xfinity for internet service.",
    "Update the survey to clarify that Jitter may not be available on all browsers or devices.",
    "Provide instructions or alternative methods to obtain Jitter if it's not shown on Speedtest.net on certain browsers or devices.",
    "Consider removing Jitter as a required metric if it is not consistently available across platforms.",
    "Fix the speed test to show consistent 'Ping' results instead of multiple different numbers.",
    "Include a labeled 'Jitter' measurement in the speed test results.",
    "Improve internet connectivity to prevent frequent 'no internet' messages.",
    "Provide alternative ways to take the survey that do not require internet access.",
    "Clarify whether the survey is intended only for city residents or also for those living just outside city limits, such as Lake Padden Estates.",
    "Conduct speed tests that isolate the ISP connection rather than testing to a specific provider.",
    "The City of Bellingham should focus on services included in the city charter.",
    "Leave internet service provision to private vendors who can provide cheaper and better service.",
    "Add a question to the broadband survey asking whether the speed test was conducted over WiFi or wired Ethernet.",
    "Clarify in the survey that local hardware or network setup can affect speed test results, to avoid misinterpretation of provider performance.",
    "Include data on the number of vacant or abandoned buildings in the housing market report.",
    "Provide estimates on whether units in vacant or abandoned buildings are suitable for rehabilitation.",
    "Include information on the rehabilitation suitability of buildings that could be brought into the rental market.",
    "Develop and communicate steps to bring existing homes into the rental market supply.",
    "Clarify if the 'number of housing units' exceeding 'number of households' in the table indicates sufficient housing inventory for that income category.",
    "Define the term 'equitable housing'.",
    "Explain what 'equitable housing' means.",
    "Increase support for job seekers, especially people of color.",
    "Implement programs to help people of color find employment.",
    "Develop affordable housing initiatives linked to employment opportunities.",
    "Enhance existing city efforts to assist job seekers in affording housing.",
    "Implement a tax on landlords",
    "Implement a tax on landlords who own more than a certain number of dwelling units.",
    "Apply a B&O tax to landlords similar to other businesses in Bellingham.",
    "Provide a B&O tax rebate, credit, or deduction to landlords who keep rents below a certain level.",
    "Require personal accountability from adults regarding homelessness.",
    "Encourage adults to meet higher expectations rather than being content with none.",
    "Reconsider the approach of giving houses to the homeless as it may not be effective based on examples from Los Angeles and San Francisco.",
    "Avoid increasing taxes on residents of Bellingham to fund homelessness programs that benefit a very small percentage of the population.",
    "City should invest directly in community-owned housing.",
    "Provide affordable housing options by renting without a profit motive.",
    "Investigate the issues that occurred at 22 State Street and Francis Place to understand why they were considered a disaster.",
    "Implement measures to prevent similar problems in future developments at 22 State Street and Francis Place.",
    "Provide an off-leash dog park area in Phase 2 of the park development.",
    "Ensure the off-leash dog park is included and communicated clearly in the park plans.",
    "Review the necessity of '15 Ton Limit' signs on every bridge.",
    "Assess whether the number of '15 Ton Limit' signs can be reduced.",
    "Evaluate the impact of current weight limit signage on traffic flow and safety.",
    "Specify the types of rose bushes planned for the rose hedge.",
    "Increase tree planting in the park to reduce barrenness.",
    "Provide clear instructions or a direct link to the 'Documents' tab mentioned in the Cordata Park Phase 2 Presentation.",
    "Clarify the location of the 'Documents' tab for easier access to the project scope, budget, and schedule information.",
    "Install lighting over the pickleball and basketball courts to allow for recreation until the park closes at 10 o'clock.",
    "Consider organizing fundraising efforts to support the installation of lighting on the courts.",
    "Provide information on the number of planned pickleball courts.",
    "Add more shade to the site through landscaping or additional shelters.",
    "Keep the current temporary entrance sign as it is, since it is visible and stylish.",
    "Use funds that would have been spent on a new entrance sign to support less fortunate citizens of Bellingham, such as providing food or housing.",
    "Allocate funds to hire an additional police officer to assist the understaffed police department.",
    "Include two columns on either side of the entrance as shown in option 3.",
    "Add a larger, more readable and obvious sign in the middle similar to options 1 or 2.",
    "Use the money for renovations and maintenance instead of a new sign.",
    "Resurface the tennis courts.",
    "Line both tennis courts for pickleball.",
    "Keep the existing sign as it is because it is readable to motorists.",
    "Repaint the crosswalk.",
    "Paint the curb white on the island.",
    "Offer alternative options for the project as requested by the community.",
    "Ensure that public comments are genuinely considered before moving forward with the project.",
    "Increase transparency about how public feedback influences project decisions.",
    "Allocate all available funds to fixing Arroyo Park.",
    "Ensure that Arroyo Park is restored for hiking, riding, and biking activities.",
    "Install a 'PARK ENTRANCE' sign with an arrow approaching the park to improve traffic navigation.",
    "Conduct a survey of other parks to identify signage issues, especially where entrances are obscure, uncertain, or located within residential streets.",
    "Use the $75k budget for park repairs instead of a new sign.",
    "Fix Arroyo Park bridge and address washouts.",
    "Repair the rotting/derelict Woodstock Farm buildings.",
    "Enable phone GPS functionality to set meet-up points in parks and share locations with others.",
    "Assign distinct and identifiable names to every entrance of each park, possibly using street names.",
    "Ensure park entrances are searchable by their distinct names for easier navigation and group coordination.",
    "Discuss and consider these suggestions seriously rather than dismissing them.",
    "Ensure the park's name on the entrance sign is large and has high contrast for easy readability at a glance.",
    "Prevent ivy or other plants from covering the letters on the sign.",
    "Use a permanent version of the current sign for durability and readability.",
    "Install lighting that specifically illuminates the park's name on the sign.",
    "Set the sign back for better visibility when exiting the park.",
    "Refresh the plantings across the island and on both sides of the driveway.",
    "Consider adding a lantern or finial at the top of the sign to give it a more historic look.",
    "Prefer a straight column design over a craftsman-looking tapered column for the sign structure.",
    "Avoid designs that resemble mall or condo development entrances unless using real Chuckanut sandstone.",
    "Use a short brick column with hanging flower baskets on either side of the driveway, accompanied by a standard, very legible park sign on the island.",
    "Post an update about this topic.",
    "Explain how last year's state law impacted City Hall's procedures.",
    "Add the matter to the planning commission's schedule or agenda for Spring 2021.",
    "Provide a copy of the e-mail Dick Conoboy sent to the Planning Commission during the last work session.",
    "Remove streateries and return streets and sidewalks to public use.",
    "Do not allow restaurants to conduct business on streets and sidewalks.",
    "Enforce rules preventing unauthorized use of public streets and sidewalks for business purposes.",
    "Increase the number of bikes using Holly to match or approach the number of cars.",
    "Ensure that bikes pay road taxes and licensing fees similar to cars.",
    "Address concerns of those who pay road taxes and licensing fees regarding contributions from cyclists.",
    "Include citizen feedback in the final report.",
    "Assess and consider the actual usage of the new bike lane.",
    "Stop unnecessary road closures and lane reductions.",
    "Avoid implementing road diets that reduce traffic lane capacity.",
    "Reconsider the expansion of bike lanes that reduce road capacity for vehicles.",
    "Prioritize reducing traffic congestion in the growing city over creating more bike lanes.",
    "Install a counter to track daily bike usage in the bike lane.",
    "Collect data on bike usage to assess the impact on vehicle traffic.",
    "Evaluate if the bike lane is justified based on bike usage data.",
    "Consider allowing bikes to share the road with cars if bike lane usage is low.",
    "Assess vehicle speeds in the downtown corridor to determine if separate bike lanes are necessary.",
    "Solicit more public feedback before implementing projects.",
    "Reevaluate and possibly cancel the current Bicycle Master Plan due to lack of common sense and public input.",
    "Improve traffic light timing on Holly to reduce car idling and pollution.",
    "Ensure city plans align with climate-friendly goals and do not increase pollution.",
    "Consider the impact of traffic projects on downtown businesses and shopper convenience.",
    "Cancel the current project before the pilot program ends.",
    "Inject more common sense into city government decision-making.",
    "Find out if the Council was presented with the possible downsides of the project before approval.",
    "Undo the project to improve driving safety and bike rider safety.",
    "Consider the needs and wants of all Bellingham citizens, not just bicyclists, when making transportation decisions.",
    "Reevaluate the reduction of vehicle lanes on Holly Street to avoid significant decrease in vehicle capacity.",
    "Improve bike lane design on Holly Street to ensure safety and comfort for bicyclists.",
    "Encourage bicyclists to use alternative routes that are not major arterials, such as Magnolia, Ellis, Cornwall, Whatcom Creek trail, and Railroad.",
    "Avoid negatively impacting drivers and bus riders when implementing bike lanes or other transportation changes.",
    "Invest transportation funds in street repairs, extended and more frequent bus service, and infrastructure projects like replacing the Electric Ave bridge.",
    "Conduct public surveys or feedback campaigns (e.g., banners directing to a website) to gauge public opinion on transportation changes like the Holly Street bike lanes.",
    "Assess the impact of street dining on traffic flow and consider adjustments to prevent lane reductions on major roads like Holly Street.",
    "Ensure transparency and avoid conflicts of interest in public works decisions, especially regarding street dining and lane reductions.",
    "Make the bike lanes on Holly Street a permanent solution after the pilot project.",
    "Consider removing parking instead of removing the bike lane to address safety concerns.",
    "Maintain the bike lane as it provides safety benefits for cyclists.",
    "Increase awareness among drivers about the perspective and safety of cyclists using the bike lane.",
    "Reconsider the design of the Holly Street bike lane to improve visibility for drivers turning right onto side streets.",
    "Implement measures to enhance safety for both bicyclists and drivers on Holly Street, especially concerning the interaction between bike lanes and parked cars.",
    "Increase awareness and caution among drivers and bicyclists using Holly Street due to current visibility issues.",
    "Explore alternative solutions to the current Holly Street revamping plan to better accommodate both car traffic and bicyclists safely.",
    "Make Citizen Participation comments received during the public comment period for the 2021 Annual Action Plan and Consolidated Plan available for citizens to review.",
    "Consider implementing a policy requiring bicycles to use the sidewalk on busy, high traffic streets like Lakeway, similar to Spokane's approach on Division Street.",
    "Avoid narrowing or reducing car lanes on Lakeway to prevent increased speeding and dangerous lane changes.",
    "Explore alternative solutions to improve bike safety on Lakeway without reducing car lanes.",
    "Do not reduce traffic lanes on Lincoln or Lakeway.",
    "Add bike lanes without reducing existing traffic lanes.",
    "Consider the safety impact of lane reductions.",
    "Avoid creating skinny lanes that may be unsafe or discriminatory.",
    "Include persons with disabilities and elderly people in planning committees.",
    "Ensure city planning considers the needs of people with disabilities and elderly who rely on cars, not just young people who ride bikes.",
    "Provide information on how long the comment page will remain open for submissions.",
    "Do not reduce the number of vehicle traffic lanes in the Lakeway freeway underpass project.",
    "Add an icon option on the project comment map for suggestions related to vehicle traffic flow improvements.",
    "Consider widening the Lakeway underpass as part of the project.",
    "Include an option to add vehicle lanes in the project planning or map interface.",
    "Allow adding bike lanes without sacrificing existing vehicle lanes.",
    "Consider constructing a new freeway underpass or tunnel specifically for bikes and pedestrians to avoid further restricting the existing Lakeway underpass.",
    "Install a traffic light at the blind corner on West and East Racine to improve safety when entering Lakeway.",
    "Enforce the speed limit on Lakeway between Puget Street and Yew Street to reduce speeding and improve safety.",
    "Eliminate the free right turn on red from BM Parkway heading east onto Samish Way to reduce lane blockage and traffic congestion on Samish Way southbound.",
    "Eliminate the free right turn from I5 south exit onto Samish Way to reduce traffic issues.",
    "Implement a 'do not block the box' marking at the intersection to prevent vehicles from blocking the intersection and lanes during free right turns.",
    "Develop future plans for Fouts Park.",
    "Improve the playground at Fouts Park.",
    "Enhance the landscaping at Fouts Park.",
    "Consider phasing out coin-operated meters.",
    "Maintain coin-operated meters for convenience and ease of use, especially in bad weather.",
    "Ensure parking machines are user-friendly and quick to operate, possibly with simpler payment options.",
    "Maintain or restore low-cost and free weekend parking options downtown to support residents and local businesses.",
    "Increase the availability of parking close to downtown residences and businesses to reduce reliance on distant parking garages.",
    "Consider the impact of parking fee increases on local residents and businesses before implementing changes.",
    "Explore alternative revenue sources for the city that do not disproportionately affect downtown residents and businesses.",
    "Engage with the community to find equitable parking solutions that preserve the small town vibe and support local commerce.",
    "Implement paid parking on South Cornwall.",
    "Remove trashy trailers from both sides of South Cornwall street.",
    "Clean up garbage from the street on South Cornwall.",
    "Address rat infestation on South Cornwall.",
    "Investigate and address drug activity indicated by tennis shoes on power lines on South Cornwall.",
    "Start beautification efforts in Bellingham by focusing on South Cornwall.",
    "Install parking meters on South Cornwall.",
    "Add parking meters to Boulevard Park to increase turnover of parking spaces.",
    "Address the issue of homeless individuals using the Commercial Street parking garage for various activities.",
    "Ensure that the parking fee change includes measures to improve safety and security in the Commercial Street parking garage.",
    "Analyze data on parking volume during December when parking was free.",
    "Analyze data on length of parking during December when parking was free.",
    "Analyze data on merchants' satisfaction during December when parking was free.",
    "Analyze data on residents' satisfaction during December when parking was free.",
    "Implement a parking validation option for downtown businesses.",
    "Support local businesses by encouraging customer-friendly parking policies.",
    "Consider alternatives to paid parking to attract customers to downtown businesses.",
    "Reconsider or modify the progressive parking rates to encourage longer stays downtown.",
    "Implement parking rates that support and promote shopping at downtown businesses.",
    "Evaluate the impact of progressive parking rates on downtown retail and restaurants and adjust accordingly.",
    "Provide the cost to the city for purchasing 47 parking meters for Fairhaven.",
    "Provide the projected pay off time for the parking meters program.",
    "Provide information on the ongoing administration and maintenance costs of the parking meters program.",
    "Allocate funds toward creating public parking lots or facilities in the Fairhaven District.",
    "The City should provide accommodations for residents of low-income housing impacted by newly mandated paid parking.",
    "The City should implement measures to mitigate the cost burden of paid parking on low-income households.",
    "The City should consider the financial impact of paid parking on community members in areas like Fairhaven and provide support accordingly.",
    "Remove the section of the project on Xenia from Old Lakeway to Lakeway Dr. due to the gully and lack of connectivity value.",
    "Lower the speed limit from 35 to 25 on Samish Way between I-5 and Ellis.",
    "Identify and designate an optimal bike route to downtown from the Yew St & Lakeway intersection under the new plan.",
    "Increase the priority for adding a bike lane on Lakeway up to the Yew St & Lakeway intersection.",
    "Add clear road markings on Woburn to facilitate safe left turns onto Fraser St.",
    "Implement safety measures to improve biking conditions in this area within the next 10 years.",
    "Add signage to convey the WA State law requiring cars to pass cyclists with at least three feet of separation.",
    "Implement enforcement measures to ensure compliance with the three-foot passing law.",
    "Increase public awareness about the three-foot passing law through education and outreach programs.",
    "Install the new bikeways over the next 10 years",
    "Install a hard lane divider at the Y intersection of Lakeway and Electric, similar to the one at Kenoyer.",
    "Improve safety measures at the Lakeway and Electric intersection to better protect cyclists from turning motorists.",
    "Implement traffic controls or redesign the intersection to reduce dangerous uncontrolled left turns from Lakeway to Electric.",
    "Add a safe bike path on the east side roads to enable cycling into town.",
    "Add a walking path on James Street to improve pedestrian safety.",
    "Add a walking path on Hannegan to improve pedestrian safety.",
    "Widen or improve the existing narrow path on Hannegan to make it safer for pedestrians.",
    "Connect the bike lane from south Yew Street to Samish.",
    "Improve safety on the road by addressing dangerous curves and lack of shoulder.",
    "Create bike connections between popular riding destinations and neighborhoods to facilitate safe use by kids.",
    "Create a protected bikeway connecting the Meridian/King Mountain neighborhood to downtown.",
    "Prioritize the construction of a protected bikeway across I5 in the bike master plan.",
    "Develop a safer bike route across the I5 freeway near the Meridian I5 interchange/Telegraph Rd intersection to reduce traffic.",
    "Look at Eugene as an example of good biking infrastructure.",
    "Continue improving biking infrastructure in Bellingham.",
    "Provide use of force data in raw data format, such as spreadsheets, instead of PDFs.",
    "Make the raw use of force data accessible on the city's website for residents to view.",
    "Improve the interpretation and presentation of use of force statistics to be clearer and more user-friendly.",
    "Contact local homeless shelters or organizations that work with homeless populations.",
    "Reach out to city or county social services departments.",
    "Contact non-profit organizations focused on homelessness.",
    "Engage with community advocacy groups for the homeless.",
    "Reach out to government agencies responsible for housing and urban development.",
    "Set a sweat equity deadline for community members.",
    "Implement a navigation system to help community members find part-time jobs.",
    "Encourage community members to contribute by working and paying taxes.",
    "Develop plans to build a community center",
    "Provide clear information about whether the Post Point Dog Park will be permanently closed or only temporarily closed during construction.",
    "Inform the public about the status of the trail to the Heron nesting area and whether it will be closed during the treatment plant expansion.",
    "Provide data on the annual therms and dollars spent on incinerating sewage.",
    "Provide the number of full-time equivalent employees required to maintain and operate sewage incinerators.",
    "Contact SGS AXYS Analytical Services in Sidney, B.C. as recommended in the Re Sources follow-up letter to the Mayor.",
    "Research other countries that use biosolids for purposes other than spreading on land.",
    "Make Bellingham's regulations for creating ADUs less restrictive, similar to Seattle and Tacoma.",
    "Simplify the notification process for creating ADUs, reducing the radius and number of parties that must be informed.",
    "Increase transparency by publishing Bellingham's ADU regulations for the general public.",
    "Review and revise Whatcom watershed regulations to allow elder family members to live in ADUs within their adult child's home.",
    "Ensure Bellingham's housing policies support elderly and disabled individuals living in community settings rather than institutions.",
    "Incorporate considerations for individuals with autism spectrum disorder and other disabilities in the planning department's accommodation policies.",
    "Comply with federal laws such as the Olmstead Agreement to support developmentally disabled individuals living in the least restrictive environment.",
    "Promote equality, equity, and respect in housing policies to foster health, safety, and well-being for all community members.",
    "City should control or limit the building of condos on currently undeveloped parcels.",
    "Do not sell the meadow adjacent to the Connelly Creek trail and the Hospice to developers.",
    "Stop building more condos.",
    "Encourage large developers like Lamar, Toll Brothers, and Pulte to build in the Bellingham area.",
    "Allow more builders, including non-local ones, to develop in Bellingham to increase competition.",
    "Increase the pace of home construction in Bellingham.",
    "Improve the quality standards for new homes built in Bellingham.",
    "Provide a map showing areas proposed as high density designation.",
    "If a map is not available, provide information on areas expected to be designated as high density.",
    "Specify current designations (e.g., RM-Multi) that are proposed to be changed to high density designation.",
    "Clarify whether a high density designation allows developers to build higher than existing height restrictions.",
    "Clarify whether higher density means only smaller unit sizes without increasing building height.",
    "Review proposals for changes in height restrictions.",
    "Examine methods of measuring building heights in current code and neighborhood plans.",
    "Assess if any proposals affect existing height measurement methods or restrictions.",
    "Install sewer systems in areas currently using septic systems, especially those zoned for higher density.",
    "Allow property owners in these areas to increase housing density if they connect to sewer systems.",
    "Address pollution issues caused by septic systems, such as E. coli contamination in Baker Creek and Squalicum Creek.",
    "Invent or choose new terminology to replace terms that cause disharmony, such as 'single-family zoning'.",
    "Replace the term 'single-family homes' with alternatives like 'one-family-buildings' or 'one-family structures' to better reflect reality.",
    "Encourage the use of the term 'detached homes' when referring specifically to homes that are not attached to others.",
    "Initiate or participate in a dialogue within City Hall about the planning terminology used and its impact on public understanding and discourse.",
    "Include non-experts with thoughtful ideas, such as the commenter, in discussions about planning terminology to bring fresh perspectives.",
    "Consult agencies managing permanent supportive housing, such as the Opportunity Council and Northwest Youth Services, about the resources needed beyond current funding.",
    "Assess and address the critical scarcity of services available and accessible to permanent supportive housing locations.",
    "Develop and implement improvements in providing effective services at housing programs to meet community and resident expectations.",
    "Check the city's official website for information on responsibilities and services.",
    "Contact the city's customer service or public works department to inquire about specific issues.",
    "Review local government documents or ordinances that outline city responsibilities.",
    "Use any available city apps or online portals to report issues and see if they fall under city jurisdiction.",
    "Provide a plan for managing streateries that block traffic lanes, specifically at Holly and Champion.",
    "Include language in the report addressing how streateries blocking traffic lanes will be handled.",
    "Conduct a traffic engineering study before allowing traffic lanes to be closed for streateries, if not already done.",
    "If a traffic engineering study has not been conducted, commit to undertaking one.",
    "Evaluate the impact of existing requirements for permanent streateries.",
    "Assess whether the current requirements are adequate and effective in promoting more streateries.",
    "Clarify the purpose and intent of the permanent streateries requirements.",
    "Determine if the requirements prioritize maximum safety and rigorous construction to the extent that they hinder functionality.",
    "Investigate if the permanent structures regulations act as a restriction on construction.",
    "Consider making the permanent structures requirements less onerous to encourage more permanent streateries.",
    "Identify if any current streateries are permanent.",
    "Analyze the reasons why there may be no permanent streateries currently.",
    "Provide information on the requirements to make the 'streateries' a permanent feature.",
    "Maintain or increase pedestrian-focused areas in downtown.",
    "Reduce car traffic in downtown to prioritize people.",
    "Develop and implement a plan to plant native trees around the Sunset Pond trail.",
    "Plant native trees in East Orchard where trees have thinned out.",
    "Plant native trees along Fruitland Drive.",
    "Plant native trees in the green space on Lemon Grove Drive to replace trees that were cut down.",
    "Do not implement the Urban Forest Plan.",
    "Ensure that the Urban Forest Plan does not make development and building housing more difficult or unaffordable.",
    "Address habitat loss caused by developments in the city plan.",
    "Include a plan for managing over mature trees, such as cutting them to create habitat stumps.",
    "Develop planting guidelines recommending deciduous trees on the south side of buildings and coniferous trees on the north side for noise buffering and privacy.",
    "Incorporate evolving best practice forestry methods over the 15-25 year lifespan of the plan.",
    "Ensure the plan includes measures to protect mature trees from being lost to developments like the Meridian development.",
    "Educate the public about the property value benefits of trees to encourage voluntary pro-forest behavior.",
    "Address the invasive horse chestnut tree threat near Chuckanut Creek under the 12th Ave bridge to prevent its spread.",
    "Educate the public about the negative impacts of social trails to reduce their creation and protect natural areas.",
    "Avoid planting small, slow-growing dwarf street trees that provide little urban forest value; instead, choose more beneficial species.",
    "Facilitate hyper-local neighborhood involvement and volunteerism in forestry work such as planting and tree maintenance.",
    "Focus education on the economic value of trees to encourage planting rather than relying solely on expensive tree incentive programs.",
    "Limit watering newly planted trees to one summer with correct tree selection and planting, instead of watering for three years.",
    "Avoid mulching trees that are not appropriate for their site; allocate resources to trees that can grow with minimal maintenance after establishment.",
    "Reevaluate the cost and scope of expanding city maintenance to include all street trees to ensure efficiency and cost-effectiveness.",
    "Protect mature trees in Bellingham to preserve its beauty and character",
    "The city should improve protection for mature trees.",
    "The city should consider the impact on mature trees before approving developments like BGCC.",
    "The city should ensure affordable housing is included in new developments.",
    "Planting new trees is not an effective mitigation for loss of mature trees; alternative solutions should be considered.",
    "The city should establish clear, enforceable laws to protect mature trees.",
    "Plant more trees along West Street in the Columbia Neighborhood to enhance its appeal and potentially increase property values.",
    "Divert bath water to water plants.",
    "Save rainwater in barrels for later use.",
    "Replace lawns with vegetable gardens.",
    "Use drip irrigation for watering plants.",
    "Reuse hand washing water to flush toilets.",
    "Clarify the purpose of the public comment period ending June 6th.",
    "Explain the purpose of the public hearing in August.",
    "Describe the differences between the two public comment opportunities.",
    "Assess the purity of the discharge outfall from Bellingham WWTP.",
    "Determine if the discharge outfall is being reused in a 'purple pipe' distribution system.",
    "Find out the million gallons per day (MGD) amount of the outfall.",
    "Provide information on whether the City system removes PFAs.",
    "Enforce the city code that prohibits loud construction/demolition noise during quiet hours (10:00pm-7:00am).",
    "Provide the project manager's contact information to residents for noise complaints.",
    "Provide clear signage indicating the location of restrooms.",
    "Ensure restrooms are easily accessible and well-marked.",
    "Consider planting and maintaining educational demonstration gardens in the park.",
    "Evaluate the suitability of the park as a location for educational demonstration gardens, especially considering flooding issues at the current Ferndale Hovander County Park location.",
    "Promote the pump track from an interim use to a permanent design element.",
    "Prevent the removal of the pump track to make way for privately held buildings to preserve public benefit.",
    "Install a small boat visitor's float.",
    "Provide information about budget or proposal opportunities for public art.",
    "Provide current information about activities in the 'Potential Future Access' area.",
    "Explain how the new phase planning addresses the 'Potential Future Access' area."
  ]
}